{"title":"[-MomsTeachSex-] Aria Alexander, Silvia Saige [-Taking Turns-] -","uid":11935992,"size":357315613,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:0009b3dd5aa39ed079f03803a21adecc3c6c290c&amp;dn=%5B-MomsTeachSex-%5D+Aria+Alexander%2C+Silvia+Saige+%5B-Taking+Turns-%5D+-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"Upl0ad3rR","files":1,"time":1431899749,"description":"[-MomsTeachSex-] Aria Alexander, Silvia Saige [-Taking Turns-] --NEW-- 17-May-2015\n\n---:More From My Torrent's Here:---   &lt;a href=&quot;\nhttps://thepiratebay.se/user/Upl0ad3rR&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.se/user/Upl0ad3rR&lt;/a&gt;\n\n---:ScreeNshotS:---  &lt;a href=&quot;\nhttp://image-tpb.com/img-5558f22199edb.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image-tpb.com/img-5558f22199edb.html&lt;/a&gt; \n &lt;a href=&quot;\nhttp://image-tpb.com/img-5558f22647d8f.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image-tpb.com/img-5558f22647d8f.html&lt;/a&gt; \n\nSilvia Saige is hanging out with her stepdaughter Aria Alexander. She has just stepped in to take a phone call when she sees her stepdaugher's friend Alex Jones spying on Aria! Chris is embarrassed when he's caught with his cock out, but Silvia takes pity on him and offers to help him get some.\n\nWhen Alex gets naked to put on some swim trunks, the girls confront him in the cabana and make it clear that he won't need any pants. Within moments Aria is eagerly giving Alex a blowjob with Silvia watching and helping as needed to make sure that it's the best Alex has ever had.\n\nEventually it's time to kick things up a notch. Flipping over to lay on her belly with her head between Silivia's legs so that she can eat out her stepmom's juicy snatch, Aria thrusts her ass up in the air so that Alex can slide home into her tight twat. Alex takes Aria up on her invitation, pumping in and out of her Censored hole with the goal of making her cum!\n\nAlthough Aria is loving every second of her Censored pounding, Silvia deserves a turn, too. She decides to demonstrate the proper way to go for a stiffie ride while using Alex as her personal stud. Soon she is bouncing on Alex's cock so fast that her big tits bounce with the force of it, and she won't stop until she is pulsing with ecstasy.\n\nNow that Aria has seen her stepmom cumming, she wants another turn. Pushing one leg up high in the air for deeper penetration, Aria welcomes Alex back into her landing strip twat so that he can drive her towards paradise.\n\nOnce he has achieved his goal, Alex gets a treat of his own when Aria and Silvia press their bottoms together over his cock and start bouncing away with their makeshift channel. It isn't long before Alex can't hold back anymore. The girls turn around just in time to each get a face full of hot cum that they share with a kiss","torrent":{"xt":"urn:btih:0009b3dd5aa39ed079f03803a21adecc3c6c290c","amp;dn":"%5B-MomsTeachSex-%5D+Aria+Alexander%2C+Silvia+Saige+%5B-Taking+Turns-%5D+-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0009b3dd5aa39ed079f03803a21adecc3c6c290c","infoHashBuffer":{"type":"Buffer","data":[0,9,179,221,90,163,158,208,121,240,56,3,162,26,222,204,60,108,41,12]},"announce":[],"urlList":[]}}