{"title":"The Jam  -  The Gift  (1982)","uid":6806521,"size":511286877,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:00b357d6ba8c494666af6c183fde536612d96fc3&amp;dn=The+Jam++-++The+Gift++%281982%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"neil1966hardy","files":26,"time":1320882651,"description":"Polydor Universal (UK) 2007.\nOriginal Cd&gt;EAC&gt;Wav&gt;XRecode&gt;APE&gt;Traders Little Helper&gt;Flac.\nBonus Track-Singles from other sources\n\nThe Gift was the final studio album by The Jam. Released on March 12, 1982, it reached #1 on the British charts. Clocking in at 32:17 minutes, the album received a mixed reception from critics and fans.\n\nThe original release of the album was on 12&quot; vinyl, and initial copies came with a paper bag stating &quot;The Jam... A Gift&quot;. These copies are increasingly difficult to find, especially in good condition. Other issues included the regular vinyl issue, the Japanese vinyl issue (with a bonus lyric book), the CD issue, the re-mastered issue, and a recently issued Japanese version in a mini-LP style sleeve.\n\nThe album moved away from the simple three-chord music of In the City and This Is The Modern World and demonstrated Weller's love of northern soul. Funk bass lines and wah-wah guitar effects were often used throughout the album, along with jazz influences such as brass sections and saxophone solos (most notably on the track &quot;Precious&quot;). Only two songs on the album exceed three and a half minutes.\n\nThe biggest hit of the album was &quot;Town Called Malice&quot;. The song's lyrics are an accurate reflection of English life at the time, and deal with small-town issues such as alcoholism, the struggle to make a living, unemployment and lack of facilities in small towns.\n\n&quot;Just Who Is The 5 O'Clock Hero?&quot;, which was released as a 7&quot; vinyl single in Holland only, represents the efforts put in by 9-to-5 working men and women of Britain, who keep society running (and as such, are unsung heroes). Unlike the earlier song &quot;Mr. Clean&quot; from All Mod Cons, Weller does not mock the character, but rather praises him/her (However, the character from &quot;Mr. Clean&quot; represents a completely different strata of society, the executive/upper management types who would typically hound and otherwise make the character from &quot;Just Who Is The 5 O'Clock Hero?&quot;'s life difficult.).\n\nWeller's experimentation of several different musical styles previously unexplored by The Jam on this album led to increasing disagreement with the other band members, Bruce Foxton and Rick Buckler, who were disillusioned with the move away from a traditional pub rock or punk rock style. The band broke up after touring the album (even after its massive success, rising to #1 on the British charts) on the 'Trans-Global Express Tour'.\n\nAfter the album's release, Paul Weller went on to form The Style Council. The song &quot;Carnation&quot; was later covered by Liam Gallagher of Oasis and Steve Cradock of Ocean Colour Scene\n\n\n01. Happy Together [2:51]\n02. Ghosts [2:11]\n03. Precious [4:13]\n04. Just Who Is the 5 O'Clock Hero? [2:15]\n05. Trans-Global Express [3:59]\n06. Running on the Spot [3:06]\n07. Circus (Bruce Foxton) [2:11]\n08. The Planner's Dream Goes Wrong [2:19]\n09. Carnation [3:28]\n10. Town Called Malice [2:55]\n11. The Gift [3:08]\n\nAll songs by Paul Weller except where otherwise noted\n\nSome songs of the album are clearly funk styled, and ? brass secton is involved (Steve Nichol - trumpet, Keith Thomas - saxophones). The song Town Called Malice, another major hit of the Jam, is soul based.\n\nAnd now - a traditional self-made bonus (lossless) made up from the Jam's singles.\n\n12. Funeral Pyre\n13. Disguises\n14. Absolute Beginners\n15. Tales From The Riverbank\n16. The Bitterest Pill (I Ever Had To Swallow)\n17. Pity Poor Alfie | Fever\n18. Beat Surrender\n19. Shopping\n20. Move On Up\n21. Stoned Out Of My Mind\n22. War\n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:00b357d6ba8c494666af6c183fde536612d96fc3","amp;dn":"The+Jam++-++The+Gift++%281982%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00b357d6ba8c494666af6c183fde536612d96fc3","infoHashBuffer":{"type":"Buffer","data":[0,179,87,214,186,140,73,70,102,175,108,24,63,222,83,102,18,217,111,195]},"announce":[],"urlList":[]}}