{"title":"The Mudmen.rar","uid":3909618,"size":395472746,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:010d2968737ca77c7770fd3f8105f5ec48d172db&amp;dn=The+Mudmen.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"smartcanuck","files":1,"time":1196064320,"description":"Mudmen are a Canadian rock band based out of Ontario. The band was formed in 1998 by Zoy Nicoles and brothers Sandy Campbell and Robby Campbell. Currently, the band comprises vocalist Zoy Nicoles, guitarist Boots, bassist Ben Spivak, and drummer J-Money with the Campbell brothers on bagpipes.\n\nThe band are best known for their singles &quot;5 O&amp;#039;Clock&quot; and &quot;Saturday&quot;, and for their covers of Spirit of the West&amp;#039;s &quot;Home For a Rest&quot; and AC/DC&amp;#039;s &quot;Long Way to the Top&quot;. In addition, the band recently hit it big with the single &quot;Lost,&quot; which was featured in the promos for the NBC television show The Black Donnelly&amp;#039;s. Their single Animal was featured on the soundtrack of the hit video games Burnout 3 and MX vs. ATV Unleashed.\n\nThe band&amp;#039;s name comes from the occupation of the Campbell brothers prior to forming the band; they were mixing mortar and carrying bricks for bricklayers. The band was influenced by traditional Scottish music as well as hard rock groups like AC/DC. The Mudmen have opened for many bands, including ZZ Top, Tool, Dropkick Murphys and Bowling for Soup as well as fellow Canadians Nickelback, Sum 41 and The Guess Who.\n\nThe Mudmen have toured in Canada, the United States and Great Britain. The band has three albums, Mudmen (2000), Overrated (2003) and Defending the Kingdom (2005). Six Mudmen videos have been produced and shown on MuchMusic. As of 2005, the band is touring throughout Canada and are have released their third (October 11th) album Defending the Kingdom and are working on a live DVD.\n\nCredit to Wikipedia\n\nSorry for the last torrent, it wouldn&amp;#039;t upload past 98% so I made it a single .rar file.","torrent":{"xt":"urn:btih:010d2968737ca77c7770fd3f8105f5ec48d172db","amp;dn":"The+Mudmen.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"010d2968737ca77c7770fd3f8105f5ec48d172db","infoHashBuffer":{"type":"Buffer","data":[1,13,41,104,115,124,167,124,119,112,253,63,129,5,245,236,72,209,114,219]},"announce":[],"urlList":[]}}