{"title":"Your Best Brain Ever: A Complete Guide and Workout prabhu_","uid":9429492,"size":41487995,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:01905b6c40aaa29229f1d45b978f52dbc48bc352&amp;dn=Your+Best+Brain+Ever%3A+A+Complete+Guide+and+Workout+prabhu_&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"prabhu_","files":3,"time":1388766520,"description":"Your Best Brain Ever: A Complete Guide and Workout\n\nby  Michael S. Sweeney   , Cynthia R. Green\n\n\nabout book :-\n\nNational Geographic presents a comprehensive guide to fighting mental decline. With cutting-edge neuroscience, information about Alzheimer's, fascinating case studies, and tips to fight brain aging symptoms such as slower mental acuity and &quot;senior moments,&quot; this smart, engaging guide will help keep your memory sharp and your mind active. Fun, age-defying exercises--from body stretches to word games to foods that help you think--help the brain perform at its best, just like exercising does for other parts of the body. Leading memory loss expert Cynthia R. Green, PhD, and eminent science writer Michael Sweeney have created a book both informational and practical that gives readers everything they need to know about the care and feeding of one of the body's most important organs: the brain.\n\nAbout the Author :-\n &lt;a href=&quot;\nhttp://g-ecx.images-amazon.com/images/G/01/ciu/a0/5d/0573c0a398a0bfc4befe2210.L._V192673998_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://g-ecx.images-amazon.com/images/G/01/ciu/a0/5d/0573c0a398a0bfc4befe2210.L._V192673998_.jpg&lt;/a&gt;\n\nMemory fitness and brain health expert CYNTHIA R. GREEN is president of Memory Arts, LLC, which provides memory fitness and brain health training to organizations and individuals. She has appeared onGood Morning America, 20/20, Fox News, and NPR's Talk of the Nation and is a regular contributor to the Huffington Post.\n\nMICHAEL SWEENEY, a graduate of the University of Nebraska-Lincoln, received his Ph.D. in Journalism from Ohio University's E.W. Scripps School of Journalism and his Master's in Journalism at the University of North Texas. He reported for nationalgeographic.com on Dr. Robert Ballard's Titanic expedition. Sweeney's numerous books include Brainworks, The Ultimate Survival Book,Peace: The Biography of a Symbol, God Grew Tired of Us, and Mind: The Complete Brain.\n\n`~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~`\n  SEED PLEASE , LET OTHERS GET IT TOO. \n `~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~`\t\n","torrent":{"xt":"urn:btih:01905b6c40aaa29229f1d45b978f52dbc48bc352","amp;dn":"Your+Best+Brain+Ever%3A+A+Complete+Guide+and+Workout+prabhu_","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01905b6c40aaa29229f1d45b978f52dbc48bc352","infoHashBuffer":{"type":"Buffer","data":[1,144,91,108,64,170,162,146,41,241,212,91,151,143,82,219,196,139,195,82]},"announce":[],"urlList":[]}}