{"title":"Delta Goodrem - Believe Again HDTV 720p","uid":4044793,"size":157083648,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:01ab1cb9599526f137a508578f524570498da56e&amp;dn=Delta+Goodrem+-+Believe+Again+HDTV+720p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cluttrell","files":1,"time":1203813679,"description":"&quot;Believe Again&quot; is a pop song written by Delta Goodrem, Brian McFadden, Stuart Crichton and Tommy Lee James, produced by Stuart Crichton and Marius de Vries for Goodrem&amp;#039;s third studio album Delta (2007). The single, released in Australia on December 8th, 2007, features exclusive remixes and the unreleased B-Side track, &quot;Fortune And Love&quot;. The single was released to radio on November 12, 2007, although it had its premiere on commercial radio in late-October, 2007.\n\nThe video, shot in a warehouse in Sydney, was filmed in the week ending October 20 by Michael Spiccia, a friend of Goodrem. In it, Goodrem plays different mystical characters including a water nymph most likely to be the Nymph of Springs Pegaeae, a crystal-covered, cave dwelling Wiccan or Nymph and a sky goddess swathed in navy satin, most likely Au?rin? a Lithuanian Sky deity.\n\nAccording to the Sun Herald newspaper, it is one of the most expensive music videos to be produced in recent years. When speaking exclusively about the video, Goodrem said: &quot;There&amp;#039;s flames and water - it&amp;#039;s a real fantasy sequence, but it&amp;#039;s quite dark. It&amp;#039;s not going to be a bright-looking clip.&quot;\n\nThe video is the first to be released in HD resolution in Australia. The video has many special-effects, in total 109 shots according to the director, more than the average feature film. It took 2 days to film and 6 weeks to complete the special effects. Art-directors from Australia, America and Spain were included in the production of the video.\n\nThe first shots from the video were incorporated into the album&amp;#039;s television promotional commercial that has been broadcasted nationally on commercial networks since the beginning of November, although these shots did not make it to the final edit of the video.\n\nThe full video premiered on Channel V on December 5. It can now be seen on the official website and on full rotation on all music networks.\n\n","torrent":{"xt":"urn:btih:01ab1cb9599526f137a508578f524570498da56e","amp;dn":"Delta+Goodrem+-+Believe+Again+HDTV+720p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01ab1cb9599526f137a508578f524570498da56e","infoHashBuffer":{"type":"Buffer","data":[1,171,28,185,89,149,38,241,55,165,8,87,143,82,69,112,73,141,165,110]},"announce":[],"urlList":[]}}