{"title":"A Reasonable Response - Dr. William Lane Craig","uid":11757301,"size":3050010,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0210e6844996c29975acd9e7cf05db8d0e77c152&amp;dn=A+Reasonable+Response+-+Dr.+William+Lane+Craig&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"starxteel","files":2,"time":1426450291,"description":"More uploads at\n\nFollowers of Jesus need not fear hard questions or objections against Christian belief. In A Reasonable Response, renowned Christian philosopher and apologist William Lane Craig offers dozens of examples of how some of the most common challenges to Christian thought can be addressed, including:\n\nWhy does God allow evil?\nHow can I be sure God exists?\nWhy should I believe that the Bible is trustworthy?\nHow does modern science relate to the Christian worldview?\nWhat evidence do we have that Jesus rose from the dead?\n\nUtilizing real questions submitted to his popular website ReasonableFaith.org, Dr. Craig models well-reasoned, skillful, and biblically informed interaction with his inquirers. A Reasonable Response goes beyond merely talking about apologetics to showing it in action. With cowriter Joseph E. Gorra, this book also offers advice about envisioning and practicing the ministry of answering people's questions through the local church, workplace, and in online environments.\n\nWhether you're struggling to respond to tough objections or looking for answers to your own intellectual questions, A Reasonable Response will equip you with sound reasoning and biblical truth.\n\n\nAbout the author:\nWilliam Lane Craig (PhD, philosophy, University of Birmingham; ThD, systematic theology, University of Munich) is Research Professor of Philosophy at T albot School of Theology, Biola University, in La Mirada, California. He is also president of the Evangelical Philosophical Society. Craig has published articles in philosophical and theological journals such as The Journal of Philosophy, American Philosophical Quarterly, Philosophical Studies, Philosophy, British Journal for the Philosophy of Science, Modern Theology and Religious Studies. He has written or cowritten more than twenty books, including The Kalam Cosmological Argument; Divine Foreknowledge and Human Freedom; Theism, Atheism and Big Bang Cosmology and God, Time and Eternity","torrent":{"xt":"urn:btih:0210e6844996c29975acd9e7cf05db8d0e77c152","amp;dn":"A+Reasonable+Response+-+Dr.+William+Lane+Craig","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0210e6844996c29975acd9e7cf05db8d0e77c152","infoHashBuffer":{"type":"Buffer","data":[2,16,230,132,73,150,194,153,117,172,217,231,207,5,219,141,14,119,193,82]},"announce":[],"urlList":[]}}