{"title":"Kriya - Take a Deep Breath.pdf","uid":4356856,"size":73222,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0256d8e85c50d9abbe009124207bfcf2e81c57de&amp;dn=Kriya+-+Take+a+Deep+Breath.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"welovesrisri","files":1,"time":1219450225,"description":"We do it without even thinking, but breathing well can turn our lives around,\nsays Bronwyn McNulty.\n\nWhen Ivan Brownrigg lost his 17-year-old daughter,\nAmy, in a car accident three years ago, he didn't\nknow what to do with himself.\n\n&quot;I wasn't great at crying,&quot; says Ivan, 52, a Disaster\nRecovery Consultant from McMahons Point, Sydney.\n&quot;I had a dark feeling of emptiness inside that I couldn't shift.&quot;\n\nA counsellor suggested Ivan look at attending\ntherapy sessions, but Ivan wasn't keen. He turned to\nhis doctor, who prescribed anti-depressants. Ivan\nknew they would probably  help dull the pain in the\nshort term, but he felt simply taking a pill would only mask his feelings,\nrather than actually help resolve them.\n\n&quot;I never took the pills because I got all the wrong feelings when they started\ntalking about medication,&quot; he says. Then a friend suggested he try a simple breathing technique called Sudarshan Kriya (SKY), which is based on the ancient Indian practice of yoga.\n\n&quot;I was aware almost immediately that something had changed,&quot; says Ivan.\n&quot;I'd had an argument with Amy before she died, but when I did the breathing I\nfelt a complete sense of forgiveness on her behalf. I didn't need to feel upset\nthat the last time we'd met I had been angry. All I felt was love and warmth. I\nthink that unresolved argument was part of why I was I was feeling so bad.&quot;\nbanishing depression\n\n&quot;The more I did SKY, the more the depression lifted. Within a month, after\npractising every day for 20 to 30 minutes, I started to notice that all areas of\nmy life seemed to be less stressful and more enjoyable than before,&quot; Ivan\ncontinues.\n\nWhile Amy's death was still bitterly hard to bear, practising SKY made Ivan\nfeel he could carry on.\n\n&quot;It changed my thoughts about Amy's death in the sense the heavy feeling\nlifted, and I felt I could get in touch with her more - but not in a sad way. I got\na sense of who she was, but differently than when she was alive. She\nseemed to be such an incredible being and I was so glad to have known her.&quot;\nIt's an incredible result given that SKY is little more than breathing in and out.\nThat's right, this amazing new therapy is simply a specific sequence of\nbreathing patterns separated by brief periods of normal breathing.\nBecause breathing is closely linked to the emotions, focusing on the breath\ncan alter your emotional state. For example, when you're feeling unhappy\nyou'll often breathe more slowly and end the occasional breath in a long sigh.\nUsing SKY's breathing sequence you can trigger a sense of calm, creating a\nbalance between mind, body and spirit, releasing negative emotions and\nrejuvenating the body.\nSudarshan Kriya practice has three different breathing cycles. The first is\nslow with seven to eight breaths, the second is medium speed with 15\nbreaths and the third is fast with 30 breaths. These cycles are then\ninterspersed with normal breathing.","torrent":{"xt":"urn:btih:0256d8e85c50d9abbe009124207bfcf2e81c57de","amp;dn":"Kriya+-+Take+a+Deep+Breath.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0256d8e85c50d9abbe009124207bfcf2e81c57de","infoHashBuffer":{"type":"Buffer","data":[2,86,216,232,92,80,217,171,190,0,145,36,32,123,252,242,232,28,87,222]},"announce":[],"urlList":[]}}