{"title":"The Story of Jacob and Joseph","uid":12340979,"size":1525156340,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:029238c18d443d7ffa18ffd35efd84fda6f29375&amp;dn=The+Story+of+Jacob+and+Joseph&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"POtHS11","files":2,"time":1441297380,"description":"The Story of Jacob and Joseph is a 1974 American historical drama television film directed by Michael Cacoyannis, based on the biblical Book of Genesis with a screenplay written by Ernest Kinoy. It stars Keith Michell as Jacob, Tony Lo Bianco as Joseph, Colleen Dewhurst as Rebekah, Herschel Bernardi as Laban, Harry Andrews as Isaac, and Julian Glover as Esau.\n\nFilmed on location in Israel, The Story of Jacob and Joseph originally aired in the United States on the American Broadcasting Company on April 7, 1974. The biblical narrative was continued two years later with The Story of David (1976), also produced for ABC-TV and involving many of the same cast and crew.\nPlot summary\n\nThis film is the narrative of the Biblical patriarchs, Jacob and his son Joseph. Part I details the story of Jacob fleeing his tribe after cheating his brother Esau out of his birthright, getting cheated himself in his exile years, and learning of the need to make amends. Part II is of the story of Jacob's favourite son, Joseph. Betrayed and sold into slavery by his brothers, he meets and overcomes adversity to become the prime minister of Egypt, closest official to the Pharoah himself","torrent":{"xt":"urn:btih:029238c18d443d7ffa18ffd35efd84fda6f29375","amp;dn":"The+Story+of+Jacob+and+Joseph","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"029238c18d443d7ffa18ffd35efd84fda6f29375","infoHashBuffer":{"type":"Buffer","data":[2,146,56,193,141,68,61,127,250,24,255,211,94,253,132,253,166,242,147,117]},"announce":[],"urlList":[]}}