{"title":"New Marvel I Like 10-24-2012","uid":7756278,"size":176202962,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:041850e472773f30135265ba42e1bc9e70db51a6&amp;dn=New+Marvel+I+Like+10-24-2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dadrkhomr","files":11,"time":1351109464,"description":"These are the Marvel comics I got from the week beginning 10/24/2012.  These are not a complete list of what Marvel put out this week.  There are other torrents for that. There are 10 titles in this week's offering. All comics are either in CBR or CBZ format and are labeled individually.  Please do not share my descriptions or torrent ads with anyone without messaging me first.  If this torrent has no seeds please msg me privately.  I will be glad to reup anything that has no seeds.  I sincerely ask that if you like what you get, please purchase them in some way.  We cannot do what we do if there is nothing being made to scan and upload.\n\nStarting with the first week of November, I will be releasing a new pack with only the Marvel Now comics.  I will still carry this torrent as well as my DC Universe 52, Zero Day, and Independent comics packs.  If you would like to help, please let me know.  \n\n[IMG]http://i1231.photobucket.com/albums/ee510/darkhomr/axm55.jpg[/IMG] [IMG]http://i1231.photobucket.com/albums/ee510/darkhomr/avengers22.jpg[/IMG] [IMG]http://i1231.photobucket.com/albums/ee510/darkhomr/ca19.jpg[/IMG] [IMG]http://i1231.photobucket.com/albums/ee510/darkhomr/im527.jpg[/IMG] [IMG]http://i1231.photobucket.com/albums/ee510/darkhomr/ucu17.jpg[/IMG]\n\n\nAmazing Spider-Man #696 (CBR 10/24/2012)\n\nDANGER ZONE Part 2 - GOBLINS GO TO WAR...and Peter Parker is caught dead-center! \n\nAstonishing X-Men #55 (CBR 10/24/2012)\n\nHatchitech weapons start showing up around the globe, and civilians are caught in the crossfire. The team must make a decisionÃ–take down Hatchi or save Karma! \n\nAvengers #32 (CBR 10/24/2012)\n\nEND TIMES CONTINUES!  The Avengers follow the signal trail to one of the greatest unsolved mysteries in Avengers history-and a shocking reveal that will leave the internet abuzz! \n\nAVX Consequences #3 (of 5) (CBR 10/24/2012)\n\nClassified!\n\nCaptain America #19 (CBR 10/24/2012)\n\nEND OF AN ERA!  Steve Epting returns for the grand finale of Ed Brubaker's EPIC RUN on Captain America, and the end of an era!\n\nCaptain America And Black Widow #638 (CBR 10/24/2012)\n\nVenemma Multiversal has sent Cap and Black Widow on a wild goose chase through countless worlds. Cap and Widow battle corporate-sponsored alien war machines! And that's not even the strangest thing that happens this issue\n\nFF #23 (CBR 10/24/2012)\n\nFINAL ISSUE! Jonathan Hickman wraps up his tenure as Old Franklin teaches Young Franklin 'How To Be A God!' \n\nInvincible Iron Man #527 (CBR 10/24/2012)\n\nEND OF AN ERA!  Who lives? Who dies? Who wins? Who loses?  More importantly: what's next for Tony Stark and Iron Man?  You won't believe it until you read it! \n\nSecret Avengers #33 (CBR 10/24/2012)\n\nTHE RISE OF THE DESCENDANTS part 1. THE RISE OF THE DESCENDANTS BEGINS HERE! The event that will devastate the lives of the Secret Avengers!  Descendants siege on Avengers Lighthouse station! Father launches his invasion. Can the Marvel Universe survive the plague of contagious robotic evolution? terrible new Avenger's foe is born: Beware the bite of The Black Ant! \n\nUltimate Comics Ultimates #17 (CBR 10/24/2012)\n\nUNITED WE STAND CONTINUES!!!  Captain America, Thor and Iron Man battle the forces ripping America apart! Ultimate Hydra vs. Ultimate S.H.I.E.L.D.  Revealed! The secret weapon that could tip the balance...forever! \n\n\n","torrent":{"xt":"urn:btih:041850e472773f30135265ba42e1bc9e70db51a6","amp;dn":"New+Marvel+I+Like+10-24-2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"041850e472773f30135265ba42e1bc9e70db51a6","infoHashBuffer":{"type":"Buffer","data":[4,24,80,228,114,119,63,48,19,82,101,186,66,225,188,158,112,219,81,166]},"announce":[],"urlList":[]}}