{"title":"Kon-Tiki ( Hardcoded Dk subs )","uid":7933172,"size":1286559744,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0464c4a0824cb16a064763339aaaa14bd8a905ac&amp;dn=Kon-Tiki+%28+Hardcoded+Dk+subs+%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"slurpy97","files":-1,"time":1355767321,"description":"Dk/No:\n\nFilmen 'Kon-Tiki' er baseret paa Thor Heyerdahls bog af samme navn,\nder har solgt over 50 million eksemplarer paa verdensplan og\noversat til over 70 sprog.\n\nI 'Kon-Tiki' begiver Thor Heyerdahl sig ud paa en eventyrlig og\nikke mindst livsfarlig ekspedition tvaers over Stillehavet for at\nbevise sin videnskabelige teori om, at Polynesien var blevet\nbefolket fra Peru i Sydamerika.\n\nTeorien var i 1947 revolutionerende og gik i alle henseender\nstik imod samtlige etablerede videnskabelige teorier, der alle\npegede paa, at Asien var udgangspunkt for befolkningsudvandringen.\n\nHeyerdahl, fire andre nordmaend og en enkelt svensker tilbage- \nlagde de naesten 8000 kilometer over aabent hav - uden andre\nhjaelpemidler end en kortboelgeradio - paa en balsatraesflaade,\nsom de havde doebt efter den sydamerikanske solgud, Kon-Tiki.\n\nThor Heyerdahl kendte med en enkelt undtagelse ikke noget af sit\nmandskab paa forhaand, og kun en enkelt af dem havde sejlererfaring.\n\nHeyerdahl led selv af en livslang vandskraek og kunne ikke svoemme,\nmen han var villig til at ofre alt og alle for at bevise, at hans\nteori var sandsynlig.\n\nKon-Tiki har dansk biograf-premiere den 4. april 2013 :)\n\n\n\n\nEng:\n\nThe Norwegian explorer Thor Heyerdahl crossed the Pacific ocean in a balsa wood raft in 1947, together with five men, to prove that South Americans already back in pre-Columbian times could have crossed the sea and settle on Polynesian islands. After financing the trips with loans and donations they set off on an epic 101 days long trip across 8000 kilometers, while the world was waiting for the result of the trip. The film tells about the origin of the idea, the preparations and the events on the trip. Kon-Tiki was named after the Inca sun god, Viracocha, and &quot;Kon-Tiki&quot; is an old name for this god. Heyerdahl filmed the expedition, which later became the Acaemy award winning documentary in 1951, and wrote a book about the expedition which was translated into 70 languages and sold more than 50 millions copies around the world. Heyerdahl believed that people from South America could have settled Polynesia in pre-Columbian times... ","torrent":{"xt":"urn:btih:0464c4a0824cb16a064763339aaaa14bd8a905ac","amp;dn":"Kon-Tiki+%28+Hardcoded+Dk+subs+%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0464c4a0824cb16a064763339aaaa14bd8a905ac","infoHashBuffer":{"type":"Buffer","data":[4,100,196,160,130,76,177,106,6,71,99,51,154,170,161,75,216,169,5,172]},"announce":[],"urlList":[]}}