{"title":"Nuts &amp; Volts Magazine - Complete Year 2007","uid":3992055,"size":497728812,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:04ba662e296f6014f6335ed2ee6d40fd76dafe37&amp;dn=Nuts+%26+Volts+Magazine+-+Complete+Year+2007&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"HawkCrave","files":62,"time":1201103861,"description":"This is all Nuts &amp; Volts magazines from 2007, in PDF format, including the project files that can be downloaded from their website.\n\nGoto www.nutsvolts.com for more info on the magazine.\n\nNow In Our 29th Year! \n\nThe first issue of Nuts &amp; Volts was published in 1980. It was originally designed as a newsprint, all advertising publication that was mostly given away. Over the next few years, the magazine continued to grow in readership and advertising, however, not much changed until February 1992 when NV was changed to a tabloid format and started to make the shift to a more content-oriented publication. New editorial features were added along with monthly columns and projects for electronics DIYers. Since then, it has grown into one of the most popular and relevant magazines for the electronics hobbyist in the nation. Beginning with the January 2003 issue, Nuts &amp; Volts was reformatted from a tabloid size back to a standard magazine size. NV now averages about 100 pages and is printed on high-quality paper in full color.\n\nNuts &amp; Volts is the leading magazine for those seriously interested in electronics. There now remain only a handful of magazines written for the electronics community with Nuts &amp; Volts being the highest readership, longest running electronics publication left in the US today. And we still have readers and advertisers that have been with us since the early 80s.\n\nNuts &amp; Volts is written for the hands-on hobbyist, design engineer, technician, and experimenter. The diversity of subjects appeals to all levels of experience and spans such topics as amateur robotics, circuit design, lasers, computer control, home automation, data acquisition, new technology, DIY projects, electronic theory, analog, and myriad microcontrollers.","torrent":{"xt":"urn:btih:04ba662e296f6014f6335ed2ee6d40fd76dafe37","amp;dn":"Nuts+%26+Volts+Magazine+-+Complete+Year+2007","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"04ba662e296f6014f6335ed2ee6d40fd76dafe37","infoHashBuffer":{"type":"Buffer","data":[4,186,102,46,41,111,96,20,246,51,94,210,238,109,64,253,118,218,254,55]},"announce":[],"urlList":[]}}