{"title":"Billy Joel - New York State Of Mind  (Xvid-2nafish)","uid":5234677,"size":150607156,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:0589a9b8ee9e1a013f41a5a3cffb6c1eed6eb0d8&amp;dn=Billy+Joel+-+New+York+State+Of+Mind++%28Xvid-2nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":1,"time":1261443303,"description":"Source: TV\n\nFile Info:\n\nValid : Yes [AVI]\nDuration : 00:07:23\n\n[Video]\nResolution : 720x540\nCodec : XviD MPEG-4 codec\nFPS : 29.97\nBitRate : 1183 Kbps\nQuality Factor : 0.10 b/px\n\n[Audio]\nCodec : Microsoft PCM Format\nNumber of channels : 2\nSample Rate : 48000 Hz\nBitRate : 1536 Kbps\n\n\nBilly Joel - New York State Of Mind (Live-Beat Club) (Xvid-2nafish)\n\n\n&quot;New York State of Mind&quot; is a song written by Billy Joel which initially appeared on the album Turnstiles in 1976. While not a hit when it was first released, it has received much more frequent airplay in recent years. &quot;New York State of Mind&quot; enjoyed a resurgence in popularity and radio airplay after the 2001 September 11 attacks, and is frequently played after New York Mets, New York Knicks and New York Rangers games. It also frequently appears on playlists of adult contemporary and oldies formatted radio stations that broadcast in the New York City market.\n\nJoel wrote the song after returning to the East Coast from Los Angeles, where he had spent the previous three years. In fact, most of Turnstiles deals with Joel's cross-country relocation, including &quot;Say Goodbye to Hollywood&quot;, &quot;I've Loved These Days&quot;, &quot;Summer, Highland Falls&quot;, and &quot;Miami 2017 (Seen the Lights Go Out on Broadway).&quot;\n\nThe lyrics of &quot;New York State of Mind&quot;, in particular, read like an ode to a lost love. After a vacation from reality, &quot;a holiday from the neighbourhood&quot;, it is the city's authentic grit he's missed: &quot;now I need a little give and take, The New York Times, The Daily News&quot;. Joel views New York as the place where he is most comfortable, even if he has been to many different locations and enjoyed himself there as well, perhaps getting &quot;high in the Rockies under the evergreens&quot;.\n\nThe song drops a reference to the Hudson River as well as locations in New York City: Chinatown and the Riverside. When Joel plays the song live, especially in New York State or the New York metropolitan area, he sometimes modifies the lyrics to reflect the venue he is performing in or some surrounding towns.\n\nTurnstiles was the fourth album by Billy Joel, released in 1976. In part, the album was made to celebrate Joel's return to New York City after his sojourn in California. Three of the album's tracks reference New York: &quot;Summer, Highland Falls&quot;, &quot;New York State of Mind&quot; and &quot;Miami 2017 (Seen the Lights Go Out on Broadway)&quot;. In addition, Joel begins the album with &quot;Say Goodbye to Hollywood&quot; (inspired by Ronnie Spector), and also includes &quot;I've Loved These Days&quot;, a tongue-in-cheek expression of regret at leaving behind Hollywood's decadence.\n\n\nMy Videos: &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:0589a9b8ee9e1a013f41a5a3cffb6c1eed6eb0d8","amp;dn":"Billy+Joel+-+New+York+State+Of+Mind++%28Xvid-2nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0589a9b8ee9e1a013f41a5a3cffb6c1eed6eb0d8","infoHashBuffer":{"type":"Buffer","data":[5,137,169,184,238,158,26,1,63,65,165,163,207,251,108,30,237,110,176,216]},"announce":[],"urlList":[]}}