{"title":"The Witcher 3 Wild Hunt (2015) RePack by Termen","uid":11942902,"size":25079933659,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:059f6adfdc0398c831e80760a26e2dfd9c87773a&amp;dn=+The+Witcher+3+Wild+Hunt+%282015%29+RePack+by+Termen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"aroksetx","files":9,"time":1432006529,"description":"Info:\n\nYear: 2015\nGenre: RPG\nDeveloper: CD PROJEKT RED\nPublisher: CD PROJEKT RED\nPlatform: PC\nPublication Type: License\nGame Version: GOG DRM Free\nLanguage: Russian, English, German, French, Multi15\nLanguage: English, Russian, etc. Will be after 19th May\nSubtitle Language: English, Russian, German, French, Multi15\nTablet: None | Preload\n\nSystem requirements:\n\nOperating System: 64-bit Windows 7 or 64-bit Windows 8 (8.1)\nProcessor: Intel CPU Core i5-2500K 3.3GHz / AMD CPU Phenom II X4 940\nRAM: 6 GB\nVideo Card: Nvidia GPU GeForce GTX 660 / AMD GPU Radeon HD 7870\nFree hard disk space: 35 GB\n\nDescription:\n\n&quot;The Witcher: The Wild Hunt&quot; - a new generation of role-playing game with a deep plot, which takes place in an open world. The huge and stunningly beautiful game universe will force the player to make difficult decisions, each of which will have its consequences. In &quot;The Witcher&quot; you play as Geralt of Rivia - a professional killer monsters scouting for a child, which was told in the ancient prophecy. You will enjoy the world of the rich commercial cities, islands, fearless thugs, dangerous mountain passes and dark caves.\n\nFeatures:\n\nPlay as a hired killer monsters, masterfully holding the blade\nWitcher from early childhood taught the craft and subjected to mutation to give superhuman abilities, strength and speed of reaction. These killer monsters had to fight back the monsters that are full of peace.\n\nDestroy enemies with a perfect performance, playing for a professional killer monsters. It has a mutagenic elixirs, combat magic and an arsenal of deadly weapons of various kinds, whose characteristics can be improved.\nHunt the many incredible monsters from violent creatures that live in the mountain passes, to the tricky monsters lurking in dark alleys crowded cities.\nUse earned money to improve weapons and armor to order, or to descend at the races, in fist fights, playing cards and having fun.\n\nExplore open fantasy world, indifferent to good and evil\nThe huge open world &quot;The Witcher&quot; created specifically for endless adventure. It sets new standards for size, depth and complexity of the game universe.\n\nTravel to fantastic outdoor world, explore the abandoned ruins, caves and shipwrecks, trade with merchants and blacksmiths krasnolyudskimi urban hunt on the plains, in the mountains and the sea.\nTo negotiate with the military leaders vile, horrible witches and corrupt rulers and help them in the most dark and dangerous things.\nMake decisions that go beyond the choice between good and evil, and be prepared to face the consequences.\n\nFind the child, which was told in the ancient prophecy\nGrasp the most important and difficult order: you have to find a child of Destiny, which could save or destroy your world.\n\nAmong the fires of war and look for the child of Destiny - a living weapon whose appearance foretold in ancient legends elfskih.\nFight against the rulers, ghosts and even the enemies who came from another universe, and willing to do anything to capture the world.\nDetermine the fate of your hero in a world that may not be worthy of salvation.\n\nTruly a new generation\n\nREDengine engine 3 designed specifically for next generation technologies, fills the universe &quot;The Witcher&quot; subtlest shades and animates it, creating a truly believable fantasy world.\nDynamic change of weather and the cycle of day and night affects both the people in the cities, and the monsters in the wild lands.\nThe huge open world offers many decisions in the main and in secondary storylines: the player affects the gaming universe like never before","torrent":{"xt":"urn:btih:059f6adfdc0398c831e80760a26e2dfd9c87773a","amp;dn":"+The+Witcher+3+Wild+Hunt+%282015%29+RePack+by+Termen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"059f6adfdc0398c831e80760a26e2dfd9c87773a","infoHashBuffer":{"type":"Buffer","data":[5,159,106,223,220,3,152,200,49,232,7,96,162,110,45,253,156,135,119,58]},"announce":[],"urlList":[]}}