{"title":"Amplitude  USA  PS2DVD.[tankaspel-com].iso","uid":4651511,"size":1765736448,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:05feea435976bc71517fc42429550b255518f66e&amp;dn=Amplitude++USA++PS2DVD.%5Btankaspel-com%5D.iso&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"iskan78","files":1,"time":1232058443,"description":"visit : www tankaspel com  (nya svenska speltorrents sidan)\n\n\n\nGAME INFO:\n\nEnter this addictive world and let your senses take control.\n\nExperience the beat and release yourself through the rhythm.\n\nStay in tune with the most immersive musical gameplay experience ever.\n\nScratch and mix new musical flavors with more than 20 all-new hit songs from top artists.\n\nFeatures:\n\n    * Unleash you inner rhythm within more than 25 immersive levels.\n    * Launch into a musical soundscape with major recording artist hits from a wide variety of genres, including songs from blink 182, P.O.D., David Bowie, Pink, Garbage, Weezer, Dieselboy, and Papa Roach.\n    * Navigate your customizable FreQ through four skill levels and five all-new stunning arenas, complete with artist music videos.\n    * Experience musical immersion with single-player gameplay or jump online (broadband or dial-up) and play against FreQs nationwide in intense jam sessions.\n    * Challenge the online community to play your custom remixes.\n    * Can you beat the bands? Interact with them within the online Remix Repositories. Artists will go online and choose the best remix created of their song, and then create their own remix for fans to play online.\n    * Stake your claim to top DJ with online chat, lobby functions, and ladder rankings.\n\n","torrent":{"xt":"urn:btih:05feea435976bc71517fc42429550b255518f66e","amp;dn":"Amplitude++USA++PS2DVD.%5Btankaspel-com%5D.iso","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05feea435976bc71517fc42429550b255518f66e","infoHashBuffer":{"type":"Buffer","data":[5,254,234,67,89,118,188,113,81,127,196,36,41,85,11,37,85,24,246,110]},"announce":[],"urlList":[]}}