{"title":"Cathy Dennis - Move To This - (1992)[ MP3 VBR]","uid":4464116,"size":87506119,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:05ff50b0f69ce171b8de24f3f55a75acf3618f29&amp;dn=Cathy+Dennis+-+Move+To+This+-+%281992%29%5B+MP3+VBR%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"seanprince","files":15,"time":1224834574,"description":"Cathy Dennis - Move To This - (1992)[ MP3 VBR]\n\nTrack list\n\nCathy Dennis - Move To This\n\n01. Just Another Dream 04:28\n02. Touch Me (All Night Long) 04:02\n03. C'mon And Get My Love (with D Mob) 03:50\n04. Too Many Walls 04:16\n05. Tell Me 04:16\n06. Everybody Move 05:16\n07. Move To This 03:36\n08. My Beating Heart 04:44\n09. Got To Get Your Love 03:43\n10. Taste My Love 03:22\n\nBiography by David Jeffries &amp; Andrew Leahey\n\nA former dance diva with slick, soulful vocals, Cathy Dennis enjoyed a handful of pop hits during the early '90s before transforming herself into one of the U.K.'s most successful songwriters. Born in Norwich, U.K., Dennis started publicly performing at the age of 13 with her father's big band. Several years later, the burgeoning musician was singing with a cover band when she was spotted by Simon Fuller, a British artist manager who, at the time, was working with Dancin' Danny D and his club act, D-Mob. Fuller brokered a deal with Polydor Records where Dancin' Danny D would produce an album for Dennis. Three years later, however, an album had yet to materialize, and Dennis took a break to record vocals for D-Mob's &quot;C'mon and Get My Love.&quot; The dance track proved to be her first taste of stardom as it ascended the charts on both sides of the Atlantic; the song also appeared on D-Mob's Little Bit of This, Little Bit of That, as well as Dennis' debut album, 1990's Move to This.\nCo-writing much of her own material, Cathy Dennis remained on the charts with a combination of dance singles (&quot;All Night Long (Touch Me),&quot; &quot;Just Another Dream&quot;) and ballads (&quot;Too Many Walls&quot;.) The successful dance producer Shep Pettibone signed up to work on Dennis' 1992 sophomore album, Into the Skyline, but the record yielded no significant hits and quickly fell off the charts. Dennis recorded a more soul-based third album, Inspiration, yet the singer was quickly becoming disenchanted with performing and the album was ultimately scrapped, with only the track &quot;S.O.S.&quot; seeing a release on the Beverly Hills 90210: College Years soundtrack.\nAs she grew increasingly interested in the music of Paul Weller and the Kinks, Dennis took a singer/songwriter approach to her earthy 1996 effort, Am I the Kinda Girl? It made even less of an impact than Into the Skyline, however, despite receiving some chart recognition for its emotional cover of the Kinks' &quot;Waterloo Sunset.&quot; Having such a personal album tank was enough to convince Dennis to focus on songwriting and production for 19 Productions, a company that Simon Fuller was about to turn into a gold mine. One of Fuller's most promising acts, The Spice Girls, went on to sell millions of copies of &quot;Wannabe,&quot; the group's infectious debut single that featured &quot;Bumper to Bumper,&quot; a song written by Dennis, on Side B. Suddenly, Dennis found herself knee-deep in royalty checks. Successful songwriting work for S Club 7 followed, but the crowning achievement arrived when Kylie Minogue took another Dennis composition, &quot;Can't Get You Out of My Head,&quot; to number one in multiple countries. Dennis and her co-writer -- Rob Davis, former member of the glam band Mud -- had a worldwide hit on their hands, for which they received an Ivor Novello songwriting award in 2002.\nDuring the 2000s, Fuller found worldwide success as the producer for two singing-based talent shows: Pop Idol in the U.K. and American Idol in the U.S. Dennis penned and performed the franchise's theme song, and her music appeared on several albums by the shows' most promising alumni (including Clay Aiken and Kelly Clarkson). By the end of 2002, four different publications had named her as one of the highest-paid women in the U.K., and she continued earning accolades (not to mention additional royalty checks) by penning such chart-topping songs as Britney Spears' &quot;Toxic&quot; and Katy Perry's &quot;I Kissed a Girl.&quot;\n\nReview by Alex Henderson\n\nThough not in a class with fellow British R&amp;B/dance divas Lisa Stansfield or Caron Wheeler, Cathy Dennis proved herself to be a welcome addition to Britain's '90s R&amp;B scene with Move to This -- a decent, though not remarkable, effort released when she was riding high on her hit with dance outfit D-Mob, &quot;C'Mon and Get My Love,&quot; and her single &quot;Just Another Dream&quot; (both of which are among the CD's high points). The girlish-sounding Dennis doesn't have a great range, but she does have heart -- and is indeed warm and convincing on such sleek and infectious dance-floor fare as &quot;Got to Get Your Love,&quot; &quot;Taste My Love,&quot; and &quot;Everybody Move&quot; (which was produced by Nile Rodgers of Chic fame). Dennis is at her worst when moving from R&amp;B/dance music to bloodless adult contemporary-oriented pop, like the ballads &quot;Too Many Walls,&quot; and &quot;My Beating Heart.&quot; Amazingly, the latter was also produced by Rodgers -- who has produced gems for everyone from David Bowie to Madonna, but wastes his considerable talents on &quot;My Beating Heart.&quot; Nonetheless, Move to This has more strengths than weaknesses, and reminds us that England is definitely a country to pay attention to when it comes to dance music.","torrent":{"xt":"urn:btih:05ff50b0f69ce171b8de24f3f55a75acf3618f29","amp;dn":"Cathy+Dennis+-+Move+To+This+-+%281992%29%5B+MP3+VBR%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05ff50b0f69ce171b8de24f3f55a75acf3618f29","infoHashBuffer":{"type":"Buffer","data":[5,255,80,176,246,156,225,113,184,222,36,243,245,90,117,172,243,97,143,41]},"announce":[],"urlList":[]}}