{"title":"Frankie Carle - The Columbia Years (192k)","uid":9630969,"size":107948151,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:067681c9866f011395d5ce3c510e3cfe5ab70c05&amp;dn=Frankie+Carle+-+The+Columbia+Years+%28192k%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"KadrianBlackwolf","files":25,"time":1392786204,"description":"Frankie Carle - The Very Best of the Columbia Years (192kbps)\n\nThis artist doesn't seem to be represented at all on TPB, so I thought I'd enrich the culture a bit.  I originally downloaded this from WinMX, hence the low bit rate, but considering the reliability of ALBW I'm lucky that it worked at all.\n\nFrankie Carle's sweet band enjoyed their greatest period of popularity in the mid-'40s, when they ranked just behind Swing and Sway With Sammy Kaye and Les Brown and His Band of Renown, scoring hits like &quot;A Little on the Lonely Side,&quot; &quot;Oh! What It Seemed to Be,&quot; and &quot;Rumors Are Flying,&quot; each of which hit number one in Billboard and/or on Your Hit Parade. Carle's recordings have been reissued only sparsely over the years, and this 25-track single CD with a running time of nearly 75 minutes is the most extensive collection of his original Columbia Records tracks yet released. With the exception of &quot;Charmaine,&quot; which placed in Billboard's jukebox chart for only a single week, and &quot;Twelfth Street Rag,&quot; another one-week jukebox-chart entry that was actually an eight-year-old Carle solo piano instrumental dredged up during the 1948 recording ban, it includes all of Carle's hits from the period 1944-1949. And since he didn't actually have 25 hits, there's more. Especially welcome are instrumentals like &quot;Carle Boogie&quot; and &quot;Penguin at the Waldorf&quot; that give a sense of the leader's piano playing. Two of these non-vocal numbers are previously unreleased, &quot;Falling Leaves&quot; and &quot;Moonlight Whispers,&quot; the latter co-written by Carle. But he remains best remembered for those dreamy ballad hits, many of them featuring his daughter, Marjorie Hughes, who turns in typically warm, yet uninvolved vocal choruses. History has been no kinder to Carle's brand of sweet swing music than jazz critics were at the time, but he retained a following that enabled him to perform for decades after he made these recordings, and this release brings back to notice a significant chunk of mid-'40s pop music. -- AllMusic.Com\n\n1.  Evelina\n2.  A Little on the Lonely Side\n3.  Saturday Night (Is the Loneliest Night of the Week)\n4.  Carle Boogie\n5.  Counting the Days\n6.  I Was Here When You Left Me (I'll Be Here When You Get Back)\n7.  Oh! What It Seemed to Be\n8.  One More Tomorrow\n9.  Without You (Tres Palabras)\n10. I'd Be Lost Without You\n11. Rumors Are Flying\n12. It's All Over Now\n13. Falling Leaves\n14. Roses in the Rain\n15. Penguin at the Waldorf\n16. And Mimi\n17. Peggy O'Neil\n18. (I'm a-Comin' a-Courtin') Corabelle\n19. Beg Your Pardon\n20. Dreamy Lullaby\n21. Moonlight Whispers\n22. Dream a Little Dream of Me\n23. That Five O'Clock Feeling\n24. October Twilight\n25. Cruising Down the River (On a Sunday Afternoon)\n","torrent":{"xt":"urn:btih:067681c9866f011395d5ce3c510e3cfe5ab70c05","amp;dn":"Frankie+Carle+-+The+Columbia+Years+%28192k%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"067681c9866f011395d5ce3c510e3cfe5ab70c05","infoHashBuffer":{"type":"Buffer","data":[6,118,129,201,134,111,1,19,149,213,206,60,81,14,60,254,90,183,12,5]},"announce":[],"urlList":[]}}