{"title":"Molto Gusto - Easy Italian Cooking","uid":7010806,"size":13783219,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:06be2240fd8753de82a72e32b9eb95b257528a47&amp;dn=Molto+Gusto+-+Easy+Italian+Cooking&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"chami1988","files":-1,"time":1328447997,"description":"Molto Gusto: Easy Italian Cooking by Mario Batali\nE..co | English | 2010 | ISBN: 0061924326 | 272 pages | epub, mob\n\n\nThe bestselling author of Italian Grill and Molto Italiano delivers a gorgeous collection of mouthwatering recipes to bring some Italian favorites home.\nChef Mario Batali's zest for life infuses the casual Italian fare that has made his restaurant Otto Enoteca Pizzeria a perennially popular New York City destination. Now you can have the flavors of Otto at home, with Molto Gusto, a collection of recipes for everyone's favorites, from pizza, pasta, and antipasti to gelati and sorbetti.\n\nMario has written the definitive book on great pizza making for the amateur, the novice, the foodie, and the gourmet cook, teaching how to make really great pizza at home without any fancy equipment. Here too are recipes for classic pizza, Otto's special pizzas, and even kids' pizzas.\n\nLooking for something a little lighter? Try the antipasti. Based on seasonal vegetables, with a few recipes showcasing seafood and meat, these dishes can make up an entire, healthy meal. Also included are many of Mario's favorite simple pasta dishes, and to finish it all off, fantastic recipes for gelati, sorbetti, and copette.\n\nFilled with Mario's infectious personality and love of robust flavors, and illustrated with luscious full-color photos, Molto Gusto makes it easy to spend a night on the town without leaving home.","torrent":{"xt":"urn:btih:06be2240fd8753de82a72e32b9eb95b257528a47","amp;dn":"Molto+Gusto+-+Easy+Italian+Cooking","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"06be2240fd8753de82a72e32b9eb95b257528a47","infoHashBuffer":{"type":"Buffer","data":[6,190,34,64,253,135,83,222,130,167,46,50,185,235,149,178,87,82,138,71]},"announce":[],"urlList":[]}}