{"title":"Geotextiles - From Design to Applications","uid":14932986,"size":18939738,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:07a87adc459a3838e9e0b64bd5e050e72c48438a&amp;dn=Geotextiles+-+From+Design+to+Applications&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1465973590,"description":"Geotextiles - From Design to Applications - R.M. Koerner (WP, 2016).pdf\r\n\r\nISBN 978-0-08-100221-6\r\n\r\nGeotextiles: From Design to Applications presents valuable information on the high performance fabrics used in soil separation, drainage, filtration, reinforcement, and cushioning. These polymeric materials offer solutions for geoengineering and other civil engineering specialties due to their advanced physical, mechanical, hydraulic, and endurance properties.\r\n\r\nThis important book offers comprehensive coverage of the manufacture, functions, properties, designs, and applications of geotextiles. Part One begins with a chapter on the history of geotextiles, followed by chapters giving detailed reviews of the types of fabrics and their manufacturing processes, from resin type, to fiber extrusion, to textile fabrication. Part Two covers the properties, behavior, and testing of geotextiles, with Part Three focusing on applications dealing with the specific primary functions of geotextiles. In Part Four, chapters offer numerous general applications of geotextiles, including those in waste containment, marine engineering, walls/slopes, agriculture, and erosion control. Finally, the chapters of Part Five address quality control and assurance for geotextiles, and the increasingly important topic of sustainability.\r\n\r\n\r\nReviews the types of fabrics used for geotextiles and their manufacturing processes\r\nCovers the properties, behavior, and testing of geotextiles\r\nContains detailed discussions of the primary functions of geotextiles and their wide range of applications","torrent":{"xt":"urn:btih:07a87adc459a3838e9e0b64bd5e050e72c48438a","amp;dn":"Geotextiles+-+From+Design+to+Applications","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"07a87adc459a3838e9e0b64bd5e050e72c48438a","infoHashBuffer":{"type":"Buffer","data":[7,168,122,220,69,154,56,56,233,224,182,75,213,224,80,231,44,72,67,138]},"announce":[],"urlList":[]}}