{"title":"The.Bridge.S01E03.The.Fat.Lady.Sings.the.Blues.XviD-err0001.avi","uid":5437945,"size":367042560,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:082a2b9658b474d7a412b5e8223dcaeb28e902f1&amp;dn=The.Bridge.S01E03.The.Fat.Lady.Sings.the.Blues.XviD-err0001.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"err0001","files":1,"time":1268790701,"description":"The Bridge S01E03: The Fat Lady Sings the Blues\n\nA retired narcotics cop is slain, prompting Internal Affairs to hunt for a killer in the police ranks; Frank cuts a deal with a crime boss to help a jailed ex-cop. \n\nThe resolution is 512x384 (4:3 aspect ratio) and while the quality is not up to scene standards it is quite watchable in my opinion. \n\nThis episode aired on CTV on March 12, 2010. According to the CTV website this is episode 3 so I am using that. Some sites are calling this episode 2, but it looks like CTV are saying that the 2 hour premiere on March 5 was 2 episodes (Red Door &amp; Paint It Black).   \n\n\nSeries Info: Written by five-time Gemini Award winner and six-time nominee Alan Di Fiore ('Da Vinci's Inquests,' 'The Life,' 'The Handler'), 'The Bridge' peels away the veneer of a big-city police force to reveal the political machinations underneath. After the rank and file unanimously vote street cop Frank Leo ('Battlestar Galactica's Aaron Douglas) into office as union head, he begins his quest to put street cops first and clean up the force from the ground up. But the old boys' network running the police force and the city's self-serving politicians are not about to sit idly by while a former street cop makes up his own rules. Frank walks a thin blue line as he battles wiretaps and a concerted campaign to bring him down, letting nothing stop him from fulfilling his unwavering vow that when cops are in trouble, he will be there.\n\n\nMore information on this show is here: http://shows.ctv.ca/TheBridge/About.aspx \n","torrent":{"xt":"urn:btih:082a2b9658b474d7a412b5e8223dcaeb28e902f1","amp;dn":"The.Bridge.S01E03.The.Fat.Lady.Sings.the.Blues.XviD-err0001.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"082a2b9658b474d7a412b5e8223dcaeb28e902f1","infoHashBuffer":{"type":"Buffer","data":[8,42,43,150,88,180,116,215,164,18,181,232,34,61,202,235,40,233,2,241]},"announce":[],"urlList":[]}}