{"title":"Cameron's Closet 1988 [Hyperdrive25]","uid":6764539,"size":573831873,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:08346363903fccada9c50a1348e78e28b0bb809d&amp;dn=Cameron%5C%27s+Closet+1988+%5BHyperdrive25%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Hyperdrive25","files":-1,"time":1319321363,"description":"                          Cameron's Closet (1988)\n                         -+++++++++++++++++++++++-  \n\nCameron's Closet, also known as Cameron's Terror, is a 1988 American horror film. The film was directed by Armand Mastroianni and stars Scott Curtis, Cotter Smith, Mel Harris, Tab Hunter, Kim Lankford, Gary Hudson and William Lustig.\n\nPlot\n----\n10-year-old Cameron Lansing (Scott Curtis) is an introverted, solitary boy with telekinetic and telepathic abilities who lives with his father, Owen Lansing (Tab Hunter), a research scientist. Owen has subjected Cameron to intense psychological testing from a young age in an effort to unbury the hidden powers of the human mind. During a series of mysterious and bizarre circumstances in their rural house one night, Owen is decapitated by a machete, yet the authorities can find no evidence of foul play and rule it out as an accidental death believing he simply fell on it. Cameron goes to live with his mother Dory Lansing (Kim Lankford) and her obnoxious actor boyfriend Bob Froelich (Gary Hudson) in Los Angeles. Both Dory and Bob are unaware of Cameron's paranormal abilities.\n\nSergeant Sam Taliaferro (Cotter Smith) of the Homicide Division of the LAPD has sleeping trouble and a recurring nightmare which is affecting his work. Taliaferro's partner, Detective Pete Groom (Leigh McCloskey) complains about Taliaferro's frequent bouts of absent-mindedness in the line of duty caused his lack of sleep, and so Taliaferro is ordered to go see a psychiatrist who works with the department, Dr. Nora Haley (Mel Harris). When Bob Froelich is horrifically murdered in Cameron's room, having been thrown out of the second-floor window with his eyes burnt out of the sockets, Sam Taliaferro, Pete Groom and Nora Haley are put on the case. As they investigate the perplexing case, Taliaferro befriends Cameron and realizes that deaths are occurring always around the boy, and that his nightmares seem to be linked to the boy. Under her counselling sessions Nora Haley also realizes that the boy has paranormal abilities, even being able to foresee future events. It also becomes apparent to Taliaferro that whatever Cameron concentrates on hard enough or focuses on is manifesting itself into reality.\n\nCameron plays an imaginative game with a figurine his father gave to him he calls the &quot;Deceptor&quot;, actually an ancient figure of a Mayan demonic entity said to be terrible beyond description in Owen Lansing's texts. Cameron's imagination makes the creature real and it takes up residence in Cameron's bedroom closet. Soon, numerous inexplicable and gruesome deaths are occurring around the closet in Cameron's room, and people who have already died seem to be mysteriously reappearing in an undead state. Bob Froelich is horrifyingly resurrected in Cameron's closet and murders Detective Pete Groom when he looks inside the closet.\n\nTaliaferro and Haley seek out Owen Lansing's assistant, Professor Ben Majors (Chuck McCann) at his home in the woods, where they learn the truth about Cameron. Taliaferro is stalked through the woods by Pete Groom's ghost, who warns him that the evil is &quot;out of the closet now.&quot; The demons soon wish to destroy Cameron, thus severing their link to limbo and sealing them within reality and in our world. Majors kidnaps Cameron and takes him back to Cameron's house where Majors is then murdered by the demon, his blood boiling in his veins. Only Sam Taliaferro and Nora Haley are able to protect Cameron. Cameron goes back to his room to face the demon in the closet once and for all and attempt to send it back to the lowest regions of Hell before Cameron loses his powers to it.\n\nProduction\n----------\nThe screenplay of Cameron's Closet was written by Gary Brandner, who had previously written both the trilogy of novels and the film adaptations of the acclaimed The Howling.\n\nThe special effects of Cameron's Closet were done by Carlo Rambaldi, who had previously designed the eponymous character in E.T. the Extra-Terrestrial (1982) and the mechanical head-effects for the creature in Alien (1979), for both of which had earned Rambaldi an Oscar. Rambaldi also worked on Profondo Rosso (Deep Red) (1975), King Kong (1976), Close Encounters of the Third Kind (1977), Dune (1984), and King Kong Lives (1986).\n\nCult horror film director William Lustig has a cameo in the film as a pornographic film director being booked by the police.\n\nRelease\n-------\nThe film was given a limited theatrical release in the United States by SVS Films in January 1989. The film was released later that same year on VHS by Sony Video.\nThe film was released on DVD by Sony Pictures Home Entertainment in 2004. It has since gone out of print.\n\n\nGeneral\n+++++++\nFormat                           : AVI\nFormat/Info                      : Audio Video Interleave\nFile size                        : 547 MiB\nDuration                         : 1h 27mn\nOverall bit rate                 : 876 Kbps\nWriting application              : Lavf52.39.1\n\nVideo\n+++++\nFormat                           : MPEG-4 Visual\nFormat profile                   : Advanced Simple@L1\nFormat settings, BVOP            : 2\nFormat settings, QPel            : No\nFormat settings, GMC             : No warppoints\nFormat settings, Matrix          : Default (H.263)\nCodec ID                         : DX50\nCodec ID/Hint                    : DivX 5\nDuration                         : 1h 27mn\nBit rate                         : 799 Kbps\nWidth                            : 576 pixels\nHeight                           : 432 pixels\nDisplay aspect ratio             : 4:3\nFrame rate                       : 23.976 fps\nColor space                      : YUV\nChroma subsampling               : 4:2:0\nBit depth                        : 8 bits\nScan type                        : Progressive\nCompression mode                 : Lossy\nBits/(Pixel*Frame)               : 0.134\nStream size                      : 499 MiB (91%)\nWriting library                  : Lavc52.37.0\n\nAudio\n+++++\nFormat                           : MPEG Audio\nFormat version                   : Version 1\nFormat profile                   : Layer 3\nMode                             : Joint stereo\nMode extension                   : MS Stereo\nCodec ID                         : 55\nCodec ID/Hint                    : MP3\nDuration                         : 1h 27mn\nBit rate mode                    : Constant\nBit rate                         : 64.0 Kbps\nChannel(s)                       : 2 channels\nSampling rate                    : 48.0 KHz\nCompression mode                 : Lossy\nStream size                      : 39.9 MiB (7%)\nAlignment                        : Aligned on interleaves\nInterleave, duration             : 24 ms (0.58 video frame)\n\n\nPlayback Guide For DVD/CD Player: This file can be played with any DIVX/MP4 compatible DVD/VCD Player. Just burn the avi file onto a CD using Nero or \nAshampoo Burning Studio by making a DATA CD.\n\nPlayback guide for PC: To play this video make sure you have VLC media player \n(VideoLAN) or SMplayer installed on your PC.\n\nDownload VLC Media Player: http://www.videolan.org/\nDownload SMPlayer: http://smplayer.sf.net/\n\n\n\nAnother Quality Torrent Courtesy of Hyperdrive25. All My torrents are here:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/Hyperdrive25&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/Hyperdrive25&lt;/a&gt;\n\n\n___________________________________________________________________________________\n\n==========================+= HYPERDRIVE25 TORRENT =+==============================\n___________________________________________________________________________________","torrent":{"xt":"urn:btih:08346363903fccada9c50a1348e78e28b0bb809d","amp;dn":"Cameron%5C%27s+Closet+1988+%5BHyperdrive25%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"08346363903fccada9c50a1348e78e28b0bb809d","infoHashBuffer":{"type":"Buffer","data":[8,52,99,99,144,63,204,173,169,197,10,19,72,231,142,40,176,187,128,157]},"announce":[],"urlList":[]}}