{"title":"[ENG] Waidonyo","uid":7762419,"size":544379592,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:085a9efc2da5741e2840d52818c8b8a4a98e67fb&amp;dn=%5BENG%5D+Waidonyo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"stingart22","files":437,"time":1351270048,"description":"// For your convincience this game has been ripped from Alicesoft 2010 and patched to 1.04 by StingArt.\n\n// Translated by: Ludo-Rathowm, Roven-Pan and Tulip Goddess Maria. English patch V1.0\n\n\n// The Story:\n\nLong, long ago...\nIn a place where castles were constantly being invaded because of war,\nthere was a king who thought about the damage castles suffered.\n\nHe thought of something no one else had and realized his difficult idea.\nUse castles to fight castles!\nHe would move his castle straight to his enemy's and attack.\nAlready having quite a bit of national power, he took control of the continent in the blink of an eye.\nA few hundred years have passed, and that king is no more.\nWhat remains is moving fortresses and the warring countries that use them...\n\nA tiny, tiny kingdom, consisting of one moving fortress, Mamatoto.\nThe king, [Kakaro], was once strong enough to hold the title of Warrior King.\nThe one who managed the entire country, and was known as a\nskilled general by other countries, was the king's son [Nanus].\nAfter many battles brought their national power down to its very limit, now they're surviving by using\ntheir incredible speed and General Nanus' power to run from other countries' large moving fortresses.\n\nThe [Forland Continent] where such large battles continued endlessly.\nIn the Northeast, there was a region called the [Monster Realm] inhabited by dreadful things.\nThere existed a huge, mysterious cave.\n\nInside the [Cross-Cave] is, just as the name suggests, a cross-dimension.\nIt's said that stepping into the cave is fatal, and that no one ever returns alive.\nThere's no lack of people who gather armies and push into the cave to see what its reaches hold,\nbut the giant cave has continued to swallow such people whole.\n\nKakaro, the king of Mamatoto, is another who thought to challenge the [Cross-Cave].\nThis story begins after his son Nanus invented something\nthat could grant his father's wishes...","torrent":{"xt":"urn:btih:085a9efc2da5741e2840d52818c8b8a4a98e67fb","amp;dn":"%5BENG%5D+Waidonyo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"085a9efc2da5741e2840d52818c8b8a4a98e67fb","infoHashBuffer":{"type":"Buffer","data":[8,90,158,252,45,165,116,30,40,64,213,40,24,200,184,164,169,142,103,251]},"announce":[],"urlList":[]}}