{"title":"EmuXtras Menu","uid":10172665,"size":911160439,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:098bdbbc1d021945ebfa369bcf96744d2dd5e835&amp;dn=EmuXtras+Menu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"asph10","files":1,"time":1400427419,"description":"EMUXTRAS MENU public release(for Hdtv or 16/9 crt tv users only)\n\n\n\nAfter big headaches with Darknior with all the problems we encountered, it's finally here! A HDTV launcher for our xbox with custom HQ atworks for all our emulators, and also a launcher that keeps all the great UnleashX capability (ftp transfer, screen adjusting, file editing and browsing, all the videos options, etc)\nI have optimised it the max possible to solve the best we can(one repertory with ALL videos inside instead of multiple folders helps unleashx), XMV converted hd videos (because XMV videos are smoother and faster than wmv8 videos), Hd skin with One hq 1280*720 backgroundg in PNG, ONE 1280*720 loading screen (because for some reasons jpg renders bad in hd with unleash, png is better), and now a Hq music player.\nAnd finally one fr version and one Us version, big kuddos to darknior for this of course.\nNow It's finished and works perfectly!\n\n\n\nHOW TO INSTALL?\n\n1) You must have the dashboard UnleashX installed on your xbox; (it's certainly already the case if it's a softmodded xbox)\n\n2) put the skin on your Unleash skin folder (usually on C:/skins or E:/dashboard/skins), then apply it with &quot;start&quot; (or else the skin won't be saved after a reboot).\nAfter this, put the &quot;VIDEOS&quot; folder on E:/EmuxtrasMenu (US)/VIDEOS or F:/EmuxtrasMenu (US)/VIDEOS.(one VIDEOS repertory with ALL videos inside instead of multiple folders helps unleashx to run faster)\n\n4) now, you'll have a little work to do; when you're on UnleashX, simply press &quot;start&quot; in front of each emus you have, then change the video preview path,\nalso, delete the &quot;icon&quot; preview path if it's the case (press &quot;X&quot; to delete the path), UnleashX will be faster to launch your items, save each time...\nit's better if each user use his own config.xml (because every user have a different folder/category/emunames organisation); that's why i don't provide a &quot;config.xml&quot; and a &quot;items.xml&quot;\nit will avoid a lot of confusion for everyone\n\n5)DONE, you have the best HDTV launcher for xbox,\nbe sure you have 1080i enabled,(in the video option on UnleashX, AND in the microsoft dashboard); it will look better.\nNow, the menu just lacks the videos for xbox games wich we are working on with darknior and blackshadow\n","torrent":{"xt":"urn:btih:098bdbbc1d021945ebfa369bcf96744d2dd5e835","amp;dn":"EmuXtras+Menu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"098bdbbc1d021945ebfa369bcf96744d2dd5e835","infoHashBuffer":{"type":"Buffer","data":[9,139,219,188,29,2,25,69,235,250,54,155,207,150,116,77,45,213,232,53]},"announce":[],"urlList":[]}}