{"title":"The Black Castle","uid":11980529,"size":733534208,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:09a576977e962ff8ef650400216ab27c0f37e131&amp;dn=The+Black+Castle&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"strawberry5","files":1,"time":1433186719,"description":"&quot;The Black Castle&quot; was Universal's final attempt to return to its glory days of the Gothic horror of the 30s and 40s. One would think that with both Boris Karloff and Lon Chaney in the cast, the film would be better. Unfortunately both are relegated to small supporting roles.\n\nEnglishman Sir Ronald Burton (Richard Greene) believes his two close friends have been murdered by the evil Count Karl von Bruno (Stephen McNally..complete with eye patch). It seems that Burton and friends were responsible for driving von Bruno from Africa.\n\nAssuming the alias of Richard Beckett, Burton secures an invitation to go to von Bruno's &quot;black castle&quot; for a hunting party. there he plans to gather evidence to show that von Bruno had murdered his two friends. Burton meets von Bruno's wife Elga (Paula Corday) who is trapped in an arranged marriage. The two begin to fall in love.\n\nDr. Meissen (Karloff), the castle physician is sympathetic to the young couples plight. He goes so far as to murder Count Steiken (John Hoyt) when he overhears Elga and Burton confess their love for each other. Burton leaves the castle with evidence he has discovered but is forced to return when Dr. Meissen informs him that von Bruno has imprisoned Elga. While attempting to rescue her he battles with von Bruno's brutish mute servant Gargon (Chaney) whom he sends into a pool of alligators.\n\nTo help the couple escape, Dr. Meissen administers a potion to them that will send them into a death like trance. von Bruno discovers the plot and....................\n\nIt's a shame that Karloff and Chaney had to suffer the humiliation of being cast in such menial roles. Both had saved the studio at different times. Karloff with his &quot;Frankenstein&quot; roles in the 30s and Chaney with his &quot;Wolfman&quot; in the 40s. For Chaney this I believe, was his final film for Universal. Karloff would make one more with the studio the following year in &quot;Abbott &amp; Costello Meet Dr. Jekyll and Mr. Hyde&quot;.\n\nFollowing this film, Universal would more or less abandon the old style Gothic horror films for the new wave of atomic giant monster films","torrent":{"xt":"urn:btih:09a576977e962ff8ef650400216ab27c0f37e131","amp;dn":"The+Black+Castle","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"09a576977e962ff8ef650400216ab27c0f37e131","infoHashBuffer":{"type":"Buffer","data":[9,165,118,151,126,150,47,248,239,101,4,0,33,106,178,124,15,55,225,49]},"announce":[],"urlList":[]}}