{"title":"Mitch Miller sings classic folk music","uid":4201205,"size":40812041,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:09de8d720ce7149bb6e8cc55729c6f2920ccc4f2&amp;dn=Mitch+Miller+sings+classic+folk+music&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rambam1776","files":23,"time":1211503914,"description":"Corny? Oh, HELL yeah. If you were alive in American in the early 1960s, and NO, I wasnt alive back then, you would have tuned in every week to this show. Still, these are charming old numbers and a nice slice of Americana. Burn them to disc for your parents or grandparents, and I promise you some cookies. This is a harmless and fun little jaunt into yesteryear. I still prefer death metal myself, but I bet even Dee Snyder and Ozzy have some fond memories of this kind of stuff while little kids. Review from Allmusic.com\n\nReview\tby Bruce Eder\nThis is the kind of album that Howard and Marion Cunningham (Tom Bosley and Marion Ross) and their neighbors would have been listening to together on Happy Days, if the latter had been a CBS series rather than an ABC series. Seriously, starting with That Old Gang of Mine, Mitch Miller and the Gang go through 16 songs (some as medleys) that, even in 1958, felt like they were 100 years old. In fairness, they dont feel quite like theyre 150 years old when heard on the CD in 2007 ? to that degree, theyve sort of become timeless ? but they were definitely intended to appeal to parents and grandparents at the time of the albums release. The performances on such tunes as Down by the Old Mill Stream, You Are My Sunshine, and By the Light of the Silvery Moon, are bold and robust, with little touches of subtlety in the dynamics and the spare accompaniment ? often not much more than a harmonica or an accordion, with a ukulele ? and the tempos, that make them somewhat more interesting to hear as a body than they are as individual tracks. Actually, Miller and company seem to have planned this album as a total, cohesive listening experience rather than a series of separate, isolated songs, as the numbers come almost right up against each other, with virtually no pause between. Among the individual tracks, those who liked Millers hit rendition of The Yellow Rose of Texas will probably luxuriate in the version of She Wore a Yellow Ribbon featured here. The contrasting tempos and melodies are all very carefully selected, for the greatest variety between songs, and its all calculated right down to the light,hearted final track, Be Kind to Your Web,Footed Friends, which is here as a jocular, almost self,deprecating finish. Its almost a concept album, in that sense ? and was Miller consciously stepping into territory that his one,time most outspoken in,house critic, Frank Sinatra, was staking out in his then,current berth at Capitol Records? ? and a surprisingly well,crafted one. And while it is easy to scoff at this kind of music 50 years on, one should also remember that Sing Along with Mitch was one of the bigger selling albums in the Columbia Records library, staying in print for decades and racking up sales sufficient to earn it a release as part of the labels first wave of budget,priced CDs (alongside albums such as Paul Revere &amp; the Raiders Greatest Hits etc.), thirty years after its original release. \n\n\n","torrent":{"xt":"urn:btih:09de8d720ce7149bb6e8cc55729c6f2920ccc4f2","amp;dn":"Mitch+Miller+sings+classic+folk+music","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"09de8d720ce7149bb6e8cc55729c6f2920ccc4f2","infoHashBuffer":{"type":"Buffer","data":[9,222,141,114,12,231,20,155,182,232,204,85,114,156,111,41,32,204,196,242]},"announce":[],"urlList":[]}}