{"title":"Aerosoft_SuperTrafficBoard_v31","uid":6308853,"size":17163828,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0b1f2d86636215cc4de70c8615f3f44841c70d81&amp;dn=Aerosoft_SuperTrafficBoard_v31&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"buxy1791","files":1,"time":1302457449,"description":"Super Traffic Board for Flight Simulator X\n \nFlying-W Simulation is pleased to announce the availability of Super Traffic Board (STB) Version 3 for FSX. \n\nWhat is Super Traffic Board?\n \nStarting from the idea of displaying flight information as you would find at any airport, STB goes far beyond this with new and exciting ways of interacting with your AI traffic.  Supporting all FSX AI packages, STB includes specially configured content for MyTrafficX, TrafficX, ORBX/FTX, Ultimate Traffic 2 and World of AI.\nIn addition to displaying basic arrivals and departure flight details, STB categorizes aircraft according to the operator (offering unique interpretations for Passenger, Cargo, Military and GA flights), shows flight numbers and IATA codes where available, displays real world airport names and reports advanced information including allocated runways, speed, altitude and distance of each flight from the airport.\n \nTaking interactivity to a new level, through STB you can monitor approach airspace and automatically resolve conflicts that might otherwise result in go-arounds, dynamically optimize your traffic volumes across airports for the best possible performance, follow a flight from departure airport to destination and order flights to begin departure procedures immediately.  Old favorites like View AI and Delete AI are included too.\n \nSuperTrafficBoard is developed with support and cooperation from Flight1 and MyTrafficX.\n\n","torrent":{"xt":"urn:btih:0b1f2d86636215cc4de70c8615f3f44841c70d81","amp;dn":"Aerosoft_SuperTrafficBoard_v31","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b1f2d86636215cc4de70c8615f3f44841c70d81","infoHashBuffer":{"type":"Buffer","data":[11,31,45,134,99,98,21,204,77,231,12,134,21,243,244,72,65,199,13,129]},"announce":[],"urlList":[]}}