{"title":"Steve Goodman - Jessie's Jig and Other Favorites (1975) MP3@320","uid":9633782,"size":89386297,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0bb76167bdf748d0c6d5057efa2ea9ab8c5c5e76&amp;dn=Steve+Goodman+-+Jessie%27s+Jig+and+Other+Favorites+%281975%29+MP3%40320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"AaronVincent","files":18,"time":1392821519,"description":"Singer/songwriter and guitarist extraordinaire Steve Goodman was only on this earth a short time. But when he died of leukemia in 1984, he left his many fans a legacy of outstanding recordings. One of these is Jessie's Jig &amp; Other Favorites. Originally recorded on the Buddha label in 1975, the LP was remastered and released as a CD in 1998 by Red Pajamas. The warm voice of Steve Goodman immediately envelops the listener, just like back in the '70s and '80s when Goodman would perform with his good friend, John Prine. The CD opens with the humorous &quot;Door Number Three.&quot; One hears that characteristic good nature of Goodman's again on &quot;This Hotel Room.&quot; Some of the songs are shaded with melancholy, such as &quot;Blue Umbrella,&quot; &quot;Spoon River,&quot; &quot; I Can't Sleep,&quot; and &quot;Lookin' for Trouble.&quot; But many of the best tunes on the album are the upbeat numbers, such as &quot;It's a Sin to Tell a Lie&quot; and &quot;Jessie's Jig.&quot; The title cut is a rousing number on which Goodman is joined by a stellar cast of musicians. These include Vassar Clements, Winnie Winston, Carl Martin, and Jethro Burns, to name just a few. The ensuing musical celebration -- featuring fiddles, mandolins, and guitars, with a cello and trumpet thrown in -- sounds like an old-timey hoedown. It did Steve Goodman proud and is a fitting way to remember this ephemeral, but brilliant shooting star in the musical firmament.","torrent":{"xt":"urn:btih:0bb76167bdf748d0c6d5057efa2ea9ab8c5c5e76","amp;dn":"Steve+Goodman+-+Jessie%27s+Jig+and+Other+Favorites+%281975%29+MP3%40320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0bb76167bdf748d0c6d5057efa2ea9ab8c5c5e76","infoHashBuffer":{"type":"Buffer","data":[11,183,97,103,189,247,72,208,198,213,5,126,250,46,169,171,140,92,94,118]},"announce":[],"urlList":[]}}