{"title":"FuckingMachines--FM-36662 Lexis Marie Hi","uid":11323891,"size":391583665,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:0c3bbe2ce4a9e7f9a027553075bb3b9bd8c9419b&amp;dn=FuckingMachines--FM-36662+Lexis+Marie+Hi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"merzedes","files":-1,"time":1414615102,"description":"\nHappy Halloween! Sexy Babe in a Haunted House machine fucked to Orgasm\n\nOct 29, 2014 - Performers: Lexis Marie \n\n\nHi MP4 only.\n\n\nLexis Marie is walking home from her new job where she doesn't know the neighbourhood. She's scared, but mostly frustrated since she just want to be home, soaking her aching feet. When she takes a second wrong turn and ends up once again at the entrance to the local fair grounds, she decides to brave the haunted house in hopes to end up somewhere other than the circle loop she's been mixed up in for the last hour. \n\nThe maze is horrifying at first, but she makes it out this time though she ends up in a mysterious sex machine museum. All the sudden her feet don't hurt as much anymore as the desire to check out the fucking power of the machines gets the best of her. She undresses for the first dong - and just as she takes her top off, she notices a GoPro is hooked up. Who cares, she thinks! \n\nThe close up shot of her pussy is so clear and perfect, it feels like you're inches from her, so close you could almost lick her clit while the dong pounds out a nice, wet orgasm from Lexis. \n\nShe moves on to the Robot Tongues and The Snake for a few more O's before moving into the gimp room for some leg chained fucking by The Doc. After five machines, Lexis pussy is ready for a break, but we can't just let her go home without experience out version of an exorcism! Yep, it's Sybian time, and the mega-vibrator does not disappoint. Lexis has one more, super intense orgasms before calling it quits. A great shoot from this newcomer and treat for Halloween!\n\nScreens &lt;a href=&quot;\nhttp://www.fuckingmachines.com/site/shoot.jsp?shootId=36662&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.fuckingmachines.com/site/shoot.jsp?shootId=36662&lt;/a&gt;\n\n16 000 Femdom/BDSM/Fetish torrentuploads completed. Man.. feels like every 1000 goes by faster and faster ;)\n\nJust keep on leaving us the nice comments below and we are happy :)\n\n\nAny Questions ?? Read our FAQ!!\n   &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-)","torrent":{"xt":"urn:btih:0c3bbe2ce4a9e7f9a027553075bb3b9bd8c9419b","amp;dn":"FuckingMachines--FM-36662+Lexis+Marie+Hi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c3bbe2ce4a9e7f9a027553075bb3b9bd8c9419b","infoHashBuffer":{"type":"Buffer","data":[12,59,190,44,228,169,231,249,160,39,85,48,117,187,59,155,216,201,65,155]},"announce":[],"urlList":[]}}