{"title":"Native Instruments Traktor Pro v2.6 - REPT [deepstatus]","uid":7796474,"size":152741484,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:0cfc91873d2fc6c87e8e2c519f1bb64422a3f6e8&amp;dn=Native+Instruments+Traktor+Pro+v2.6+-+REPT+%5Bdeepstatus%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"deepstatus","files":-1,"time":1352156779,"description":"                         TRAKTOR PRO v2.6\n\n              TRAKTOR 2 is the most powerful and versatile DJ soft                \n              ware on the market. With TRAKTOR 2, you can mix your                \n              tracks traditionally as well as combine your tracks                 \n              and loops in a non-linear way using it as a powerful                \n              live remixing tool.\n\n        ============================\n        What's New in TRAKTOR 2.6.0\n        ============================\n          \n          KEY FEATURES :\n      - Integration of TRAKTOR KONTROL Z2\n      - Macro FX: 11 new &quot;combination effects&quot; which are controllable\n        from a single knob. When using the update installer of TRAKTOR\n        2.6.0, new Macro FX can be added to the list of available FX\n        by importing the following TSI:\n        [USER]/Documents/Native Instruments/Traktor 2.6.0/Settings/\n        Default Settings/Effects/Macro FX.tsi\n      - Flux Mode: allows various transport actions (jumping to HotCues,\n        performing Beatjumps, and creating Loops) to be used while\n        preserving the original progression of the track\n      \n         CONTROLLER MANAGER :\n      - Factory Map Override: It's now possible to change the behavior\n        of only specific controls in a hard-coded mapping (such as the\n        KONTROL S4/S2 or Z2) by overriding their default behaviors. The\n        option shows up in the &quot;Mapping Details&quot; section of Controller\n        Manager only when it's available.\n      \n         EFFECTS :\n      - FX Units can now be configured for Post-Fader operation in\n        Internal Mixing mode. For External Mixing mode, the Post-Fader\n        option will put the FX Unit last in the signal chain before\n        being output from the audio interface\n      \n         LIVE INPUT DECK :\n      - Minor gain-staging adjustments for Live Input Deck \n\t  \n         MIXER :\n\t\t\n      - New &quot;Z ISO&quot; EQ type which is full kill at the left end of knobs\n        path \n      - New &quot;Z&quot; filter type\n      - &quot;QuickSnap&quot; behavior for the EQ and Filter controls: Hold the\n        SHIFT button on your hardware controller and move the EQ/Filter\n        knobs. The positions of the knobs in the software will not be \n        updated until the SHIFT button is released. This allows for \n        instantaneous EQ and Filter cuts.\n      - New gain system with independent Channel Gain and Auto-Gain\n        knobs. The button next to the Gain knob is used to switch the\n        view of the knob between Gain and the Auto-Gain value for the\n        track. When the button is blue, you're viewing the gain for the\n        channel. Clicking the button to turn it orange makes the knob\n        display the track's Auto-Gain level. Changes made to the\n        Auto-Gain amount can be heard immediately and are automatically\n        saved to the track. Channel Gain can now be mapped to an\n        absolute knob without worry of takeover issues. NOTE: if you've\n        disabled the &quot;Set Autogain when Loading Track&quot; preference, then\n        do not use the Auto-Gain view. Adjusting this knob while the\n        preference is off will end up overwriting the track's Auto-Gain\n        value.\n      \n         SYNC :\n      - A new Transport Preference preventing Remix Decks from becoming\n        Tempo Master\n      - New Transport Preference allowing only On-Air Decks to become\n        Tempo Master. Turning preference off will no longer cause the\n        Tempo Master to switch when manipulating mixer controls.\n      \n         TRAKTOR KONTROL Z2 :\n      - The Deck Focus Select buttons (buttons C and A on the left side\n        and buttons B and D on the right side, just above the HotCue\n        Pads) no longer require the use of the SHIFT key to enter the\n        Secondary Mode. If a button is already on and lit solid, this\n        indicates Primary Mode for the HotCue pads. Pressing the same\n        button again will engage Secondary Mode for the pad, which can\n        be seen by the button's backlight fading on and off. Pressing\n        the same button again will revert the pads back to Primary Mode.\n      \n         THIRD PARTY CONTROLLERS :\n      - Advanced HID support for the Pioneer CDJ-2000nexus (SLIP button\n        being mapped to Flux mode)\n\n\n         SYSTEM REQUIREMENTS\n         Windows 7 (latest Service Pack, 32/64 Bit), 2.0 GHz Intel Core 2 Duo or          AMD Athlon 64 X2, 2 GB RAM (4 GB recommended) \n\n\n               Install Traktor Pro.\n                                               \n               Copyapply a Patch (the one you need) in the Install-Dir.               \n               Use any Serial at this Patch-Process.\n\n\n\tAdditional Notes: \n\t\t\t \n        The different Versions of Traktor-Pro are stored in ONE \n\tFile (the &quot;Traktor.exe&quot;) BOTH PATCHERS for:&quot;Traktor Pro&quot; \n\tand the &quot;Scratch Pro&quot; (for Timecode-Support) are aviable \n\tJust use the right Patch of your choise from the &quot;Cracks&quot; \n\t\t\t   Directory!*\n\n        * lol or do like me install twice one with original name \n        and other with name scratch!!!","torrent":{"xt":"urn:btih:0cfc91873d2fc6c87e8e2c519f1bb64422a3f6e8","amp;dn":"Native+Instruments+Traktor+Pro+v2.6+-+REPT+%5Bdeepstatus%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0cfc91873d2fc6c87e8e2c519f1bb64422a3f6e8","infoHashBuffer":{"type":"Buffer","data":[12,252,145,135,61,47,198,200,126,142,44,81,159,27,182,68,34,163,246,232]},"announce":[],"urlList":[]}}