{"title":"Bram Stoker's Dracula - Soundtrack (Concert Version)","uid":4505847,"size":40727370,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0d42e38dc9c9e81b8be0d707a4bbf12d65b79fed&amp;dn=Bram+Stoker%5C%27s+Dracula+-+Soundtrack+%28Concert+Version%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"michaelingeorgia","files":1,"time":1226592817,"description":"The soundtrack to BRAM STOKER'S DRACULA by VOJEK KILAR is one of the finest compositions for motion pictures from the 1990s. Unfortunately, the soundtrack recording itself suffers from the same problems that plagues many soundtrack presentations: namely, short, unrelated cues. \n\nWhat this effort attempts to do is to arrange the music in a form which one might hear in a symphonic concert setting rather than as action accompaniment. It is a single movement, much like the tone poems of Liszt, Tchaikovsky, or Rachmaninoff (Isle of the Dead), just to name a few. The emphasis is on a coherent musical narrative, offering a compelling listening experience without any reference to action on the film.\n\nIn order to achieve this, the original CD was ripped, and the resulting non-compressed wave forms were edited and mixed using Adobe Audition. Although there is some relation to film chronology, such relation is purely incidental, as cues are used with complete disregard for either film or soundtrack order. Most of the original CD cues are highly edited, and some are not used altogether. Some sections of the music are layered, especially during transitions from one cue to another. In the end, the original 15 or so tracks were cut up into about In short, this is definitely not merely a matter of jamming the cues together. Rather, the original CD cues were regarded as only raw material for creating an entirely new composition as a whole. (Anyone familiar with the 8&quot; BATMAN mix on the DANNY ELFMAN MUSIC FOR A DARKENED THEATRE will understand the approach here, although this effort is certainly larger and more complex in scope.)\n\nThe length of the performance is about 32 minutes. It is fully MP3 tagged. The final MP3 file was encoded with mp3Pro using VBR at a setting of 100% (highest quality). \n\nIf you enjoy this file, I'll also be posting other soundtrack edits, including ALIEN3 and THE LORD OF THE RINGS.\n\nEnjoy!\n","torrent":{"xt":"urn:btih:0d42e38dc9c9e81b8be0d707a4bbf12d65b79fed","amp;dn":"Bram+Stoker%5C%27s+Dracula+-+Soundtrack+%28Concert+Version%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d42e38dc9c9e81b8be0d707a4bbf12d65b79fed","infoHashBuffer":{"type":"Buffer","data":[13,66,227,141,201,201,232,27,139,224,215,7,164,187,241,45,101,183,159,237]},"announce":[],"urlList":[]}}