{"title":"Sven Birkerts - Reading Life: Books for the Ages (2007)","uid":8667385,"size":469186,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0e3c0a436baf8d16b59a5d9305d2ac6be684660b&amp;dn=Sven+Birkerts+-+Reading+Life%3A+Books+for+the+Ages+%282007%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"workerbee","files":-1,"time":1373425812,"description":"Sven Birkerts - Reading Life: Books for the Ages (Graywolf Press, 2007).\n\nISBN:Â 9781555974640 | 256 pages | EPUB\n\n\nIn Reading Life, virtuoso critic and essayist Sven Birkerts examines what it means to return to resonant works of fiction -- the books one thinks of &quot;covetously, as private properties,&quot; the &quot;personal signposts&quot; of one's inner life. For Birkerts, these include The Catcher in the Rye, Humboldt's Gift, To the Lighthouse, Lolita. In essays on each of these important works, Birkerts reflects upon his first readings of them and what later encounters with them reveal about time, memory, the murmuring transistors of selfhood.\n\n\nReviews\n\n&quot;Weaving memoir with literary criticism, Reading Life feels like its own vicarious thrill.&quot; -- Janet Pocorobba, Harvard Review\n\n&quot;One of America's most distinguished, eloquent servants of the poetry and fiction that matter.&quot; -- Susan Sontag\n\n&quot;To read Birkerts is to hear (and enjoy hearing) the voice of literary conscience.&quot; -- Seamus Heaney\n\n&quot;Expansive and eclectic and laserous and lucid and impassioned and heartlessly smart. Birkerts is the most interesting and persuasive critic in the U.S. today.&quot; -- David Foster Wallace\n\n&quot;Birkerts on reading fiction is like M.F.K. Fisher on eating or Norman Maclean on fly casting. He makes you want to go do it.&quot; -- Jonathan Franzen, The New Yorker\n","torrent":{"xt":"urn:btih:0e3c0a436baf8d16b59a5d9305d2ac6be684660b","amp;dn":"Sven+Birkerts+-+Reading+Life%3A+Books+for+the+Ages+%282007%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e3c0a436baf8d16b59a5d9305d2ac6be684660b","infoHashBuffer":{"type":"Buffer","data":[14,60,10,67,107,175,141,22,181,154,93,147,5,210,172,107,230,132,102,11]},"announce":[],"urlList":[]}}