{"title":"Carmen Villain - Sleeper [2013][EAC,log,cue. FLAC]","uid":8626677,"size":617424255,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0f6fd4ec7fa73af1bd90bf6a2ae0811a1cb001ed&amp;dn=Carmen+Villain+-+Sleeper+%5B2013%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":17,"time":1372525771,"description":"Artist: Carmen Villain\nRelease: Sleeper\nReleased: 2013\nLabel: Smalltown Supersound\nCatalog#: STS238CD / Limited Edition w/ bonus Mixtape CD\nFormat: FLAC / Lossless / Log (100%) / Cue\n[color=blue]Country: Norway\nStyle: Alternative/Indie Rock/pop/\nNeo-Psychedelia\n\n\n01. Two Towns 3:54\n02. Easy 4:34\n03. Lifeissin 3:19\n04. Obedience 6:16\n05. Made A Shell 4:08\n06. How Much 3:29\n07. Light, See 1:07\n08. Dreamo 4:58\n09. It May Well Die 1:58\n10. Kingwoman 3:33\n11. Slowaway 0:58\n12. Demon Lover (Shocking Blue Cover) 3:47\n\n\nCarmen Villain's first single, &quot;Lifeissin&quot;, was a placid ballad with something dark and evasive at its core: Over a faint glimmer of guitar, Villain murmured sour nothings about closing the blinds, going to hell, living in fear. Even the song's run-together spelling suggested something slurred from the corner of the mouth. Like R.E.M.'s &quot;Perfect Circle&quot;, the song danced in the middle distance, defying you to twist the lens and sharpen its edges.\n\nCarmen Villain, aka Carmen Hillestad, is a similarly blurry prospect: The fact that she was once a model, appearing on the cover of magazines like Vogue and Marie Claire, seemed to be the only available scrap of biographical information. One of few exceptions, an interview she posted to her own Facebook page, was conducted entirely in Swedish. Google Translate helped to extract a few intriguing morsels: She chose the stage name Villain to help distance herself from her modeling career. Her debut album Sleeper is the first music she's ever shared with the world, after writing in private for years. And much of the album, she said, &quot;is about indifference, being in a kind of emptiness.&quot;\n\nThis foggy unease and blankness communicates itself everywhere on Sleeper, a frustratingly imperfect record that nonetheless holds onto the essential mystery that sparked my curiosity. It is gloomier than &quot;Lifeissin&quot;, which surfaces through the murk here as a lone moment of clarity. Hillestad surrounds her bored, flat-as-earth vocals with a smeared wall of half-tuned guitars, evoking the seedy prowl of Royal Trux and early Sonic Youth. There are strong hints of bad drugs, and the unpleasant sensations that accompany them.\n\nThe songs with strong, legible vocal melodies carry themselves the best, transforming all of this disaffection and spiritual emptiness into something worth making your own. Hillestad has a knack for curdled, nursery-rhyme melodies, like the late-album highlight &quot;Dreamo&quot;, which walks up and down the same four half-steps like someone humming to themselves. &quot;They caught me staring out the window,&quot; she sings, a lifelong dysphoric on guard against another well-meaning intervention from the outside world. She hits this note repeatedly in her lyrics, which seem to regard regard human interactions through a thick pane of bulletproof glass. &quot;People keep telling me, real life can be real nice,&quot; she sings on &quot;Two Towns&quot;.\n\nThis noncommittal shrug occasionally prevents Sleeper from hitting harder. Without pushing further into her exploration of despair or sharpening her songwriting, Hillestad sometimes lets her music just sit there. Stretches of the album simply drift past, like the cut-and-paste interlude &quot;Slowaway&quot; or the six-minute drone piece &quot;Obedience&quot;, during which there isn't much left to focus on save for the album's rich, reverb-heavy production. &quot;What is love, but a second hand emotion?&quot; Hillestad sings on the haunting &quot;Dreamo&quot;, quoting a beloved Tina Turner line. In my attempts to gather some surrounding context, I ended up corresponding briefly with Hillestad, who told me the quote was a tribute to the lifting power of a memorable song. &quot;That Turner lyric is a sort of reference to the type of cultural noise, for example heard through the radio, that could momentarily drag me out of the detachment I could quite often find myself in,&quot; she wrote. It's a neat object lesson in where she should go next: Music expressing detachment is easy, but music that addresses it requires some heavier lifting.","torrent":{"xt":"urn:btih:0f6fd4ec7fa73af1bd90bf6a2ae0811a1cb001ed","amp;dn":"Carmen+Villain+-+Sleeper+%5B2013%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f6fd4ec7fa73af1bd90bf6a2ae0811a1cb001ed","infoHashBuffer":{"type":"Buffer","data":[15,111,212,236,127,167,58,241,189,144,191,106,42,224,129,26,28,176,1,237]},"announce":[],"urlList":[]}}