{"title":"John Lee Hooker - That's my story [DVDR,PAL]","uid":3995891,"size":4680833024,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:0fad1fe4c3681aa32a2043ee65d485fd1e61f40d&amp;dn=John+Lee+Hooker+-+That%5C%27s+my+story+%5BDVDR%2CPAL%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"hlt","files":25,"time":1201311060,"description":"John Lee Hooker - That&amp;#039;s my story [DVDR,PAL]\n\nIMDB: http://www.imdb.com/title/tt0332160/\nTrailer: http://www.dailymotion.com/video/x15ql7_john-lee-hooker-thats-my-story_music\n\nLanguage: English\nSubtitle: N/A\nSource: DVD9\nVideo: 16:9\nAudio: DD2\nQuality: Great\n\nI won&amp;#039;t seed for very long, keep your download running after it&amp;#039;s finished so others can enjoy aswell.\n\n-----------------------------------------------\n\n&amp;#039;&amp;#039;...I hated school. My school was in my heart. I never learned to read and write. I didn&amp;#039;t want to. God taught me how. I&amp;#039;m a very \n\nsmart person and I pick up about everything. Got the book that God gave me: knowledge and good human sense - loving people and my \n\nmusic. Reading books didn&amp;#039;t get me where I am right now - my guitar!&amp;#039;&amp;#039;\n\n\nIn this loving, endearing portrait of the legendary, recently passed away blues artist John Lee Hooker, his life is described by \n\nhimself, his closest friends and music colleagues, from his birthplace in Mississippi following the ups and downs of his career to \n\nthe big successes. With participation of John Lee Hooker, Eric Clapton, Famous Coachman, Robert Cray, Buddy Guy, John Hammond, \n\nArchie Hooker, John Lee Hooker jr., Maude Hooker, Zakiya Hooker, Mike Kappus, Eddie Kirkland, John Mayal, Charkie Musselwhite, \n\nAdolfo de la Parra (Canned Heat), Bonnie Raitt, Roy Rogers, Carlos Santana, Pete Sears and Pete Wolf.\n\nThat&amp;#039;s My Story is also the title of a famous Hooker song. Its text implies many autobiographic elements. It was his way to \n\ncompensate life through music. The film accompanies him musically through the last six decades by using material from the archives \n\nto the latest recordings.\n\nJohn Lee Hooker was born in Mississippi as son of a reverend and cotton picker. At the age of fourteen he runs away from home, \n\ntries his luck in Memphis, later in Cincinanatti and Detroit. His music gives him a chance to cross the borders of race \n\nrestrictions. Hooker itself, his friends and colleagues recall his past life ? the ups and downs of his career ? and his big \n\ncomeback with his album The Healer, when he was already over seventy.\n\nThe story of Hooker&amp;#039;s life is at the same time the history of Blues and its influence on British and American music from the \n\nfifties to the seventies. With hits like Boogie Chillen, Crawling King Snake, I&amp;#039;m in the Mood and Boom Boom he became an idol for \n\nwhole generations of music makers. Especially for bands from Great Britain in the early sixties, like the Animals, The Rolling \n\nStones and for musicians like Van Morrison, John Mayall and Eric Clapton, in the US for Bob Dylan. For the groups Canned Heat, \n\nJ.Geils Band and Santana he was even something like a father figure.\n\nHis music style has always differed from the style of other Blues musicians. Maybe this is the reason he has fans in every \n\ngeneration over the last sixty years.\n\n&quot;Blues and Jazz are America&amp;#039;s biggest tributes to the history of music&quot; said Carlos Santana, and John Lee Hooker is the one and \n\nonly &quot;Godfather of Blues&quot; and &quot;King of Boogie&quot;. He died 2001 on June 21 in his house in Los Altos, California. He was 83.\n","torrent":{"xt":"urn:btih:0fad1fe4c3681aa32a2043ee65d485fd1e61f40d","amp;dn":"John+Lee+Hooker+-+That%5C%27s+my+story+%5BDVDR%2CPAL%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0fad1fe4c3681aa32a2043ee65d485fd1e61f40d","infoHashBuffer":{"type":"Buffer","data":[15,173,31,228,195,104,26,163,42,32,67,238,101,212,133,253,30,97,244,13]},"announce":[],"urlList":[]}}