{"title":"Mudbound - Hillary Jordan","uid":15602679,"size":3099461,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:118891193c6f53c904c2e1350fb91d499e07a4ff&amp;dn=Mudbound+-+Hillary+Jordan&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mr_mando","files":2,"time":1471675741,"description":"\nIn Jordan's prize-winning debut, prejudice takes many forms, both subtle and brutal. It is 1946, and city-bred Laura McAllan is trying to raise her children on her husband's Mississippi Delta farm―a place she finds foreign and frightening. In the midst of the family's struggles, two young men return from the war to work the land. Jamie McAllan, Laura's brother-in-law, is everything her husband is not―charming, handsome, and haunted by his memories of combat. Ronsel Jackson, eldest son of the black sharecroppers who live on the McAllan farm, has come home with the shine of a war hero. But no matter his bravery in defense of his country, he is still considered less than a man in the Jim Crow South. It is the unlikely friendship of these brothers-in-arms that drives this powerful novel to its inexorable conclusion.\r\n\r\nThe men and women of each family relate their versions of events and we are drawn into their lives as they become players in a tragedy on the grandest scale. As Kingsolver says of Hillary Jordan, &quot;Her characters walked straight out of 1940s Mississippi and into the part of my brain where sympathy and anger and love reside, leaving my heart racing. They are with me still.&quot;","torrent":{"xt":"urn:btih:118891193c6f53c904c2e1350fb91d499e07a4ff","amp;dn":"Mudbound+-+Hillary+Jordan","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"118891193c6f53c904c2e1350fb91d499e07a4ff","infoHashBuffer":{"type":"Buffer","data":[17,136,145,25,60,111,83,201,4,194,225,53,15,185,29,73,158,7,164,255]},"announce":[],"urlList":[]}}