{"title":"Farming.Simulator.2011.Covers-FASDOX","uid":6021875,"size":5105198,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:128142bf64de1210e523443792f83758e984ea72&amp;dn=Farming.Simulator.2011.Covers-FASDOX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rlf-rls","files":-1,"time":1291818650,"description":"Farming Simulator 2011 *Covers* - FASSDOX\n\nDate.........: 2010-12-08                         Files........: 02 x 5.00\nCompany......: Giants Software                    Language.....: English\nRequirements.: Farming.Simulator.2011-SKIDROW\n\nGame Notes\n\nCovers scanned at 1200 DPI, then downsampled to 300 DPI (90% quality jpg)\n- DVD Box: Outside\n- Disc\n\nThe long awaited sequel to one of the best selling simulations of all time\nbrings the intricacies of farming to the desktop, with stunning new\ngraphics and a myriad of new features, Farming Simulator 2011 is the pick\nof the crop!\n\nIn career mode, play the role of a young farmer and experience the varied\ndaily life on a farm in the completely re-designed, freely accessible\nworld.\n\nAll new in Farming Simulator 2011 is the option for livestock breeding. To\nbe successful your animals will need proper care and attention, with a full\nfeeding regime. In return, extra revenue can be gained from selling fresh\nmilk to the dairies and even spreading organic fertiliser over your fields!\n\nIf crop farming is more to your taste, build up your farm income by growing\na wide range of crops including barley, corn, rape and wheat.\n\nHowever you structure your farm you are sure to need mechanised help. As\nyour income grows take the opportunity to invest in everything from\ntractors, combine harvesters, ploughs, seed drills to balers and loaders,\nall lavishly detailed and fully operable. With licensing from machine\nmanufacturers such as DEUTZ-FAHR, KRONE, HORSCH, POETTINGER and VOGEL &amp;\nNOOT, you are able to drive machines that are faithful to the originals in\nevery respect.\n\nNo longer is farming a solitary affair thanks to a unique multiplayer mode\nin which you can work on your farm together with your friends via an\nInternet or local area network connection. It is even possible to create\nand download custom vehicles and tools, via an integrated &quot;modding&quot;\nfeature.\n\nWhatever your chosen play style, Farming Simulator 2011 lets you sow the\nseeds of agricultural accomplishment!\n\nFeatures:\n~~~~~~~~~\n- Career mode with business section and cattle breeding\n- Multi-player mode for playing together with friends over Internet/LAN\n- Large new vehicle fleet with authentic agricultural machines by\n  DEUTZ-FAHR, KRONE, HORSCH, POETTINGER and VOGEL &amp; NOOT\n- Lots of sophisticated equipment\n- Computer controlled helpers\n- Gamepad and steering wheel support\n\nURL: http://www.farming-simulator.com\n\nInstallation Notes\n\n1. UnRAR\n\nGroup News\n\nWe bring you games that other groups do not do. We are different, like us\nor hate us. You think some games that we release are crap? We do not care\nbecause we think that scene means that every game should be released.\n\nGreetings\n\nTNT - PROCYON - GOW - WARG - Razor1911 - GENESiS - 1C - PROPHET\nVACE - POSTMORTEM - iTWINS - RELOADED - ViTALiTY - AVENGED - Bamboocha\n\nIf you enjoy this game, please buy it! Developers deserve your support!\n\n\nYou can download: Farming.Simulator.2011-SKIDROW from here:\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/5997689/Farming.Simulator.2011-SKIDROW&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/5997689/Farming.Simulator.2011-SKIDROW&lt;/a&gt;\n\n\nEnjoy !!!","torrent":{"xt":"urn:btih:128142bf64de1210e523443792f83758e984ea72","amp;dn":"Farming.Simulator.2011.Covers-FASDOX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"128142bf64de1210e523443792f83758e984ea72","infoHashBuffer":{"type":"Buffer","data":[18,129,66,191,100,222,18,16,229,35,68,55,146,248,55,88,233,132,234,114]},"announce":[],"urlList":[]}}