{"title":"Star Dragon by Mike Brotherton","uid":8768754,"size":1540492,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:13748f504373910140dec66dd1d0345c1bc3fab9&amp;dn=Star+Dragon+by+Mike+Brotherton&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"OrajelJunkie","files":-1,"time":1375399303,"description":"I know lots of people want different formats.I just upload what i can get.If i convert to epub for 1 commenter,where does it stop?Mobi?pdp?jar?\nUse Calibre to convert and manage your e-books,it rules.\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/8745906/Calibre_E-Book_Manager_Version_0.9.41&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/8745906/Calibre_E-Book_Manager_Version_0.9.41&lt;/a&gt;\n\n********************************************************************************\n\n\nThe SS Cygni probe sent back hours of video, captured by the Biolathe AI, but only a few minutes mattered--the four minutes that showed a creature made of fire, living , moving, dancing in the plasma fire of the double star's accretion disk. A dragon made of star stuff, so alien that only a human expedition to observe and perhaps capture it, could truly understand them.\n\nIt's a perilous journey into the future, however, for SS Cygni is 245 light- years from Earth, and even though only two years' subjective time will pass on board the Karamojo, the crew will return to an Earth where five hundred years have passed. Captain Lena Fang doesn't care--she has made her life on her ship, where her best friend is the ship's AI. Samuel Fisher, the contract exobiologist,doesn't care, either. He is making the voyage of a lifetime and in the small world of the Karamojo he will have to live with the consequences of his obsessive quest for knowledge. The rest of the small crew--Axel Henderson, the biosystems engineer; Sylvia Devereaux, the beautiful physical sciences expert; and Phil Stearn, the ship's jack-of-all-trades--have their own reasons for saying good-bye to everyone they have ever known. As the Biolathe AI said, uncertain five hundred- year round trips don't attract the most stable personalities, but somehow they'll have to learn to get along with each other, if they're to catch their dragon and come home again.","torrent":{"xt":"urn:btih:13748f504373910140dec66dd1d0345c1bc3fab9","amp;dn":"Star+Dragon+by+Mike+Brotherton","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"13748f504373910140dec66dd1d0345c1bc3fab9","infoHashBuffer":{"type":"Buffer","data":[19,116,143,80,67,115,145,1,64,222,198,109,209,208,52,92,27,195,250,185]},"announce":[],"urlList":[]}}