{"title":"Wally Woods T.H.U.N.D.E.R. Agents Tower Comics 1965-1969 COMPLET","uid":8540407,"size":1100035185,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:13b731208878a84ec1c2c416fea9d8da85a1280c&amp;dn=Wally+Woods+T.H.U.N.D.E.R.+Agents+Tower+Comics+1965-1969+COMPLET&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mothra67","files":-1,"time":1370370248,"description":"This is for STFMaryville, to enjoy the wonders that is Wally Wood!\n\n\nT.H.U.N.D.E.R. (The Higher United Nations Defense Enforcement Reserves) is a secret organization formed after World War II to fight covert threats. When UN special agents storm a Professor Emil Jenning's mountain laboratory to drive off the forces of the Warlord, they discover that Jenning has been killed and the Warlord's soldiers have stolen his inventions. But there are a few they missed, which T.H.U.N.D.E.R. takes into custody. These inventions are super weapons to combat the Warlord by providing superpowers to whoever wears them:\n\n    The Thunderbelt was given to Leonard Brown, code-name Dynamo. It increases his density, giving him super strength and invulnerability for a period of 30 minutes.\n    Anthony Dunn, a dying scientist, transferred his mind into an android body, allowing him to switch between bodies at will. He was given an invisibility cloak, becoming NoMan.\n    Finally, John Janus, secretly a traitor working for the Warlord, was given the Menthor helmet. It gave him mental powers and a heroic split personality. \n\nTogether they would become the T.H.U.N.D.E.R. Agents.\n\nThey are assisted by the T.H.U.N.D.E.R. Squad, a paramilitary group with no superpowers but each possessing special skills. Later, the Squad's leader Virgil 'Guy' Gilbert was given a super-suit that increases his metabolism and became the super-fast Lightning. His powers come at a considerable price--each time he uses them drains a little bit of his life. After Menthor's death, Craig Lawson, skydiver and mercenary with a shady past, becomes the Raven thanks to an experimental rocket pack.\n\nTheir enemies included the Overlord and his Subterraneans, S.P.I.D.E.R., Andor, Demo, Tarantula, and Iron Maiden. \n\nSeed for all to enjoy!  Sharing is caring","torrent":{"xt":"urn:btih:13b731208878a84ec1c2c416fea9d8da85a1280c","amp;dn":"Wally+Woods+T.H.U.N.D.E.R.+Agents+Tower+Comics+1965-1969+COMPLET","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"13b731208878a84ec1c2c416fea9d8da85a1280c","infoHashBuffer":{"type":"Buffer","data":[19,183,49,32,136,120,168,78,193,194,196,22,254,169,216,218,133,161,40,12]},"announce":[],"urlList":[]}}