{"title":"Idle Civilization","uid":12836852,"size":262439522,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:13c428c73f0913b91ea197411474f4d931510de7&amp;dn=Idle+Civilization&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dauphong","files":1,"time":1448466470,"description":"About This Game\r\nEnter the vast lands of Communia, the magical planet that goes on forever. Or at least it looks that way. Several hundred colonies later people still have reported absolutely no end in sight and no familiar sights whatsoever. Goes without saying that it's an easy job to find an hitherto uninhabited place and claim it as your own. So take command of a pair of villagers, help them build and grow and expand your village...until it turns into a town, a duchy, a kingdom. When that becomes unsatisfactory, turn your kingdom into an empire, conquer your smaller neighbors, trade with your bigger neighbors, raid and explore, send heroes on missions and grow, grow, grow!\r\nSo what is this?\r\nMuch like the title says, the game has its roots in the &quot;idle&quot; genre and indeed it was such when it first started out. But it has evolved into so much more that, in the current incarnation, I can proudly say it's a full-fledged civilization builder.\r\nIdle Civilization offers depth and complexity that most idle games do not. Yes, you will see big numbers, yes, you will only go upwards and rarely downward, yes you will have a prestige system and other classic elements, but you will have so much more to manage and entertain yourself with than in your average game in the genre.\r\nAlright, so what should we look forward to?\r\n- over 30 buildings\r\n- over 60 researches\r\n- 6 deities to worship with unique powers\r\n- a randomized map full of towns and villages to conquer on each colony\r\n- ruins to explore in search of ancient magical fragments\r\n- mighty heroes to send on epic adventures to gain loot and glory\r\n- unique wonders of the world\r\n- diplomacy and cultural events\r\n- random events\r\n- lots of achievements\r\n- a compelling colony system\r\n- offline progress\r\n- and more... (there's always more and more)","torrent":{"xt":"urn:btih:13c428c73f0913b91ea197411474f4d931510de7","amp;dn":"Idle+Civilization","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"13c428c73f0913b91ea197411474f4d931510de7","infoHashBuffer":{"type":"Buffer","data":[19,196,40,199,63,9,19,185,30,161,151,65,20,116,244,217,49,81,13,231]},"announce":[],"urlList":[]}}