{"title":"Jenny Nordberg - De förklädda flickorna... - Svensk","uid":12623351,"size":652889049,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:148471d337c02c59f630b9502cffe0261406c8e0&amp;dn=Jenny+Nordberg+-+De+f%26ouml%3Brkl%26auml%3Bdda+flickorna...+-+Svensk&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"totomas1","files":31,"time":1445632632,"description":"Jenny Nordberg - De förklädda flickorna i Kabul\r\n\r\nEfter att ha fött tre flickor bestämmer sig Azita, en kvinnlig politiker i Afghanistan, för att förvandla sin fjärde dotter till en son. Hennes yngsta dotter får sitt långa hår avklippt och kläs i byxor och en jeansskjorta.\r\nMaken blir också nöjd - han blir inte längre baktalad som ett misslyckad far till enbart fyra döttrar, i ett samhälle där pojkar och män är det enda som räknas.\r\n\r\nDe kallas &quot;bacha posh&quot; - flickorna som kläs ut till pojkar av föräldrar som har ett desperat behov av söner. I förklädnad kan flickorna röra sig friare i ett hårt segregerat samhälle. De kan också arbeta och gå i skolan, tills puberteten sätter stopp och tvingar dem att bli kvinnor som gifts bort mot sin vilja.\r\n\r\nNär journalisten Jenny Nordberg först berättade om det okända fenomenet i New York Times 2010 blev de förklädda flickorna en världsnyhet. Boken fortsätter att följa flera familjer på nära håll i Kabul och är en fascinerande historia om uppfinningsrikedom och kollektivt självbedrägeri, men blir också ett skakande reportage om hur lite en kvinnas liv är värt efter tretton års krig i Afghanistan.\r\n\r\nI sökandet efter hemligheter i en krigszon ställer författaren förbjudna frågor om sex och könsidentitet, om Gud och religiösa lagar, och om vad skillnaden mellan pojkar och flickor - eller män och kvinnor - egentligen består i.\r\nDet hon till slut finner i ett av världens farligaste länder lär oss något om vår egen historia och om människors vägran att acceptera förtryck genom alla tider.\r\n\r\n\r\nUppläsare: Hanna Schmitz\r\n\r\nAll creds to original ripper","torrent":{"xt":"urn:btih:148471d337c02c59f630b9502cffe0261406c8e0","amp;dn":"Jenny+Nordberg+-+De+f%26ouml%3Brkl%26auml%3Bdda+flickorna...+-+Svensk","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"148471d337c02c59f630b9502cffe0261406c8e0","infoHashBuffer":{"type":"Buffer","data":[20,132,113,211,55,192,44,89,246,48,185,80,44,255,224,38,20,6,200,224]},"announce":[],"urlList":[]}}