{"title":"Game of Thrones - Season 2","uid":13784568,"size":5920012582,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:14e0bfd6adbb5b68f92940dd5eb09983bee3f553&amp;dn=Game+of+Thrones+-+Season+2&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"POtHS11","files":20,"time":1457355046,"description":"Game of Thrones - Season 2\r\n\r\n\r\nGame of Thrones is an American fantasy drama television series created by showrunners David Benioff and D. B. Weiss. It is an adaptation of A Song of Ice and Fire, George R. R. Martin's series of fantasy novels, the first of which is titled A Game of Thrones. It is filmed in a Belfast studio and on location elsewhere in Croatia, Iceland, Malta, Morocco, Northern Ireland, Spain, Scotland, and the United States, and premiered on HBO in the United States on April 17, 2011. The series has been renewed for a sixth season,[5] which will premiere on April 24, 2016.[6]\r\n\r\nThe series is set on the fictional continents of Westeros and Essos, and interweaves several plot lines with a large ensemble cast. The first narrative arc follows a civil war among several noble houses for the Iron Throne of the Seven Kingdoms; the second covers the attempts to reclaim the throne by the exiled last scion of the realm's deposed ruling dynasty; the third chronicles the rising threat of the impending winter and the legendary creatures and fierce peoples of the North.\r\n\r\nGame of Thrones has attracted record numbers of viewers on HBO and attained an exceptionally broad and active international fan base. It has received widespread acclaim by critics, particularly for its acting, complex characters, story, scope, and production values, although its frequent use of nudity, violence, and sexual violence has attracted criticism. The series has won 26 Primetime Emmy Awards, including the Primetime Emmy Award for Outstanding Drama Series in 2015—when it set a record for most wins for a series in a single year—and numerous other awards and nominations, including three Hugo Award for Best Dramatic Presentation, a Peabody Award, and three Golden Globe Award nominations. From among the ensemble cast, Peter Dinklage won two Emmy Awards for Outstanding Supporting Actor in a Drama Series and a Golden Globe Award for Best Supporting Actor – Series, Miniseries or Television Film for his performance as Tyrion Lannister","torrent":{"xt":"urn:btih:14e0bfd6adbb5b68f92940dd5eb09983bee3f553","amp;dn":"Game+of+Thrones+-+Season+2","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"14e0bfd6adbb5b68f92940dd5eb09983bee3f553","infoHashBuffer":{"type":"Buffer","data":[20,224,191,214,173,187,91,104,249,41,64,221,94,176,153,131,190,227,245,83]},"announce":[],"urlList":[]}}