{"title":"Velho Amigo - O Universo Musical de Baden Powell (2003)","uid":6276338,"size":694882426,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:156dbffec696df648a2d75382695691b9442403c&amp;dn=Velho+Amigo+-+O+Universo+Musical+de+Baden+Powell+%282003%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"kerouac_rj","files":-1,"time":1301270913,"description":"Documentary about one of the gratest brazilian guitar players of all time.\n\nBaden Powell de Aquino was born August 6, 1937 in Varre-e-Sai.\nAt the age of seven he started to play classical guitar. At the age of fourteen he got a diploma at the conservatory in Rio. By fifteen he was a professional musician, by twenty he was a famous composer. Important for his musical development was his father Lilo, his teacher Jaime Florence, also the poets Vinicius de Moraes and Paulo Cesar Pinheiro. Baden created the most famous brazilian songs of that period with these poets. Nowadays this songs belong to the classics.\n\nHis album &quot;Tristeza On Guitar&quot; was in 1966 an international success. In 1967 he gave a concert at the &quot;Berliner Jazztage&quot;,\nwhich was enthusiastically celebrated in Germany. From these days forward the german audience honored and loved him.\nIn 1970 the &quot;Baden Powell Quartet&quot; started its first european and japan tour, which was a big success. Many album releases showed an experimental and improvising musician who knew how to add baroque modulations to his synthesis of samba and jazz music. In these days he made recordings of high musical quality, a fusion of afro-brazilian and european music culture.\n\nIn the mid 70's Baden Powell got into a serious health crisis and his public appearances and his recordings became rare. In 1983 he moved with his wife and his two sons to Baden-Baden and he lived some years retired. With his solo performances in Europe he was able to resume older successes. Back to Brazil he recorded the album &quot;Rio das Valsas&quot; in 1988, which had a great musical atmosphere and his interpretations became more mature.\nIn addition to this he cared for the musical education of his sons Philippe-Baden and Louis-Marcel. In May 2000 he published one\nof his last albums &quot;Lembrancas&quot;, which is the legacy of a great master of the brazilian guitar.\n\nHe died on September 26, 2000 in Rio de Janeiro. \n\n\nFile Name .........................................: O universo musical de baden powell.avi\nFile Size (in bytes) ............................: 694,882,426 bytes\nRuntime ............................................: 54:22.984\n\nVideo Codec ...................................: XviD ISO MPEG-4\nFrame Size ......................................: 720x432 (AR: 1.667)\nFPS .................................................: 23.976\nVideo Bitrate ...................................: 1501 kb/s\nBits per Pixel ...................................: 0.201 bpp\nB-VOP, N-VOP, QPel, GMC.............: [B-VOP], [], [], []\n\nAudio Codec ...................................: 0x2000 (Dolby AC3) AC3\nSample Rate ...................................: 44100 Hz\nAudio Bitrate ...................................: 192 kb/s [2 channel(s)] CBR\nNo. of audio streams .......................: 1\n\n\n********************************************************************************\n    \nFreakyflicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\n    The Freakyflicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\n    If you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n                         \n   &lt;a href=&quot; https://board.freakyflicks.org/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://board.freakyflicks.org/index.php&lt;/a&gt;\n\n    'If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE&quot;","torrent":{"xt":"urn:btih:156dbffec696df648a2d75382695691b9442403c","amp;dn":"Velho+Amigo+-+O+Universo+Musical+de+Baden+Powell+%282003%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"156dbffec696df648a2d75382695691b9442403c","infoHashBuffer":{"type":"Buffer","data":[21,109,191,254,198,150,223,100,138,45,117,56,38,149,105,27,148,66,64,60]},"announce":[],"urlList":[]}}