{"title":"Punch Club v1.06","uid":13366009,"size":77169082,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:15784fedfa502d93a0b011e2c9ba2b859aab6fc2&amp;dn=Punch+Club+v1.06&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Androider","files":1,"time":1454164558,"description":"Your father was brutally murdered before your eyes. Now you must train hard, eat chicken and punch dudes in the face to earn your place in the Punch Club ranks, and discover who ended your father's life.\r\n\r\nPunch Club is a boxing tycoon management game with multiple branching story lines. Your goal is clear, but how you get there depends on whether you want to legitimately climb the rankings, or take the more ridiculous, shady route.\r\n\r\nAlong the way you'll want to focus your talents. Will you take the Way of the Tiger, the Way of the Turtle, or the Way of the [other one?]? Your strength, accuracy and agility all depends on whichever Way enlightens your path. Do you have stripes, or flippers?\r\n\r\nAnd every decision will matter, especially in your social life. You'll be juggling friendships, love life, work, recreational time, relationships, and possible stardom, all alongside your gym time and fighting aligators. It's not all just pumping iron, you know.\r\n\r\n- Fighter management sim with RPG and tycoon elements\r\n- Find out who killed your father, and maybe learn something about yourself along the way\r\n- Heavily story-driven, with multiple different narrative branches and game endings to discover\r\n- Get as deep with stats as you like, and find your own way through extensive skill trees\r\n- Gorgeous pixel visuals with 80-90s references and nostalgia all over the place\r\n\r\nWhat's New:\r\n\r\nFixed options localization bug\r\n\r\nMore info:\r\n \nhttps://play.google.com/store/apps/details?id=com.tinybuildgames.punchclub","torrent":{"xt":"urn:btih:15784fedfa502d93a0b011e2c9ba2b859aab6fc2","amp;dn":"Punch+Club+v1.06","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"15784fedfa502d93a0b011e2c9ba2b859aab6fc2","infoHashBuffer":{"type":"Buffer","data":[21,120,79,237,250,80,45,147,160,176,17,226,201,186,43,133,154,171,111,194]},"announce":[],"urlList":[]}}