{"title":"Scott Walker - The Collection 1967-1970","uid":9434617,"size":465958834,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:15d78a381019fb4bf38baf85ccc211b02503654e&amp;dn=Scott+Walker+-+The+Collection+1967-1970&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"kakaplanet","files":-1,"time":1388875089,"description":"mp3 320\n\nScott Walker's catalog has been reissued several times; therefore, yet another package, this one containing his four self-titled solo albums and 'Til the Band Comes In (sans any bonus material), might seem puzzling at first, or a cash-in at worst. Indeed, this isn't even a truly chronological reissue: Scott Sings Songs from His TV Series was his actual fourth album, issued in 1969, between Scott 3 and Scott 4. The choice to include the uneven 'Til the Band Comes In, his sixth record -- and one of the first of his truly confounding releases from the '70s -- is interesting if not ideal. That said, it is not without merit as about half of it is wonderful. Even Walker's first two truly solo tracks, which appeared on the Solo John/Solo Scott EP (with fellow Walker Brothers member John Walker), from 1966 are absent. Yet there is a reason to recommend this box over any other reissues of this material. The previous CD masters and the American LP versions of Scott 1-4 have all been lacking in sonic quality. The warmth of the mid-range so abundant on the original LPs has always been absent, washed out in favor of highlighting dynamic range at top and bottom (the LPs were especially bad). Until now. The sound on these discs is warm, spacious, and sacrifices nothing in dynamism. Even the feel of the recording studios are captured. While almost no data on the transfers is available in the credits -- &quot;Mastered at Abbey Road Studios&quot; is it -- the audio difference is so striking it is easy to suggest that these remasters used the original analog tapes as their sources. In addition to four of the most mystifying, ambitious, and enduring albums in pop history (as well as one genuine head scratcher in 'Til the Band Comes In), there is a handsome 40-plus page booklet that contains photographs, interviews (all of them reprints, but it's nice to have them in one place), and a truly definitive, new historical and critical essay with detailed album-by-album analysis by Rob Young of The Wire. For any serious Walker fan who has purchased these titles before, Scott: The Collection 1967-1970 is well worth shelling out again. This is the standard by which all future reissues of his recordings will be judged. ","torrent":{"xt":"urn:btih:15d78a381019fb4bf38baf85ccc211b02503654e","amp;dn":"Scott+Walker+-+The+Collection+1967-1970","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"15d78a381019fb4bf38baf85ccc211b02503654e","infoHashBuffer":{"type":"Buffer","data":[21,215,138,56,16,25,251,75,243,139,175,133,204,194,17,176,37,3,101,78]},"announce":[],"urlList":[]}}