{"title":"Classical Favourites vol. 1  3CD","uid":4985842,"size":987127874,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:169a3a71f193a856db525c20a15b64b670842455&amp;dn=Classical+Favourites+vol.+1++3CD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"keeybee","files":50,"time":1246686521,"description":"The first volume of two (boxes) with three CD each. This is the Swedish release.\n\nFor more info on this album, in english &lt;a href=&quot;\nhttp://www.naxos.com/catalogue/item.asp?item_code=8.550521.&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.naxos.com/catalogue/item.asp?item_code=8.550521.&lt;/a&gt;\n\nFor info in swedish &lt;a href=&quot;\nhttp://www.naxosdirect.se/3CD-BOX-Klassiska-Favoriter-1/title/8550521-23/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.naxosdirect.se/3CD-BOX-Klassiska-Favoriter-1/title/8550521-23/&lt;/a&gt;\n\nLet me know what you think of this, good or bad. \n\n\n\nTracklist\n; Generated with Mp3tag v2.43\n; http://www.mp3tag.de\n\n\nCD 1\n01  Handel, Arrival of the Queen of Sheba from Solomon - Budapest Strings, Banfalvi, Bela, Conductor\n02  Bach, Air from Orchestral Suite No. 3 in D-major - Capella Istropolitana, Edlinger, Richard, Conductor\n03  Bach, Badinerie from Orchestral Suite No. 2 in h-minor - Capella Istropolitana, Edlinger, Richard, Conductor\n04  Albinoni, Adagio for Organ and Strings - Bogacz, Pavel, violin; Capella Istropolitana, Edlinger, Richard, Conductor \n05  Vivaldi, Adagio from Spring from Four Seasons (1st Movement) - Nishizaki, Takako, violin; Capella Istropolitana, Gunzenhauser, Stephen, Conductor\n06  Vivaldi, Largo from Piccolo Concerto - Capella Istropolitana, Edlinger, Richard, Conductor\n07  Handel, La Rejouissance from Fireworks Music - Capella Istropolitana, Warchal, Bohdan, Conductor\n08  Handel, Largo from Xerxes - Capella Istropolitana, Edlinger, Richard, Conductor\n09  Pachelbel, Canon - Capella Istropolitana, Edlinger, Richard, Conductor\n10  Gluck, Dance Of The Blessed Spirits from Orfeo ed Euridice - Slovak State Philharmonic Orchestra, Kosice; Wildner, Johannes, Conductor\n11  Handel, Alla Hornpipe from Water Music - Capella Istropolitana, Warchal, Bohdan, Conductor\n12  Bach, Toccata from Toccata and Fugue in D-minor - Rubsam, Wolfgang, organ\n13  Albinoni, Adagio from Oboe Concerto in D-minor, Op. 9, No. 2 - Camden, Anthony, oboe; London Virtuosi, Georgiadis, John, Conductor\n14  Bach, Largo from Piano Concerto No. 5 - Chang, Hae Won, piano; Camerata Cassovia, Stankovsky, Robert, Conductor\n15  Haydn, Finale from Trumpet Concerto in E flat-major - Kejmar, Miroslav, trumpet; Capella Istropolitana, Skvor, Peter, Conductor\n16  Mozart, Andante from Piano Concerto No. 21 - Jando, Jeno, piano; Concentus Hungaricus, Ligeti, Andras, Conductor\n17  Handel, Hallelujah Chorus from Messiah - Scholars Baroque Ensemble\n\n\nCD 2\n01  Beethoven, Symphony No. 5 in C minor, Op. 67: I. Allegro con brio - Zagreb Philharmonic Orchestra, Edlinger, Richard, Conductor\n02  Beethoven,Romance for Violin &amp; Orchestra No. 2, Op.50 - Nishizaki, Takako, violin; Slovak Philharmonic Orchestra, Jean, Kenneth, Conductor\n03  Beethoven,&quot;Moonlight&quot; Sonata Op.27/2, 1. Movement - Jando, Jeno, piano\n04  Mozart,(Marcia) Alla Turca from Piano Sonata No. 11, K 331 - Jando, Jeno, piano\n05  Beethoven,FÃƒÂ¼r Elise (Bagatelle WoO 59) - Szokolay, Balazs, piano\n06  Mozart,Symphony No. 40, K 550, 1. Movement - Capella Istropolitana, Wordsworth, Barry, Conductor\n07  Mozart,Adagio from Violin Conccerto No. 3, K 216 - Nishizaki, Takako, violin, Capella Istropolitana, Gunzenhauser, Stephen, Conductor\n08  Mozart,Lacrimosa from Requiem, K 626 - Slovak Philharmonic Chorus, Slovak State Philharmonic Orchestra, Kosice .Kosler, Zdenek, Conductor\n09  Schubert,Impromptu Op. 142, No. 2, D.935 - Jando, Jeno, piano\n10  Mozart,Adagio from Clarinet Concerto K 622 - Ottensamer, Ernst, clarinet, Vienna Mozart Academy, Wildner, Johannes, Conductor\n11  Beethoven, Finale &quot;Ode to joy&quot; from Symphony No. 9 &quot;Choral&quot;, Op. 125 - Zagreb Philharmonic Orchestra, Edlinger, Richard, Conductor\n\n\nCD 3\n01  Orff, Carmina Burana: O Fortuna  - Slovak Philharmonic Chorus , Slovak Radio Symphony Orchestra, Gunzenhauser, Stephen, Conductor\n02  Grieg, Peer Gynt: In the Hall of the Mountain King - BBC Scottish Symphony Orchestra, Maksymiuk, Jerzy, Conductor\n03  Gershwin, Rhapsody in Blue - Kathryn Selby piamo, Slovak Philharmonic Chorus, Slovak Radio Symphony Orchestra, Gunzenhauser, Stephen, Conductor\n04  Sibelius, Finlandia, Op. 26 - Slovak Philharmonic Chorus, Slovak Radio Symphony Orchestra, Gunzenhauser, Stephen, Conductor\n05  Rodrigo, Concierto de Aranjuez: II. Adagio - Kraft, Norbert, guitar, Northern Chamber Orchestra, Ward, Nicholas, Conductor\n06  Satie, Gymnopedi Nr 1 - KÃƒÂ¶rmendi, Klara, piano\n07  Tchaikovsky, Sleeping Beauty Waltz  - Slovak State Philharmonic Orchestra, Kosice, Mogrelia, Andrew, Conducto\n08  Prokofjev, Romeo and Juliet: Montagues and Capulets - Slovak State Philharmonic Orchestra, Kosice, Mogrelia, Andrew, Conducto\n09  Grieg, 12 Songs, Op. 33: No. 2. Varen (Last Spring) - Capella Istropolitana,  Leaper, Adrian, Conducto\n10  Elgar,Pomp and Circumstance Marches, No. 1: Allegro con molto - Slovak Philharmonic Chorus , Slovak Radio Symphony Orchestra, Gunzenhauser, Stephen, Conductor\n11  Ravel, Bolero - Royal Philharmonic Orchestra, Leaper, Adrian, Conductor\n\n","torrent":{"xt":"urn:btih:169a3a71f193a856db525c20a15b64b670842455","amp;dn":"Classical+Favourites+vol.+1++3CD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"169a3a71f193a856db525c20a15b64b670842455","infoHashBuffer":{"type":"Buffer","data":[22,154,58,113,241,147,168,86,219,82,92,32,161,91,100,182,112,132,36,85]},"announce":[],"urlList":[]}}