{"title":"Footsie Babes # 3 [2007, DVD.xvid] - foot/feet fetish","uid":4584178,"size":1467211776,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:16f4aa89c739688c237175f3ed66e4134f862cce&amp;dn=Footsie+Babes+%23+3+%5B2007%2C+DVD.xvid%5D+-+foot%2Ffeet+fetish&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"h0tspurred","files":2,"time":1229552182,"description":"Footsie Babes # 3 [2007, DVD.xvid]\n\n\n\n\nall 6 screens (large) + DVD-covers:\n &lt;a href=&quot;\nhttp://pixxxtpb.blogbugs.org/4431059/Footsie-Babes-3---screens.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://pixxxtpb.blogbugs.org/4431059/Footsie-Babes-3---screens.html&lt;/a&gt;\n\n\n\n\n\n\nActresses\n\n    * Adriana Malkova [MastOnly]\n    * Adrianne Rouso\n    * Dora Venter\n    * Monica Sweet (as Jo) [LezOnly]\n    * Jordan Green\n    * Mercedes Dragon\n    * Sylvia Laurent [LezOnly]\n\nActors\n\n    * Bob Terminator\n    * Bruno SX\n    * Victor\n\n \n   \nScene Breakdowns\n\n    * Scene 1. Adriana Malkova\n    * Scene 2. Mercedes Dragon, Victor\n    * Scene 3. Bruno SX, Dora Venter\n    * Scene 4. Monica Sweet, Sylvia Laurent\n    * Scene 5. Bob Terminator, Jordan Green\n    * Scene 6. Adrianne Rouso, Guy\n\n\n \n\n\nCategory:      Fetish, Feet\nStudio:        21st Sextury\nDirector:      Andrew Youngman\nRelease Date:  Mar 23, 2007\nLanguage:      English\nFormat:        Xvid\n\n\nREVIEW:\n\n\nBody of Review: Afraid that it might be just another fetish flick advertising well but delivering slop, I was pleasantly surprised about &quot;Footsie Babes 2&quot;. Director Youngman did a fabulous job of not simply capturing the feet of the women in the film, but giving them attention. Consistency in a series is difficult, especially with a fetish flick where the audience is somewhat smaller. But if Youngman can duplicate his last effort, he just might produce the best foot series since the &quot;10 Little Piggies Series&quot;. This is reviewer is rooting for him.\n\n\nScene 1: Adriana Malkova \n\t\nActs Included: Foot play, Heavy Petting\nAlready glistening wet, hot blond Adriana is kicking back in a sauna room, rubbing her feet together and along the wooden bench. She has long, slender toes, with red nails and a little silver toe ring. She takes a bucket of water and slowly spoons it over her legs and along her feet. Pointing her toes directly into the camera, she teases the audience with her perfect piggies. Then she arches her feet back, spreading her toes and tightening her sole. We spend a slow and steamy 20 minutes with Adriana and her feet before she even leaves the sauna and takes her top off. Her breasts are nice and olive hued like the rest of her body. Later she starts to rub her pussy, but continues to keep her legs and feet in the air or in front of the camera. Aside from some heavy petting, this is one long foot worship scene. Shrimpers will love the amount of camera time spent on Adriana's piggies and especially enjoy that her body is as hot as her feet. A promising start to this volume.\n\n\nScene 2: Mercedes Dragon \t\nActs Included: Oral, Footjob, Vag, Cumshot\nMercedes sits in a studs lap as she models a pair of fugly silver heels that look like they were made out of aluminum foil. Luckily they come off soon. Mercedes is a leggy reddish-brunette with beautiful, plump breasts and a slick pussy that gets immediate attention. The guy fingers her pussy until she is wet and then starts eating her out. Mercedes's feet are always in the shot, but not like the previous scene or earlier episodes. Oral sex takes priority for some time until the dude slips his dick between her feet and toes. A long, clumsy footjob follows and leads into vaginal porking across a couch. Mercedes is kinda stiff. She doesn't make much noise or take any ownership. Her feet are decent; they look almost identical to Adriana's. So there's some staleness and a sense of repetition here. Mercedes is a pretty face and has an amazing figure, but if your gonna have a look on your face that says you'd rather be washing your car, go wash your car.\n\n\nScene 3: Dora Venter \t\n\nActs Included: Oral, Toesucking, Footjob, Cumshot\nSultry blond Dora Venter has a hot, young, Florida-mom style. Perfect long legs, nice thighs and full breasts, nails done up and blond streaked hair. She may be 20 but looks 30, yet still undeniably hot. As she lies on a couch she models her lovely feet. Her red painted toenails are tucked into a cheap-looking shoe (what's with these crappy shoes?) and do not come out until she needs her feet free to job one lucky guy's stiff pecker. Dora does something nice and leans in to his crotch as she's giving him a footjob so that she can suck him off while she gives her feet a rest. Plenty of ball rubbing and shaft scratching from this babe, and a good deal of M-F toe sucking, even if it is from a graying, chubby guy. There's no insertion here, just tugging, licking, and stroking which means a ton of time with Dora's lovelies. Watch for when she sucks his dick and tickles his nut sack with her toes. Lucky guy. After much hard work, Dora, using only her feet, brings him to come a nice, sticky mess on her toes.\n\n\nScene 4: Jo &amp; Szilvya Lauren \n\t\nActs Included: Foot Play, Toesucking, Foot to Vag\nAs it should be, the first thing we see of Jo and Szilvya (damn that's tough to type) is their feet. One is wearing white stockings while the other has gone o'naturale. The blond looks a bit like Jennifer Garner and the brunette (if you take a shot of whiskey and squint from across the room) resembles Angelina Jolie. Needless to say, both are hot and they strut their stuff so slowly and carefully that even if you despise feet, this is one erotic girl on girl scene. The stockings come off, the breasts revealed (all natural, nice) and toe sucking begins. The girls move as fast as melting ice, which may turn some away, but this series looks to aim at worship and admiration over orgasmic satisfaction. One gal gives a toe suck as long as the Gettysburg Address, focusing on the big toe as though it were a guy's rock hard stiffy. Then they play footsie with their partner's coochie. Mild toe insertions occur, but mostly it's heavy petting. As the scene closes the brunette gets sloppy on her lover's feet and soaks them in her oral endeavors. I've never seen such a slopping toe suck. And it brings a soft, easy scene to a hot climax. Who needs cumshots anyways?\n\n\nScene 5: Jordan Green \t\n\nActs Included: Oral, Footjob, Vag, Cumshot\nJordan Green is a decent looking lass. Her black stockings have little white butterflies on them, and this is hot, except her top matches so she looks like she's wearing a jumper of some sort. Once the hose come off, Jordan's precious piggies are revealed. Ten, manicured, red-painted toes that she puts to work wacking at her man's erection. The going gets tough, so they add a gallon of lube, turning his dick shiny and wet and much easier to stroke. Performing in missionary isn't going so well, so she switches into doggy and we see the bottoms of her feet as she does her thing. This hot position gives Jordan the opportunity to display her sweet snatch and she fondles it slowly while pumping his cock. Amazing closeups of her feet and toes rubbing against his wet cock. Viewers will be love the clean, close image Youngman provides in this scene. The guy fucks between her feet until he cums on her legs. A scene driven by the camera and Jordan's body, rather than the action, which is strong but not extraordinary.\n\n\nScene 6: Adrianna Russo \n\t\nActs Included: Oral, Footjob, Vag, Cumshot\nDamn those are some ugly leggings. Are they hose? boots? Pipe insulation? Well to each her own. Adrianna makes the best of her leopard printed stockings and matching (believe it) clear heels. A long over the clothes pet session takes up more time than is expected. It seems about ten minutes until she strips or even bares her feet. If you're trying to kill time, kill it with what we want (ahem, see scenes 1-4). A military looking thug walks into the room and begins eating her out through her stockings. Finally the boots come off to expose a cute pair of pearl-painted toes that work like claws grabbing at the dude's denim tent. Adrianna grasps his dick between her feet, leans forward and sucks him off. She continues with the oral but abandons the use of her feet, yet they never stray from the camera's lens. Adrianna gets bent over the couch and pounded doggy style, keeping her feet in the air and near the guy's hips so we can see them at all times. A clumsy reverse cowgirl turns into a much better spoon fuck, but doggy is where it's at and so they return to this position in the end. He fucks her from behind, pulls out and fucks her feet, repeating until he comes on her black stockings. Adrianna waves them for the camera, pulls them off and sucks on the fabric. Nice scene that started way too slowly making it seem out of place with the rest of the disc.\n\n\nConcluding Words: \n\nFootsie Babes 3 is almost as strong as its predecessor. There is nothing specifically wrong with this flick, and perhaps I'm a bit jaded after coming straight from &quot;Vol 2&quot;. which was a damn fine piece of work. Vol. 3 is far better than most foot flicks out there and each scene is packed with foot model, worship, and admiration. If you are looking for stomping or a foot-in-the-vag clip or like to see feet in bowls of spaghetti, you're not going to find it here. You're also not going to find hardcore pounding with the foot in the shot as an afterthought. Youngman takes his time with the camera and the scenes move slowly, deliberately giving attention to the beautiful women and their lower extremities. Although there are plenty of footjobs and a nice sample of oral and screwing, the focus is feet. For all three hours.\n\nThe only weakness I found in this movie was a sense of rushed production. Some scene didn't appear well planned and so some of the interaction was clumsy or unintentionally slow. And can't we find better shoes for these women? The shoes look like a third grader's art project. I know it's not the shoe that matters, it's what's inside, but wads of tinfoil looking shit on the feet of Jessica Alba are still going to be a distraction. Highly Recommended\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n.","torrent":{"xt":"urn:btih:16f4aa89c739688c237175f3ed66e4134f862cce","amp;dn":"Footsie+Babes+%23+3+%5B2007%2C+DVD.xvid%5D+-+foot%2Ffeet+fetish","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16f4aa89c739688c237175f3ed66e4134f862cce","infoHashBuffer":{"type":"Buffer","data":[22,244,170,137,199,57,104,140,35,113,117,243,237,102,228,19,79,134,44,206]},"announce":[],"urlList":[]}}