{"title":"Coast to Coast AM 2012.02.12 Mysterious Drownings, Nixon's Secr","uid":7029235,"size":54482654,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:17d78850f15d8f3299a0a6f47173ff3c240c858c&amp;dn=Coast+to+Coast+AM+2012.02.12+Mysterious+Drownings%2C+Nixon%5C%27s+Secr&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ViViDSOL","files":5,"time":1329174630,"description":"Coast to Coast AM 2012.02.12 Mysterious Drownings, Nixon's Secrets\n\nHost: \tIan Punnett\nGuests: Kristi Piehl, Don Fulsom, Ken Gerhard\n\nDuring the first half, Ian Punnett was joined by Emmy-award winning journalist, Kristi Piehl, who provided an update on the Smiley Face Killers and why she is now investigating mysterious drowning deaths. &quot;Happily retired&quot; from television journalism, Piehl explained that she now sees herself as an advocate for the victims' families rather than a reporter on the case. As such, she revealed that her study of police reports and work with forensic experts has led her to the conclusion that focusing on the graffiti found at the crime scene is a hindrance to solving these mysterious deaths. &quot;It really is a detriment and really is holding the investigation back,&quot; she lamented, since the graffiti appears to provide no tangible clues about the nature of the crime.\n\nWhile Piehl downplayed the graffiti sometimes connected to these deaths, she stressed that there is a very real phenomenon taking place where young men are drowning under mysterious circumstances. &quot;These drowning mysteries, they defy logic,&quot; she said, noting that the victims are being found fully clothed and still have their shoes and wallets. While Piehl conceded that one such death could be attributed to a demise by misadventure, the sheer number of similar cases demands closer scrutiny. &quot;When it happens 100 times over 10 years and it's just happening in the winter and it's just happening in certain states,&quot; she said, &quot;then you have to take a second look.&quot;\n\n-------------------------------------\n\nIn the second half, former White House correspondent, Don Fulsom, discussed Richard Nixon's connections to organized crime as well as the former president's demons, deceptions, paranoia, prejudices, and hatreds. He traced Nixon's mob connections all the way back to his first Congressional bid in 1946 which Fulsom claimed was backed by &quot;the top hoodlum in Los Angeles, Mickey Cohen.&quot; This underworld relationship culminated, Fulsom said, when Nixon accepted $300,000 from the Teamster's Union and, subsequently, granted clemency to Jimmy Hoffa, which released the union leader from prison five years early. &quot;He certainly did a lot of favors for the mob all the way through his political career,&quot; Fulsom contended.\n\nFulsom also detailed how Nixon had a number of personality quirks which ranged from sinister to bizarre. Some of the traits ascribed that Fulsom ascribed to the former president included a cold distance from his family, fits of rage where ashtrays would be throw at walls, and a lifelong penchant for breaking and entering that preceded the infamous Watergate incident. On Nixon's apparent inability to make small talk or connect with average people, Fulsom shared the story of how a member of the president's motorcade was in an accident and was lying on the ground in pain. Encouraged by his staff to talk to the injured officer, Nixon walked over to the man and simply asked &quot;how do you like the work?&quot;\n\nCryptid Videos\n\nIn the first half hour, monster hunter Ken Gerhard: \ncommented on recent stories about the Iceland lake monster: \n &lt;a href=&quot;\nhttp://www.huffingtonpost.com/2012/02/07/icelands-loch-ness-worm-monster_n_1260467.html#s272963&amp;title=BowNessie&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.huffingtonpost.com/2012/02/07/icelands-loch-ness-worm-monster_n_1260467.html#s272963&amp;title=BowNessie&lt;/a&gt; \nand woolly mammoth:\n &lt;a href=&quot;\nhttp://thehairpin.com/2012/02/woolly-mammoth-caught-on-tape-also-possibly-a-bear-or-shape-shifting-witch&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thehairpin.com/2012/02/woolly-mammoth-caught-on-tape-also-possibly-a-bear-or-shape-shifting-witch&lt;/a&gt; \n\nHe was critical of the 'lake monster' film because the alleged creature was moving vertically rather than horizontally, which contradicts the &quot;accepted model&quot; based on numerous eyewitness reports of sea cryptids. Regarding the woolly mammoth footage, Gerhard was suspicious because the color of the 'trunk' did not match the rest of the creature's body. &quot;As much I'd love to say it is a living mammoth,&quot; he chuckled, &quot;I feel safer saying its inconclusive.&quot;\n\nWebsite(s):\n &lt;a href=&quot;\nhttp://drowningmystery.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://drowningmystery.com&lt;/a&gt;\n     &lt;a href=&quot;\nhttp://american.edu/spa/faculty/fulsom.cfm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://american.edu/spa/faculty/fulsom.cfm&lt;/a&gt;\n\nBook(s):\n\nNixon's Darkest Secrets\n\t &lt;a href=&quot;\nhttp://www.amazon.com/Nixons-Darkest-Secrets-Americas-President/dp/0312662963/c2cam-20&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Nixons-Darkest-Secrets-Americas-President/dp/0312662963/c2cam-20&lt;/a&gt;\n    \nBig Bird! Modern Sightings of Flying Monsters\n\t &lt;a href=&quot;\nhttp://www.amazon.com/BIG-BIRD-MODERN-SIGHTINGS-MONSTERS/dp/1905723083/c2cam-20&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/BIG-BIRD-MODERN-SIGHTINGS-MONSTERS/dp/1905723083/c2cam-20&lt;/a&gt;\n\t\nBecome A Coast Insider:  &lt;a href=&quot;\nhttp://www.coasttocoastam.com/coastinsider&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.coasttocoastam.com/coastinsider&lt;/a&gt;\n","torrent":{"xt":"urn:btih:17d78850f15d8f3299a0a6f47173ff3c240c858c","amp;dn":"Coast+to+Coast+AM+2012.02.12+Mysterious+Drownings%2C+Nixon%5C%27s+Secr","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17d78850f15d8f3299a0a6f47173ff3c240c858c","infoHashBuffer":{"type":"Buffer","data":[23,215,136,80,241,93,143,50,153,160,166,244,113,115,255,60,36,12,133,140]},"announce":[],"urlList":[]}}