{"title":"Life.On.Mars.S02E08.DDTRip.ITA.[CR-Bt]","uid":4950003,"size":576610304,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:17d8f8e445e0b3c71c5ca0815027476ee7765d3e&amp;dn=Life.On.Mars.S02E08.DDTRip.ITA.%5BCR-Bt%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"edo123456","files":1,"time":1244841675,"description":"for more info visit http://colombo-reloaded.org\n\nLIFE ON MARS - STAGIONE 2 EPISODIO 8 STAGIONE COMPLETATA\n\n? il 1973 e vanno di moda pantaloni a zampa e capelloni, alla radio inglese suonano successi del glam-rock, Suzi Quatro, Gary Glitter, Slade. ? l'anno in cui David Bowie scala le classifiche con la hit Life on Mars. Sam Tyler ? un brillante giovane detective, risoluto e ambizioso, che nel 2005 ? alle prese con il crimine per le strade di Manchester. Due mondi molto lontani che improvvisamente vengono in contatto, con conseguenze drammatiche e ricche di suspense.\nDagli stessi autori di Hustle - I Signori della truffa e Spooks ed esportata all'estero in oltre 13 paesi, e vincitrice nel 2006 alla 34? edizione degli International Emmy? Awards nella categoria Drama e, nello stesso anno, anche di un BANFF World Television Award, Life on Mars ? una serie del crimine veloce e ricca di tensione, con una svolta inaspettata ed avvincente. Tra i suoi fan troviamo Paul McCartney che ha concesso entusiasta il singolo Live and Let Die per l'azzeccata colonna sonora.\n\nLa vita del detective Tyler ? improvvisamente sconvolta e messa sottosopra quando la caccia ad un sanguinario serial killer si trasforma per lui in una disperata missione di salvataggio della sua ragazza Maya, che ? anche la compagna poliziotta. Dopo un rocambolesco inseguimento, al risveglio dall'incidente stradale che quasi gli costa la vita, Sam ? misteriosamente catapultato indietro nel tempo, nel lontano 1973, paradossalmente solo quattro anni dopo la sua nascita.\nSconvolto dall'accaduto e confuso dall'ambiente antiquato che lo circonda, Sam impazientemente inizia un disperato tentativo di ritornare al presente. Non riesce a capire se sia tutto un sogno, un delirio o qualcosa di paranormale ma la vita attorno a lui continua ad andare avanti. Comincia a guardarsi attorno alla ricerca di un punto di riferimento ma tutto quello che vede non fa altro che confermargli che si trova nel passato. Si muove come un pesce fuor d'acqua nella vecchia e antiquata stazione di polizia e i suoi ''colleghi'' lo guardano come se fosse un pazzo. In breve per? Sam ritrova la sua freddezza e, senza tecnologia di alcun tipo a disposizione, recupera anche il suo istinto. Comincia con convinzione a dare una mano ai suoi nuovi colleghi e trova immediatamente un caso di efferati omicidi sul quale lavorare che, in modo certo, lo lega al suo futuro. Ed ? l'unico a saperne veramente il motivo.\nPur seguendo il filo della vita di Sam, ogni episodio di Life on Mars ? incentrato su un caso diverso da risolvere. Il poliziotto incontra notevoli difficolt? ad adeguarsi ad un ambiente viziato da procedure investigative lente ed antiquate, non sempre legittime. ? un mondo dove tutto si sviluppa nella totale assenza di computer, cellulari, database tecnologici, dove la medicina legale si muove ancora con grande lentezza e i testimoni sono regolarmente intimiditi. Sam ? inorridito dal fatto che i suoi colleghi arrestino i sospettati anche senza l'evidenza del fatto ma fa del suo meglio per adattarsi e comincia a capire che il suo istinto e la sua conoscenza pi? moderna delle tecniche investigative pu? aiutarlo ad uscire dal suo dramma personale.\nPerfettamente ricostruita nelle ambientazioni e nei costumi fin nei minimi particolari, comprese le bellissime macchine dell'epoca (come una favolosa Cortina Mk III GXL), Life on Mars ? stata definita dai suoi creatori non come un viaggio nostalgico negli anni '70 ma come uno sguardo compiaciuto alla vera vita di un'epoca piena di importanti cambiamenti civili e sociali, durante la quale accaddero molte cose importanti non solo a Manchester e in Inghilterra ma anche e soprattutto nel mondo.\n\nEPISODIO 8/8\n\nNome: Life.On.Mars.S02E01.DDTRip.ITA.[CR-Bt].avi\nData: 26/04/2009 19:29:38\nDimensione: 574,949,376 bytes (548.314 MB)\n\n[ Info generiche ]\n\nDurata: 00:52:00 (3120 s)\nTipo di contenitore: AVI OpenDML\nStreams totali: 2\nTipo stream n. 0: video\nTipo stream n. 1: audio\nAudio streams: 1\nISFT: VirtualDubMod 1.5.10.2 (build 2540/release)\nIAS1: ???\nJUNK: VirtualDubMod build 2540/release\n\n[ Dati rilevanti ]\n\nRisoluzione: 720 x 544\nLarghezza: multipla di 16\nAltezza: multipla di 32\n\n[ Traccia video ]\n\nFourCC: xvid/XVID\nRisoluzione: 720 x 544\nFrame aspect ratio: 45:34 = 1.323529 (~4:3)\nPixel aspect ratio: 1:1 = 1\nDisplay aspect ratio: 45:34 = 1.323529 (~4:3)\nFramerate: 25 fps\nFrames totali: 78000\nStream size: 506,698,404 bytes\nBitrate: 1299.226676 kbps\nQf: 0.132682\nKey frames: 1030 (0; 9; 186; 209; 210; ... 77792)\nNull frames: 0\nMin key int: 1\nMax key int: 250\nKey int medio: 75.728155\nRitardo: 0 ms\n\n[ Traccia audio ]\n\nAudio tag: 0x55 (MP3)\nBitrate (contenitore): 162.056 kbps VBR\nCanali (contenitore): 2\nFrequenza (contenitore): 48000 Hz\nChunks: 129986\nStream size: 63,208,752 bytes\nPreload: 504 ms\nMax A/V diff: 520 ms\nTipo: MPEG-1 Layer III\nChunk-aligned: S?\nEmphasis: none\nMode: joint stereo\nRitardo: 0 ms\n\n[ Info sulla codifica MPEG4 ]\n\nUser data: XviD0034\nQPel: No\nGMC: No\nInterlaced: No\nAspect ratio: Square pixels\nQuant type: MPEG custom (*)\nCustom intra quant matrix:\n8 16 16 16 17 18 21 24\n16 16 16 16 17 19 22 25\n16 16 17 18 20 22 25 29\n16 16 18 21 24 27 31 36\n17 17 20 24 30 35 41 47\n18 19 22 27 35 44 54 65\n21 22 25 31 41 54 70 88\n24 25 29 36 47 65 88 115\nCustom inter quant matrix:\n19 19 19 19 20 22 25 29\n19 19 19 19 20 23 26 30\n19 19 20 21 23 26 29 34\n19 19 21 25 28 32 37 42\n20 20 23 28 35 42 48 56\n22 23 26 32 42 53 64 77\n25 25 29 37 48 64 83 104\n29 30 34 42 56 77 104 137\n\n[ Profile compliancy ]\n\nProfilo da testare: MTK PAL 6000\nRisoluzione: Ok\nFramerate: Ok ","torrent":{"xt":"urn:btih:17d8f8e445e0b3c71c5ca0815027476ee7765d3e","amp;dn":"Life.On.Mars.S02E08.DDTRip.ITA.%5BCR-Bt%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17d8f8e445e0b3c71c5ca0815027476ee7765d3e","infoHashBuffer":{"type":"Buffer","data":[23,216,248,228,69,224,179,199,28,92,160,129,80,39,71,110,231,118,93,62]},"announce":[],"urlList":[]}}