{"title":"VirtualDub 1.8.6 with 41 Filters and Tutorial[h33t][mattlb0619]","uid":4586995,"size":9243990,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:1807e7dcebb850386f6679c3dcc0c9865509b983&amp;dn=VirtualDub+1.8.6+with+41+Filters+and+Tutorial%5Bh33t%5D%5Bmattlb0619%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mattlb0619","files":47,"time":1229669301,"description":"No Installation of VirtualDub is needed. Just extract into the folder that you want and run virtualdub.exe. (more info on virtualdub can be found in 'virtualdub readme.txt)\n\nYou will need to install the filters that you need though. View 'filter readme.txt' for more info.\n\nIf you need some 'tutoring' on how to use the software, view the PDF 'Learning VideoDub.pdf'.\n\nThis is freeware. This is just a compilation of filters and a tutorial on how to use it. Everything to my knowledge are the latest versions. (Oct. 10, 2008)\n\n\n\n\nGet support at http://forums.virtualdub.org/.\n\n\nVirtualDub features\n\n\nHave you ever worked with desktop video?\n\nSure, you've probably played a few video clips on your monitor.  But have you ever made one yourself?  Used a video capture device?  Wrestled with the software that comes with it?  Felt like the software is a few leagues above or below your level?  Time to try something else.\n\nVirtualDub helps you get video into your computer.\nIf your capture device is Video for Windows compatible, then VirtualDub can capture video with it.  But VirtualDub isn't your average capture program:\n\nFractional frame rates.  Don't settle for 29 or 30 when you want 29.97. \nOptimized disk access for more consistent hard disk usage. \nCreate AVI2 (OpenDML) files to break the AVI 2GB barrier and multiple files to break the FAT32 4GB limit. \nIntegrated volume meter and histogram for input level monitoring. \nReal-time downsizing, noise reduction, and field swapping. \nVerbose monitoring, including compression levels, CPU usage, and free disk space. \nAccess hidden video formats your capture card may support but not have a setting for, such as 352x480. \nKeyboard and mouse shortcuts for faster operation.  To capture, just hit F6. \nClean interface layout: caption, menu bar, info panel, status bar.\nVirtualDub lets you clean up video on your computer.\nThere are lots of programs that let you &quot;edit&quot; video.  And yet, they're frustratingly complex for some of the simplest tasks.  VirtualDub isn't an editor application; it's a pre- and post-processor that works as a valuable companion to one:\n\nReads and writes AVI2 (OpenDML) and multi-segment AVI clips. \nIntegrated MPEG-1 and Motion-JPEG decoders. \nRemove and replace audio tracks without touching the video. \nExtensive video filter set, including blur, sharpen, emboss, smooth, 3x3 convolution, flip, resize rotate, brightness/contrast, levels, deinterlace, and threshold. \nBilinear and bicubic resampling -- no blocky resizes or rotates here. \nDecompress and recompress both audio and video. \nRemove segments of a video clip and save the rest, without recompressing. \nAdjust frame rate, decimate frames, and 3:2 pulldown removal. \nPreview the results, with live audio.\nYou can take a captured clip, trim the ends, clean up some of the noise, convert it to the proper frame size, and write out a better one.  Don't see a video filter you want?  Write your own, with the filter SDK.\n\nVirtualDub is fast.\n\nThe author of VirtualDub is very impatient.  That means his program is designed for speed, both in the interface and in the processing pipeline.  Converting a compressed, 320x240 MPEG-1 file to an uncompressed, 24-bit AVI requires only these two steps in VirtualDub:\n\nOpen video file (Ctrl-O). \nSave AVI (F7).\n\nHow fast is this operation?  On a C450, 40 frames per second (1.3x real-time speed).  With a little tweaking, the speed rises to 55 fps (1.8x), with the CPU hardly breaking a sweat at 40%.\n\nVirtualDub is cheap.\n\nTo be exact, it costs nothing.  VirtualDub is licensed under the GNU General Public License, meaning you can use it for free. No risk involved, and the whole source code is available if you want it.\n\n\n\nInfo on installing filters at bottom.\n\nList of the 41 Filters:\n\nSubtitler Filter for VirtualDub\nWarp Sharpen Filter for VirtualDub\nBrightness/Contrast (UI Enhanced) Filter for VirtualDub\nBox Blur Filter (Original by Avery Lee) \nColorize Filter for VirtualDub\nDecimate Filter for VirtualDub\nDeflicker Filter for VirtualDub\nHistogram Equalization Filter for VirtualDub\nHotspot Filter for VirtualDub\nHue/Saturation/Intensity Filter for VirtualDub\nLogo Filter for VirtualDub\nMSharpen Filter for VirtualDub\nPan Filter for VirtualDub\nPseudocolor Filter for VirtualDub\nRed/Green/Blue Adjustment Filter for VirtualDub\nReverse Field Dominance Filter for VirtualDub\nSmart Bob Filter for VirtualDub\nSmart Deinterlacer Filter for VirtualDub\nSmart Resize Filter for VirtualDub\nSmart Smoother Filter for VirtualDub\nTelecide Filter for VirtualDub\nTint Filter for VirtualDub\nUnsharp Mask Filter for VirtualDub\nWindowed Histogram Equalization Filter for VirtualDub\nXsharpen Filter for VirtualDub\nZoom Filter for VirtualDub\nOptimized 2D Cleaner\nChannel Mixer Filter \nCoring Filter for VirtualDub\nDeLogo Filter for VirtualDub\nDenoise Filter\nEnd of Processing Sound Alarm for VirtualDub \nExotic Fade Filter \nflaXen Cartoon Filter 1.0 \nflaXen VHS Filter 1.0 \nSmart Smoother High Quality\nImage Layering Filter \nMotion Filter\nNoise Reduction Suite (NRS) Filter for VirtualDub\nShutDown Filter for VirtualDub\nWhite Balance Filter\n\n\n\n\nFilter How-To \n\nFollowing is a step-by-step procedure for using the filters. \n\n1. First ensure that the filter .vdf file is present in a directory called &quot;plugins&quot; that exists in the same directory as the VirtualDub executable. \n\n2. Start up VirtualDub and maximize its window. \n\n3. Select File/Open video file from the pulldown menus and then open your input video file. \n\n4. Select Video/Filters from the pulldown menus. \n\n5. Click on the Add button in the Filters dialog box. \n\n6. Scroll down in the filter list and highlight the desired filter by clicking on it. \n\n7. Click OK. The configuration dialog for the filter appears. \n\n8. Configure the filter as desired. If the filter supports preview, you can interactively explore the effect of different filter settings. When you are happy with the settings, click OK in the filter configuration dialog box. \n\n9. Click OK in the Filters dialog box. \n\n10. Select Video/Compression from the pulldown menus. \n\n11. Highlight the desired compression for the output file and then click OK. \n\n12. Select File/Save As from the pulldown menus and select the desired output file. Processing will begin and when it is completed, the output file will contain the filtered video. (Alternatively, you can simply preview the result by using VirtualDub's timeline player.) \n \n","torrent":{"xt":"urn:btih:1807e7dcebb850386f6679c3dcc0c9865509b983","amp;dn":"VirtualDub+1.8.6+with+41+Filters+and+Tutorial%5Bh33t%5D%5Bmattlb0619%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1807e7dcebb850386f6679c3dcc0c9865509b983","infoHashBuffer":{"type":"Buffer","data":[24,7,231,220,235,184,80,56,111,102,121,195,220,192,201,134,85,9,185,131]},"announce":[],"urlList":[]}}