{"title":"Jeanne d_'Arc PAL DVD9 Untouched","uid":5017842,"size":7749567096,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:1874d9347a73c75c385e6f012908beaf03141853&amp;dn=Jeanne+d_%5C%27Arc+PAL+DVD9+Untouched&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"spotted_jackal","files":-1,"time":1248306226,"description":"Country: France\n\nYear: 1999\n\nGenre: Biography, Drama, History, War\n\nFormat: DVD9\n\nVideo: PAL 16:9 (720x576) VBR, Auto Pan&amp;Scan\n\nAudio: English DD 5.1, German DD 5.1\n\nSubtitles: Bulgarian, English, German, Nederlands, Arabic, Hrvatski, Czech, Dansk, Suomi, Greek, Hebrew, Hindi, Hungarian, Islenska, Norsk, Polish, Svenska, Turkish\n\nSize: 7.22 Gb\n\nRuntime: 151 min \n\n\n\nDirector: Luc Besson\n\nWriters: Luc Besson, Andrew Birkin\n\nCast: Milla Jovovich, John Malkovich, Faye Dunaway, Dustin Hoffman, Pascal Greggory, TchÃƒÂ©ky Karyo, Vincent Cassel\n\n\n\n\n\nSummary: In 1412, a young girl called Jeanne is born in DomrÃƒÂ©my, France. The times are hard: The Hunderd Years war with England has been going on since 1337, English knights and soldiers roam the country. Jeanne develops into a very religious young woman, she confesses several times a day. At the age of 13, she has her first vision and finds a sword. When coming home with it, she finds the English leveling her home town. Years after that, in 1428, she knows her mission is to be ridding France of the English and so sets out to meet Charles, the Dauphin. In his desperate military situation, he welcomes all help and gives the maiden a chance to prove her divine mission. After the successful liberation of OrlÃƒÂ©ans and Reims, the Dauphin can be crowned traditionally in the cathedral of Reims - and does not need her anymore, since his wishes are satisfied. Jeanne d'Arc gets set up in his trap and is imprisoned by the Burgundians. In a trial against her under English law, she can't be forced to tell about her divine visions she has had continuously since childhood. Being condemned of witchcraft and being considered as relapsed heretic, she is sentenced to death. Jeanne d'Arc is burnt alive in the marketplace of Rouen on May 30th, 1431, at only 19 years of age.\n\n\n\n","torrent":{"xt":"urn:btih:1874d9347a73c75c385e6f012908beaf03141853","amp;dn":"Jeanne+d_%5C%27Arc+PAL+DVD9+Untouched","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1874d9347a73c75c385e6f012908beaf03141853","infoHashBuffer":{"type":"Buffer","data":[24,116,217,52,122,115,199,92,56,94,111,1,41,8,190,175,3,20,24,83]},"announce":[],"urlList":[]}}