{"title":"Barry Coopers Never Get Busted","uid":4088826,"size":732762112,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:19a265ed7c8fbe3a185fe445942673a366f4bd48&amp;dn=Barry+Coopers+Never+Get+Busted&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"monoxide420666","files":1,"time":1205961437,"description":" Even innocent people go to jail!\nOur country has a history of aggressively pursuing and placing innocent people in jail and considering them criminals because they broke a current law that was later proven to be unjustified. For example, it use to be against the law for a slave to escape and the punishment was extremely harsh. In 1955 Rosa Parks was arrested for refusing to sit in the back of a bus. Only 70 years ago, a citizen was considered a criminal if he/she possessed an alcoholic beverage (alcohol prohibition 1920-1933) and would be placed in jail. Our country use to deny women the right to vote. Fortunately, America decided to change these laws and stop classifying those who broke them as criminals.\n\nThe docile marijuana users of this nation are not criminals either just as those mentioned above were not criminals. Unfortunately 830,000 citizens are jailed each year (2006) for violating unjustified marijuana laws. This could happen to you and if it does, you will have to spend time in jail with violent criminals, pay a large bond and hire a lawyer hoping you are not sentenced to a lengthy prison term. Many people will consider you a criminal which is very embarrassing and can be very damaging to your reputation. All of this can be avoided by knowing your rights, avoiding suspicious activities and understanding how the police think. &quot;There&amp;#039;s definitely some useful information in here (DVD), and I found it to be a fascinating insight into police thinking about drug interdiction tactics.&quot; --MarkDraughn, Blogger, windypundit.com\n\nMaybe you&amp;#039;re in possession and don&amp;#039;t know it\n\nDo you have friends that might use or possess illegal substances? If your friend accidentally leaves a marijuana seed in your car and the police find it in a search, YOU CAN BE ARRESTED! If you or someone you know drops a prescription medication in your car and an officer finds it, YOU CAN BE ARRESTED! Can you always be sure you are not in possession? Understanding police tactics and narcotics profiling will save you hassles and jail time from somebody else&amp;#039;s mistakes.\n\nIf you Get arrested for ANY reason:\n\n    * You will be handcuffed\n    * You will be placed in the back of a police cruiser and transported to jail\n    * You will be processed in jail (strip searched, photographed, fingerprinted)\n    * You will be placed in a holding cell usually with drunks\n    * You will be separated from friends &amp; family\n    * You will be required to post bond, even if you&amp;#039;re innocent\n    * You will need to hire an attorney\n    * You will go to trial\n    * You will serve punishment if found guilty\n    * You will have an arrest placed permanently on your criminal record\n\nIf a court decides you&amp;#039;re guilty you may:\n\n    * Spend thousands of dollars in fines and court fees\n    * Serve years of probation\n    * Spend more time in jail\n    * Lose your drivers license\n    * Be disqualified from receiving a scholarship\n    * Have trouble finding a good job\n    * Be restricted from leaving the country or even your county\n    * Lose your right to vote\n\nNever Get Busted Again Can Help:\nBy knowing your rights, avoiding suspicious behavior and understanding police mentality and tactics, you can stay out of jail and avoid stressful and dangerous police encounters. This one of a kind DVD will teach you all of the following:\n\n    * Secret drug enforcement tactics\n    * How to avoid narcotics profiling\n    * How to conceal your stash\n    * If coffee grounds really work\n    * How police officers cause K9s to false alert\n    * Valuable search &amp; seizure law\n    * How police officers can tell when you&amp;#039;re lying\n    * Mistakes made by marijuana violators by analyzing actual marijuana arrests\n    * Police attitudes, hidden thoughts and motives\n\nGet information straight from the source\n\nTraffic Stops Volume 1 has recently received global attention by being reported in over 300 newspapers and magazines across the world including an exclusive front page story in the Dallas Observer and Houston Press. The DVD features Barry Cooper who has been a guest on numerous radio and television programs including MSNBC Tucker Carlson, FOX Geraldo At Large, ABC I Caught, The Adam Corolla Radio Show, NBC Mike and Juliet Morning Show and the syndicated Todd and Tyler Radio Show. Barry currently gives a tip of the week on Playboy Radio and was recently featured on the front cover of Cannabis Culture Magazine. He has also appeared in Rolling Stones Magazine, Radar Magazine and Don Diva Magazine.\n\nBarry was a police officer in Texas focusing on narcotics interdiction for eight years. With over 800 felony and misdemeanor narcotics arrests, DEA training, and extensive experience with k-9s (drug dogs), he has the expertise to teach you exactly what you need to know to stay out of jail. &quot;He was even better than he says he was. He had a knack for finding drugs and made more arrests and more seizures than all of the other agents combined. He was probably the best narcotics officer in the state and maybe the country during his time with the task force.&quot; --Tom Finley, Commander Permian Basin Drug Task Force. Much of this information has never been seen by the public before, and this is the first time it has all been available from a single source. Barry&amp;#039;s friendly, plain spoken and honest attitude makes it easy and entertaining for you to learn what you need to know to Never Get Busted Again. &quot;Barry Cooper is fun to watch. When he&amp;#039;s talking about claims that drug dealers sell to children, just his face and the tone of his voice as he says &quot; that&amp;#039;s BULLcrap&quot; makes me smile everytime.&quot; --Mark Draughn, Blogger","torrent":{"xt":"urn:btih:19a265ed7c8fbe3a185fe445942673a366f4bd48","amp;dn":"Barry+Coopers+Never+Get+Busted","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"19a265ed7c8fbe3a185fe445942673a366f4bd48","infoHashBuffer":{"type":"Buffer","data":[25,162,101,237,124,143,190,58,24,95,228,69,148,38,115,163,102,244,189,72]},"announce":[],"urlList":[]}}