{"title":"Jordan Castillo Price PsyCop Books 1 and 2","uid":11455226,"size":218258407,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:19e4a7918926d2905b6c124900b68f884f7f5b1b&amp;dn=Jordan+Castillo+Price+PsyCop+Books+1+and+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"katelynor","files":3,"time":1415929210,"description":"Among the Living (novella -2 hrs and 59 mins)\n\nVictor Bayne, the psychic half a PsyCop team, is a gay medium who's more concerned with flying under the radar than in making waves.\n\nHe hooks up with handsome Jacob Marks, a non-psychic (or &quot;Stiff&quot;) from an adjacent precinct at his ex-partner's retirement party, and it seems like his dubious luck has taken a turn for the better. But then a serial killer surfaces who can change his appearance to match any witness' idea of the world's hottest guy.\n\nSolving murders is a snap when you can ask the victims whodunit, but this killer's not leaving any spirits behind.\n\nWarning: This audiobook contains explicit adult content.\n\n\nCriss Cross (4 hrs and 9 mins) \n\nCriss Cross finds the ghosts surrounding Victor getting awfully pushy. The medications that Victor usually takes to control his abilities are threatening to destroy his liver, and his new meds aren't any more effective than sugar pills.\n\nVic is also adjusting to a new PsyCop partner, a mild-mannered guy named Roger with all the personality of white bread. At least he's willing to spring for the Starbucks.\n\nJacob's ex-boyfriend, Crash, is an empathic healer who might be able to help Victor pull his powers into balance, but he seems more interested in getting into Victor's pants than in providing any actual assistance","torrent":{"xt":"urn:btih:19e4a7918926d2905b6c124900b68f884f7f5b1b","amp;dn":"Jordan+Castillo+Price+PsyCop+Books+1+and+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"19e4a7918926d2905b6c124900b68f884f7f5b1b","infoHashBuffer":{"type":"Buffer","data":[25,228,167,145,137,38,210,144,91,108,18,73,0,182,143,136,79,127,91,27]},"announce":[],"urlList":[]}}