{"title":"My Reputation (1946) Xvid 1cd - A Barbara Stanwyck Film  [DDR]","uid":9244150,"size":847281442,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:19f0d3268da7ed7d3eaada3912de51d68789053c&amp;dn=My+Reputation+%281946%29+Xvid+1cd+-+A+Barbara+Stanwyck+Film++%5BDDR%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"SaM","files":-1,"time":1385344288,"description":"My Reputation (1946) Xvid 1cd - A Barbara Stanwyck Film  [DDR]\n\nMy Reputation is a 1946 wartime love story, directed by Curtis Bernhardt. Barbara Stanwyck portrayed Jessica Drummond, an upper-class widow from Chicago who innocently falls in love with an army officer (George Brent), much to the consternation of her gossipy friends and domineering mother (Lucile Watson). Her romance also pits her against her two teenage sons (Scotty Beckett and Bobby Cooper). This film was an adaptation from Clare Jaynes' 1942 novel Instruct My Sorrows by screenwriter and novelist Catherine Turney.\n\nThe film was made in 1944, on the heels of Stanwyck's great success, Double Indemnity, but was not released in the US until 1946. It was released to members of the Armed Forces first.\n\n    CAST:-\n    Barbara Stanwyck as Jessica Drummond\n    George Brent as Maj. Scott Landis\n    Warner Anderson as Frank Everett\n    Lucile Watson as Mrs. Mary Kimball\n    John Ridgely as Cary Abbott\n    Eve Arden as Ginna Abbott\n    Jerome Cowan as George Van Orman\n    Esther Dale as Anna\n    Scotty Beckett as Kim Drummond\n    Bobby Cooper as Keith Drummond\n    Leona Maricle as Riette Van Orman\n    Mary Servoss as Mary\n    Cecil Cunningham as Mrs. Stella Thompson\n    Janis Wilson as Penny Boardman\n    Ann E. Todd as Gretchen Van Orman\n\n    Directed by Curtis Bernhardt\n    Produced by Jack L. Warner, Henry Blanke\n    Written by Clare Jaynes (novel)\n    Music by Max Steriner\n\nMOVIE REVIEW:- My Reputation (1946)\nWhen her beloved husband dies after a long illness, Jessica Drummond (Barbara Stanwyck) is comforted by the executor of her husband's estate, lawyer Frank Everett (Warner Anderson), who's been a family friend for years and, later, shows an interest in dating &quot;Jess&quot;. Her mother (Lucile Watson) has worn black for decades, since her husband passed, and would love for her daughter to follow her example. Jess has two young boys: Kim (Scotty Beckett), who is fourteen, and Keith (Bobby Cooper), who's twelve. Both go off to school leaving their newly widowed mother at home alone to deal with her loneliness. She tries to reconnect with the &quot;old gang&quot; that she and her husband socialized with while he was alive, but finds they remind her too much of him. She's even accosted by one of them, George Van Orman (Jerome Cowan), when he brings her home one night. Fortunately, she has a real friend in Gina Abbott (Eve Arden), whom she runs to, and stays with, the night she was accosted. Gina and her husband Cary (John Ridgely) invite Jess to spend a week's vacation at Lake Tahoe with them.\n\nWhen Jess finds herself lost somewhere on the slopes with a broken ski, she meets Major Scott Landis (George Brent). He helps her back to the Abbott's lodge where she introduces them to Scott. After an evening of socializing, he spends the night downstairs on the sofa. That week, Jess and Scott get to know each other better, but she spurns his advances. Given her conservative upbringing, she accuses him of spoiling their good time, and she directs him to leave without an appropriate goodbye or discussion about any future.\n\nBack in Lake Forest, just outside Chicago, Jess finds herself alone again except for her longtime housekeeper &amp; cook Anna (Esther Dale). Frank comes to call and is invited to join them for dinner. However, just then the phone rings and it's Gina, who tells Jess than she and Cary are out at a club where they've spotted Major Landis. So, Jess asks Frank if they can go out instead of eating at home, and then goes to get all dressed up. Once at the club, Jess initiates bumping into Scott and finds out that he's been stationed in Chicago before he gets his orders for overseas, which could come at any time but refrains from telling Jess.\n\nAnother day, Scott asks Jess to meet him at his apartment before going out to dinner. A friend of Jess's mother, Stella Thompson (Cecil Cunningham) sees Jess enter the Major's apartment, which later she evidently spreads as gossip. Of course, this becomes a subject of discussion among Jess's (and her former husband's) social friends, including Riette Van Orman (Leona Maricle), the lecherous George's wife, and eventually their children. In fact, upon returning for the holidays, Kim &amp; Keith learn of their mother's &quot;affairs&quot; at the Van Orman's daughter Gretchen's (Ann Todd) party. There is a priceless scene in which Jess's mother confronts Scott on Christmas Eve while everyone, including Frank and the Abbotts, are busy trimming the tree. All the while, however, Jess's relationship with Scott could best be described as platonic, though Jess has begun to return some of Scott's affections for her, initially out of spite for the rumor mill. She later confronts it head-on, in the person of Ms. Van Orman at the New Year's Eve party hosted at her residence. Behind closed doors and at Jess' insistence to know the source of the rumors, Ms. Van Orman expresses her distaste of Jess' behavior and tells her she is acting inappropriately. Jess confidently tells her that she is doing nothing wrong and that while people may judge her outward appearance, she will not be deterred by it. She leaves the party with Scott to return home.\n\nBack at Jess' house, she and Scott share a drink to celebrate the New Year. In a moment of affection in which Jess tells Scott she loves him, he abruptly tells her that it will not work out as he has orders to be in New York tomorrow to await his next appointment which could end up being anywhere overseas. This does not deter Jess and she tells him that she will leave with him to New York so they may spend as much time together before he receives his new station. They agree to meet at the train platform the following morning at 7 o'clock. After parting and on the way to her room to pack, Kim and Keith meet her in the hallway, asking her if she is really leaving for New York. She affirms that she is, and though apologizing for leaving during their break from school, excitedly prepares her luggage for the trip.\n\nIn the early morning hours of the next day as she goes to her sons' room to say goodbye, a horrified Jess turns on the lights to see their beds are empty. She gets a call from her mother that states her sons have gone to her house. Arriving and meeting her sons in the study, they have a genuine conversation about the logic of Jess' actions, her remaining feelings for her recently deceased husband, and how Jess has been able to cope with her loss with the help of Scott. She pleads with her sons to understand that she has been incredibly lonely and that meeting Scott has helped her deal with her grief and though she had great love for her husband and he will always hold a place in her heart, she has room to love another. Keith embraces her and expresses that even though he doesn't understand, he just wants her to be happy. They leave reunited to return home as Jess sadly sees the time she and Scott agreed to meet is soon approaching.\n\nAt 7 o'clock as scheduled, Jess runs down the train platform searching for Scott. She hurriedly tells him she cannot come with him as her sons are too young to understand her need to leave. Scott, who once believed he was not the type to marry, now tells her that he knows he is meant to be with her and asks her to wait for his return. They share a happy departure with the promise of reuniting one day to be together, and she bids him farewell as the train, full of young military men, all bid her a warm goodbye\n\nTECHNICAL SPECIFICATIONS\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 855 kbps\nVideo Resolution: 640x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 23.976\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages: English\nRunTime 1:34:00\nSubtitles: None\nRipped by: Trinidad [DDR]\nDuration: 1:34:0","torrent":{"xt":"urn:btih:19f0d3268da7ed7d3eaada3912de51d68789053c","amp;dn":"My+Reputation+%281946%29+Xvid+1cd+-+A+Barbara+Stanwyck+Film++%5BDDR%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"19f0d3268da7ed7d3eaada3912de51d68789053c","infoHashBuffer":{"type":"Buffer","data":[25,240,211,38,141,167,237,125,62,170,218,57,18,222,81,214,135,137,5,60]},"announce":[],"urlList":[]}}