{"title":"Economist Intelligence Unit Reports 2011-2013","uid":9220084,"size":491418615,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1bc7e1a3ad6d4475aae7c569aaa5b902ed8fb662&amp;dn=Economist+Intelligence+Unit+Reports+2011-2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sidmal","files":-1,"time":1384919733,"description":"The Economist Intelligence Unit (The EIU) is an independent business within The Economist Group.[1]\n\nThrough research and analysis, The EIU offers forecasting and advisory services to its clients. It provides country, industry and management analysis worldwide and incorporates the former Business International Corporation, a U.K. company acquired by the parent organization in 1986. It is particularly well known for its monthly country reports, five-year country economic forecasts, country risk service reports, and industry reports. The company also specialises in tailored research for companies that require analysis for particular markets or business sectors. 2006 marked the 60th anniversary of The Economist Intelligence Unit's inception.\n\nThe Economist Intelligence Unit also produces regular reports on &quot;liveability&quot; and cost of living of the world's major cities, which receive wide coverage in international news sources[which?]. The Economist Intelligence Unit's Quality-of-Life Index is another noted report[according to whom?].\n\nIts current Managing Director is Robin Bew, formally the company's Editorial Director &amp; Chief Economist\n\n\nThis is a compilation of most available reports by the Economist Intelligence Unit dating 2011-2013","torrent":{"xt":"urn:btih:1bc7e1a3ad6d4475aae7c569aaa5b902ed8fb662","amp;dn":"Economist+Intelligence+Unit+Reports+2011-2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1bc7e1a3ad6d4475aae7c569aaa5b902ed8fb662","infoHashBuffer":{"type":"Buffer","data":[27,199,225,163,173,109,68,117,170,231,197,105,170,165,185,2,237,143,182,98]},"announce":[],"urlList":[]}}