{"title":"Garmin Mapsource Caribbean and Bermuda Homemade Topo and POI map","uid":3601144,"size":236139766,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:1c817a013131d6cb57dfcd9451610efc1618c94e&amp;dn=Garmin+Mapsource+Caribbean+and+Bermuda+Homemade+Topo+and+POI+map&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SunyJim","files":1,"time":1169449279,"description":"Found these online UNLOCKED HOMEMADE TOPO Roads and POI Maps for Bermuda and The Caribbean. That work with Garmin Mapsource and Garmin GPSr units.\nUnfortunately they don&amp;#039;t have routeable info on them yet but it&amp;#039;s some amazing work.\nCheck out http://rwsmaps.griffel.se/ for more info on how the maps were made and other maps available. And if you get a chance to use the maps show the maker some love with a postcard or a donation for his work.\n\n__________________________________________________________________________________\n\nThe maps cover from 7 to 27.66 degrees North and 59 to 90 degrees West. The non-island land masses are included mainly for reference. The entire coverage area has at a minimum the same level of road detail as Garmin&amp;#039;s basemap or Worldmap. This data is from NIMA&amp;#039;s VMAP0 database. Some other areas such as parts of Central America, parts of South America, Aruba, Bonaire, and Curacao have data from NIMA&amp;#039;s VMAP1 database. This database is much more detailed than the VMAP0 data, but it is still far from residential street level detail. The area from 18 to 27.66 degrees North and 59 to 90 degrees West also has some general nautical data from the NGA Digital Nautical Charts (DNC&amp;#039;s), however my maps should NOT be used for marine navigation. The topographic contours are at 5 meter intervals and were generated from raw SRTM data (unless otherwise noted), all contours 15 meters and below were filtered out to save quite a bit of manual work getting rid of all the contours from the waves. The coastline data that I used is a little off in most places, I did use the correct datum &amp; projection for the data. I will clean up the coastline data for an island when I add the other detail for that island.\n\nSeperate install map for the country of Bermuda, with topo, roads and poi detail\n\n\nDonations:\n\nIf you would like to make a donation to support my work on this project please go to http://rwsmaps.griffel.se/ and look for the paypal button.\n\nOr send checks, money orders, airline tickets etc. to:\n  Richard W. Smith\n  4416 Still Pines Dr.\n  Raleigh, NC  27613\n\nA postcard from the Caribbean would also be appreciated.","torrent":{"xt":"urn:btih:1c817a013131d6cb57dfcd9451610efc1618c94e","amp;dn":"Garmin+Mapsource+Caribbean+and+Bermuda+Homemade+Topo+and+POI+map","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c817a013131d6cb57dfcd9451610efc1618c94e","infoHashBuffer":{"type":"Buffer","data":[28,129,122,1,49,49,214,203,87,223,205,148,81,97,14,252,22,24,201,78]},"announce":[],"urlList":[]}}