{"title":"Phoenix Journals - God Truth Earth Humans Ascension 2012 And Bey","uid":4483834,"size":1504022315,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1d0139ac07135d607c829ec5def3b04d0346c119&amp;dn=Phoenix+Journals+-+God+Truth+Earth+Humans+Ascension+2012+And+Bey&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"5bux","files":13,"time":1225677889,"description":"Phoenix Journals - over 200 files with information about our time on Earth leading up to 2012 and beyond, and why we must choose the light over the dark.\n\nThese journals will be the most important information you will ever be presented with. If you are seeking the TRUTH you have arrived at the right place at the right time. It is now time us humans took responsibility for our actions and make an effort to really understand what is going on, and the battle for control of man and his mind. If we care for ourselves, our families and our beautiful home Earth, we must take action now before it is too late.\n\n&quot;These Journals are the words of Truth which God promised he would send forth at the endtimes to give man one last chance to choose Truth over the Lie. &quot;The PHOENIX JOURNALS are directed and given forth from the higher brotherhood sent forth as the Hosts for the preparation of this time of cycles when this civilization will make transition into higher understanding or return to the ages of darkness.&quot; ---Gyeorgos Ceres Hatonn\n\nIf you choose to download all the Journals, they will take up approximately 1.5 gigabytes of hard drive space in ZIP form. The files are packed in 25 journals to a zip file, except for the last one. The first unpublished journal is No 106.\n\nFirst Journals To Read with No 5, 27 &amp; 47 mandatory.\n2, 3, 5, 7, 27 &amp; 47\n\t\nPleiades Connection Series\n30, 31, 32, 33, 34, 35, 36 &amp; 37\n\nTangled Web Series\n43, 44, 45, 46, 48, 49, 50, 51 &amp; 52\n\t\nRelative Connection Series\n73, 74, 75 &amp; 76\n\nBirthing The Phoenix Series\n222, 223, 224 &amp; 225\n\t\nRise Of Antichrist Series\n227, 228, 229 &amp; 230\n\nBanned Phoenix Journals\n22, 30, 31, 32, 33, 34, 35, 36, 37 &amp; 47\n\nPublished Phoenix Journals, the pdf files do not have a u in their name eg J105.pdf\n\nUnpublished Phoenix Journals, the pdf files have a u in their name eg J106u.pdf\n\nYou can read a brief summary of each journal in the other text files to find something you resonate with or are looking for specifically, most if not all the pdf files have a contents list for the various paragraphs within, but you would have to open each individual file to read it.\n\nThere is a lot of reading, don't try and read it all at once, you will most probably fry your brain :-) Some of the journals are direct and will be hard hitting, truth is always hard to take, but always the only way to go. We need to read, and act upon the material if you find the words resonate in a positive loving way within you, often truth cannot be explained as it is more of a knowing, than a thinking. You will know.\n\nSome Journals are missing or were never completed, 108, 120, 133, 211, 241, 247, 248, 249, 250, 251, 252, 253, 254, 255, 256, 257, 258 and perhaps 260. They may come to light at a later date and if so the uploader will add them then. \n\nLight and love to all the seekers of TRUTH! \n\nSeed and pass this information on, it has to reach as many readers as possible before time brings the judgement, so we are in a position to know the TRUTH and which way we choose to go. There are only 2 paths, that of the light and the dark.\n\nRead and choose your destination wisely.\n\nTags Phoenix Journals,God,Laws of God,Truth,2012,Sananda,Immanuel,\nHatonn,Pleiades,Aliens,Ashtar,Freedom,Esu,Christ,Jesus Christ,Anti-Christ,Creation,Cosmic Law,Unity,Forgiveness,Gods Word","torrent":{"xt":"urn:btih:1d0139ac07135d607c829ec5def3b04d0346c119","amp;dn":"Phoenix+Journals+-+God+Truth+Earth+Humans+Ascension+2012+And+Bey","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d0139ac07135d607c829ec5def3b04d0346c119","infoHashBuffer":{"type":"Buffer","data":[29,1,57,172,7,19,93,96,124,130,158,197,222,243,176,77,3,70,193,25]},"announce":[],"urlList":[]}}