{"title":"IP Camera Viewer 3.0.6","uid":14386681,"size":17475104,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:1d7488edf5eba916ed54ba07f6186a734b6438e9&amp;dn=IP+Camera+Viewer+3.0.6&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"V3N0Ms","files":1,"time":1461280875,"description":"IP Camera Viewer 3.0.6 \r\n\r\n \r\n\r\nSize: 16 MB\r\n\r\nRequires: Win All\r\n\r\n \r\n\r\nSet up an effective video monitoring system within minutes! IP Camera Viewer allows you to view live video from your USB or IP cameras on your PC. Use any USB or IP camera is to keep an eye on your home, office, parking area or anywhere you need security.\r\n\r\nView video from multiple IP cameras directly to your computer. Currently more than 2000 different IP camera models from leading camera manufactures are supported. It includes Axis, Canon, D-Link, Foscam, Panasonic, Mobotix, Pixord, Sony, Toshiba, Vivotek and many more. You can send a request to our technical team if your camera or model is not listed in our application. Virtually all USB cameras work with IP Camera Viewer.\r\n\r\nYou can control and view up to 4 camera feeds simultaneously. Get a live preview from multiple cameras with this light-weight application. IP Camera Viewer's centralized camera and layout management allows you to view your cameras from multiple remote locations on a single screen. You can change the arrangement and preview layout of the cameras, for your security needs.\r\n\r\nMake the live video clearer by adjusting camera image and video properties. It allows you to individually configure video properties such as resolution and frame rate for USB cameras. You can set image properties such as saturation, brightness, contrast for USB and IP Cameras.\r\n\r\nWhat if your camera is mounted upside-down or its preview is tilted a bit? With IP Camera Viewer you can adjust the orientation of your camera preview. It helps you to adjust the coverage area by supporting many PTZ (Pan/Tilt/Zoom) enabled network cameras. IP Camera Viewer provides a digital zoom, even if it is not supported by your camera.\r\n\r\nIP Camera Viewer allows you to set up a system that suits your needs. It's absolutely free and ideal for both personal and business use.\r\n\r\n\r\n\r\nWhat's New in IP Camera Viewer Version 3.0.6\r\n\r\nWindows 10 compatibility: IP Camera Viewer has been successfully tested to work on windows 10 operating system.\r\n\r\nAudio support for IP cameras: Audio support is now available for IP cameras also.\r\n\r\nImproved check for updates: Get automatically notified when new update of IP Camera Viewer is available.\r\n\r\nSupport for new IP cameras: Support for 167 IP cameras including new brands like Amcrest, Hosafe, Keekoon, Netcat, Novodio, Sinocam, SPY, Sunell, Vision, VTV, Ansel, Bytek, Longse, AOTE, Digiop, DB Power, EverFocus, Huacam, iControl, Juan, Zoneway, PROVISION ISR, Topica, KaiCong, Rollei, Crenova, MW Power, TECHview, Medion, upCam, WatchNET, LTS and TECVOZ. \r\n\r\n \r\n\r\n* Open it (with winrar/winzip)\r\n\r\n* Just Run to use...\r\n\r\n* Enjoy!","torrent":{"xt":"urn:btih:1d7488edf5eba916ed54ba07f6186a734b6438e9","amp;dn":"IP+Camera+Viewer+3.0.6","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d7488edf5eba916ed54ba07f6186a734b6438e9","infoHashBuffer":{"type":"Buffer","data":[29,116,136,237,245,235,169,22,237,84,186,7,246,24,106,115,75,100,56,233]},"announce":[],"urlList":[]}}