{"title":"A Woman's Disease - Ilana Lowy","uid":11675387,"size":1503852,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1e122457b78665fed033ea12be0defb1cd5f745c&amp;dn=A+Woman%27s+Disease+-+Ilana+Lowy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1422834117,"description":"Cervical cancer is an emotive disease with multiple connotations. It has stood for the horror of cancer, the curse of femininity, the hope of cutting-edge medical technologies and the promise of screening for malignant tumours. For a long time, this disease was identified with the most dreaded aspects of malignancies: prolonged invalidity and chronic pain, but also physical degradation, shame and social isolation. Cervical cancer displayed in parallel the dangers of being a woman.\n\nIn the 20th century, innovations initially developed to control cervical cancer - radiotherapy and radium therapy, exfoliate cytology (Pap smear), homogenisation of the 'staging' of tumours, mass campaigns for an early detection of precancerous lesions of the cervix - set standards for diagnosis, treatment and prevention of other malignancies. In the late 20th century, cervical cancer underwent another important change. With the display of the role of selected strands of HPV (Human Papilloma Virus) in the genesis of this malignancy, it was transformed into a sexually transmitted disease. This new understanding of cervical cancer linked it more firmly with lifestyle choices, and thus increased the danger of stigmatisation of patients; on the other hand it opened the possibility for efficient prevention of this malignancy through vaccination.\n\nIlana Lowy follows the disease from antiquity to the 21st century, focussing on the period since the mid-19th century, during which cervical cancer was dissociated from other gynaecological disorders and became a distinct entity. Following the ways in which new developments in science, medicine, and society have affected beliefs about medical progress and an individual's responsibility, gender roles, reproduction, and sex, Lowy demonstrates our understanding of what cervical cancer is, and how it can be prevented and cured","torrent":{"xt":"urn:btih:1e122457b78665fed033ea12be0defb1cd5f745c","amp;dn":"A+Woman%27s+Disease+-+Ilana+Lowy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e122457b78665fed033ea12be0defb1cd5f745c","infoHashBuffer":{"type":"Buffer","data":[30,18,36,87,183,134,101,254,208,51,234,18,190,13,239,177,205,95,116,92]},"announce":[],"urlList":[]}}