{"title":"The Jewish Americans (2008) - Part 2 of 3","uid":3993079,"size":890818322,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1ea5e7be62d087b8133439c89252d62300fa0b01&amp;dn=The+Jewish+Americans+%282008%29+-+Part+2+of+3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"DarkElf109","files":1,"time":1201165729,"description":"From PBS &lt;http://www.pbs.org/jewishamericans/&gt;:\n\nTHE JEWISH AMERICANS is a three-night documentary that explores 350 years of Jewish American history. Written and directed by award-winning filmmaker David Grubin, THE JEWISH AMERICANS is a journey through time, from the first settlement in 1654 to the present.  It is about the struggle of a tiny minority who make their way into the American mainstream while, at the same time, maintaining a sense of their own identity as Jews. Focusing on the tension between identity and assimilation, THE JEWISH AMERICANS is quintessentially an American story, which other minority groups will find surprisingly familiar.\n\nNarrated by actor Liev Schreiber, this landmark series features Jewish Americans who have made significant contributions to American life ? from Louis D. Brandeis and Ruth Bader Ginsburg to Henry Morgenthau, Hank Greenberg, Betty Friedan, Molly Goldberg, Carl Reiner, Sid Caesar, and Tony Kushner. However this story is also about Jewish American tailors and shopkeepers, soldiers and bankers, peddlers and merchants, labor organizers and civil rights activists, all of whom also helped shape the American landscape.\n\nPart 2 of 3","torrent":{"xt":"urn:btih:1ea5e7be62d087b8133439c89252d62300fa0b01","amp;dn":"The+Jewish+Americans+%282008%29+-+Part+2+of+3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ea5e7be62d087b8133439c89252d62300fa0b01","infoHashBuffer":{"type":"Buffer","data":[30,165,231,190,98,208,135,184,19,52,57,200,146,82,214,35,0,250,11,1]},"announce":[],"urlList":[]}}