{"title":"Amusement Parks On Fire - Out Of The Angeles [2006]","uid":5346551,"size":428457038,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1efaad914e9bc43fcca4e39a4076c9ec6cd0414f&amp;dn=Amusement+Parks+On+Fire+-+Out+Of+The+Angeles+%5B2006%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":11,"time":1265657714,"description":"Even before reading the liner notes, the astute listener will note a striking similarity between the second album by British dream pop outfit Amusement Parks on Fire and a certain inscrutable Icelandic collective. As it happens, APOF's mainstay, Michael Feerick, recorded the majority of Out of the Angeles in Sigur RÃƒÂ³s' own studio outside Reykjavik, mostly with that band's equipment. The sonic resemblance doesn't make the album a Sigur RÃƒÂ³s tribute record, however, because Feerick is at heart a much more pop-oriented songwriter than his patrons. For all the slow-building majesty of epic tracks like the stunning &quot;A Star Is Born&quot; and the propulsive first single, &quot;In Flight,&quot; Feerick also has a strong line in memorable melodies and catchy instrumental hooks, along with an appealingly earnest vocal style that's refreshingly free of the usual emo angst. In fact, the closest musical comparisons for this widescreen, richly detailed, and musically ambitious album are the Arcade Fire's Funeral and Broken Social Scene's You Forgot It in People, two other recent examples of the meeting point between artsy experimental rock and U2-style Big Rock Glory. After a tentative debut album that was basically a homemade demo given a wide release, Out of the Angeles is the true coming-out party for a genuinely talented and potentially great band.","torrent":{"xt":"urn:btih:1efaad914e9bc43fcca4e39a4076c9ec6cd0414f","amp;dn":"Amusement+Parks+On+Fire+-+Out+Of+The+Angeles+%5B2006%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1efaad914e9bc43fcca4e39a4076c9ec6cd0414f","infoHashBuffer":{"type":"Buffer","data":[30,250,173,145,78,155,196,63,204,164,227,154,64,118,201,236,108,208,65,79]},"announce":[],"urlList":[]}}