{"title":"Tony Joe White - Closer To The Truth  [1991]  [Robbie60] [FLAC]","uid":6222840,"size":362113773,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1f2295a89d386606280a88b89deae8015c8666c0&amp;dn=Tony+Joe+White+-+Closer+To+The+Truth++%5B1991%5D++%5BRobbie60%5D+%5BFLAC%5D+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Robbie6ty","files":-1,"time":1299405056,"description":"Tony Joe White\nCloser To The Truth\n\n\n\n\nLabel: Remark\nReleased: 1991\nSource: Original CD \nSize Torrent: 345 MB\nFormat: FLAC\n\n\n\n\n\n\n&quot;Steamy Windows&quot; and &quot;Undercover Agent For The Blues&quot; were big hits for Tina Turner. \nThis was Tony Joe White's highly acclaimed comeback album in the 90's. \n\n\n\n'Closer To The Truth' is Tony Joe White's stunning return to form after a difficult 1980s period. \n\nYou'll recognise the wonderful Steamy Windows (covered by good friend Tina Turner with TJW backing her) but the awesome opening track Tunica Motel which tells of Tony Joe's return to his blues roots sets the stage for the whole album. Tunica Motel has it all - strong hooks and TJW's strong songwriting which starts as a song about getting away from it all, and becomes, gradually, a gut-spilling account. &quot;I'm so tired of fighting with myself...&quot; confesses TJW. Later, when he's contemplating his musical direction, he &quot;sees the ghost of Robert Johnson&quot; and for me the line brings an involunatary tingle down my spine every time I hear it, which is often. Tony Joe is Back! \n\nIn this album he reintroduces us to his warm Stratocaster blues in gorgeous tracks: Ain't Going Down This Time and You're Gonna Look Good In Blues. In some ways these marked a new sound that he'd develop on subsequent albums - moving us closer to his use of Spanish guitar. \n\nAnd while he gives us several top swampy blues workouts on tracks like Bi-yo Rhythm and Love MD (&quot;I need a love doctor,&quot; he wails) Tony Joe White also returns us to the world view he shared in his earlier, still excellent album Home made Iceceam which featured gentle ecological laments in tracks like &quot;Ol mother Earth.&quot; \n\nHere, tracks such as the powerful &quot;The Other Side&quot; written soon after the massacre of Tiannemen Square display his trademark sense of justice and his feelings towards poverty and racism - and on recent listening I was surprised how the track still resonates strongly in the wake of Katrina. \n\nThe title track, Closer To The Truth is a longer track, less overt in its politics and anthem-like in its arrangement: a reflection on a world gone to hell. \n\nWhen the CD first appeared in 1991 it was a welcome return for Tony Joe White. It put the uncertainty of the 1980s, and his wrangles with various record companies behind him. Tony Joe White had refound his path of the decent groove - and this CD and the next two marked the new golden age of this superb talent. \n\nCloser to the Truth is an essential addition for Tony Joe fans, and an excellent introduction if you don't know, yet, why so many fans would crawl over broken glass to hear him play live. \n\n\n\n\nPersonnel\n\nTony Joe White - Guitars, Harmonica, Whomper, Swamp Box\nDavid Hood - Bass\nRoger Hawkins - Drums\nSteve Nathan - Keyboards\nSpooner Oldham - Wurlitzer piano\nHarvey Thompson - Horns\nMickey Buckins - Percussion\n\n\n\n\n\nTrack Listing\n\n1.&quot;Tunica Motel&quot; - 4:17\n2.&quot;Ain't Going Down This Time&quot; - 5:06\n3.&quot;Steamy Windows&quot; - 3:54\n4.&quot;(You're Gonna Look) Good in Blues&quot; - 5:10\n5.&quot;Love M.D.&quot; - 3:34 (Leann White/Tony Joe White)\n6.&quot;The Other Side&quot; - 5:50\n7.&quot;Bi-Yo Rhythm&quot; - 5:15\n8.&quot;Cool Town Woman&quot; - 4:16\n9.&quot;Bare Necessities&quot; - 3:47\n10.&quot;Undercover Agent for the Blues&quot; - 4:44 (Leann White/Tony Joe White)\n11.&quot;Main Squeeze&quot; - 4:16\n12.&quot;Closer to the Truth&quot; - 6:33 (Leann White/Tony Joe White)\n\nAll songs by Tony Joe White except as indicated.\n","torrent":{"xt":"urn:btih:1f2295a89d386606280a88b89deae8015c8666c0","amp;dn":"Tony+Joe+White+-+Closer+To+The+Truth++%5B1991%5D++%5BRobbie60%5D+%5BFLAC%5D+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f2295a89d386606280a88b89deae8015c8666c0","infoHashBuffer":{"type":"Buffer","data":[31,34,149,168,157,56,102,6,40,10,136,184,157,234,232,1,92,134,102,192]},"announce":[],"urlList":[]}}