{"title":"Joan V. Bondurant - Conquest of Violence: Gandhian Philosphy (pd","uid":8517106,"size":4257792,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1f59d86f7066a29420e766ca2f9597ce8027d92e&amp;dn=Joan+V.+Bondurant+-+Conquest+of+Violence%3A+Gandhian+Philosphy+%28pd&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pharmakate","files":-1,"time":1369777594,"description":"Joan V. Bondurant - Conquest of Violence: The Gandhian Philosophy of Conflict, Revised (Princeton Univ. Press, 1988; first edition, 1958). 281 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\n\nI read this many years ago and loved it -- a very profound and insightful exploration of the meaning of nonviolence.\n\n\ndescription:\n\nWhen Mahatma Gandhi died in 1948 by an assassin's bullet, the most potent legacy he left to the world was the technique of satyagraha (literally, holding on to the Truth). His &quot;experiments with Truth&quot; were far from complete at the time of his death, but he had developed a new technique for effecting social and political change through the constructive conduct of conflict: Gandhian satyagraha had become eminently more than &quot;passive resistance&quot; or &quot;civil disobedience.&quot;\n\nBy relating what Gandhi said to what he did and by examining instances of satyagraha led by others, this book abstracts from the Indian experiments those essential elements that constitute the Gandhian technique. It explores, in terms familiar to the Western reader, its distinguishing characteristics and its far-reaching implications for social and political philosophy.\n\nReview\n\nIf I were asked to recommend two books to introduce the American reader to Gandhi's political thought and activity, I would suggest his Autobiography and Conquest of Violence. (D. Mackenzie Brown Journal of Asian Studies )\n\nConquest of Violence has two merits: first, it gives us the clearest and most powerful statement to date of the central ideas in Gandhi's political thought; second, it forces us to consider these ideas not as a historical or cultural curiosity but as a challenge to the main body of Western political philosophy. (W. H. Morris-Jones Pacific Affairs )","torrent":{"xt":"urn:btih:1f59d86f7066a29420e766ca2f9597ce8027d92e","amp;dn":"Joan+V.+Bondurant+-+Conquest+of+Violence%3A+Gandhian+Philosphy+%28pd","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f59d86f7066a29420e766ca2f9597ce8027d92e","infoHashBuffer":{"type":"Buffer","data":[31,89,216,111,112,102,162,148,32,231,102,202,47,149,151,206,128,39,217,46]},"announce":[],"urlList":[]}}