{"title":"Terminator - The Sarah Connor Chronicles S01E02 - Gnothi Seauton","uid":4199159,"size":367982758,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1f7d2eee4960b76260c2bfa8c7b72731890b7fa4&amp;dn=Terminator+-+The+Sarah+Connor+Chronicles+S01E02+-+Gnothi+Seauton&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Chimera2005","files":1,"time":1211402726,"description":"This episode takes place three days after the trio&amp;#039;s arrival in September, 2007. John desires to go outside,but Sarah doesn&amp;#039;t allow him because she feels that they need to obtain new identities first. Cameron takes Sarah to a safe house where four resistance agents from 2027 will provide them with weapons and money. When the two arrive they find that the agents have been killed. Cameron and Sarah start looking for barcodes on their bodies. One of the dead agents is actually a Terminator feigning death. It briefly attacks Cameron and flees. The two give pursuit. Sarah crashes a motorbike into the machine briefly disabling it. Cameron crosses the street but is hit by a car allowing the Terminator to escape. While, the two are driving back home Sarah asks why they travelled to the future. Cameron answers that Sarah died of cancer in 2005 and by travelling in the future she actually skipped her own death.\n\nBack home, John secretly goes outside. He goes to an electronics store and finds that they are believed to be dead after blowing themself up in a bank eight years ago. John also finds that FBI Agent James Ellison was the one after them in the pilot episode. John also goes to Charley Dixon&amp;#039;s home. John finds that Charley has married. John hears someone at the door. He hides and Charley reconizes him. When Charley comes closer John, afraid that he may be a disguised Terminator, attacks him and flees.\n\nAt Sarah&amp;#039;s suggestion they attempt to get new identities from Enrique, who is later revealed to be a traitor. Sarah, John and Cameron go back to the safe house and steal the contents of a safe they find there. When Cameron attempts to open it her systems go offline when she is electrocuted by a security device implanted in the safe. John figures out the code (the new date of Judgment Day: April 19, 2012. After stealing a bag from the safe they flee before the Terminator reacquires them.\n\nSarah and Cameron return to Enrique&amp;#039;s house. Sarah confronts and intends to kill Enrique for betraying them but hesitates; Cameron then shoots and kills him, telling Sarah that she did it &quot;because you wouldn&amp;#039;t&quot;. Sarah then tells Cameron that from then on &quot;No one dies unless I say so&quot;.\n\nLater, Agent Ellison is at the crime scene at Enrique&amp;#039;s home. He is listening to a recording made just before Enrique died, offering the identity and whereabouts of a fugitive.\n\nAnother subplot is Cromartie&amp;#039;s reassembling after he was supposedly destroyed in the previous episode by Sarah with an isotope-fueled weapon. His head falls out of the time displacement field and bounces on the grass. A highway worker finds it and keeps it for himself. Cromartie relocates his endo-skull and kills the highway man. He is later shown hiding among the homeless wearing a paintball mask.","torrent":{"xt":"urn:btih:1f7d2eee4960b76260c2bfa8c7b72731890b7fa4","amp;dn":"Terminator+-+The+Sarah+Connor+Chronicles+S01E02+-+Gnothi+Seauton","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f7d2eee4960b76260c2bfa8c7b72731890b7fa4","infoHashBuffer":{"type":"Buffer","data":[31,125,46,238,73,96,183,98,96,194,191,168,199,183,39,49,137,11,127,164]},"announce":[],"urlList":[]}}