{"title":"Bill Jennings and Brother Jack McDuff - Glide On {1959-1960}","uid":8353014,"size":466608769,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2111c96ccaa03af550578b18edf29b346d94cbce&amp;dn=Bill+Jennings+and+Brother+Jack+McDuff+-+Glide+On+%7B1959-1960%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1365400554,"description":"eac secure cue log scans\n\nBill Jennings; Brother Jack McDuff - Glide On \nPrestige: PRCD-24234-2 {1959-1960}\nLegends Of Acid Jazz\n  \nEnough Said! (PR 7164)                     38:09 \n01  Enough Said                             06:42 \n02  Tough Gain                              04:17 \n03  Volare, aka, Nel Blu, Delpinto Di Blu   07:02 \n04  Dark Eyes                               04:42 \n05  It Could Happen To You                  06:26 \n06  Blue Jams                               05:29 \n07  Dig Uncle Will                          03:31 \n\nGlide On (PR 7177)                         37:56 \n08  Glide On                                05:33 \n09  Alexandria, Virginia                    03:55 \n10  Billin' And Bluin'                      04:45 \n11  There Will Never Be Another You         03:53 \n12  Azure-Te (Paris Blues)                  04:44 \n13  Fiddlin'                                02:37 \n14  Cole Slaw                               08:08 \n15  Hey Mrs. Jones                          04:21 \n                                15 tracks, 76:05  \n\nMusicians \nGuitar Bill Jennings \nOrgan, Piano Jack McDuff \nGuitar, Vibes Al Jennings \nBass Wendell Marshall \nDrums Alvin Johnson \n\nCredits \nProducer Esmond Edwards \nEngineer Rudy Van Gelder \nLiner Notes Jack Walker; Chris Albertson \n\nDetails \nStudio / Venue Van Gelder Studio \nPlace Englewood Cliffs, N.J. \nRecording Date 1959-1960 \nDate Of This Release 1999 \nSound Stereo \nUPC/EAC 025218523424 \nSpars AAD \n \nReview/Notes\nAMG review by Jim Todd\nBill Jennings' guitar was integral to the sound of jazz organ pioneers Bill Doggett and Wild Bill Davis. His dry, twangy, swinging sound was also part of organist Jack McDuff's transitional first release as a leader, Brother Jack. Here Jennings is in the spotlight on a compilation of his 1959 date, Enough Said, and 1960's Glide On. The lineup is actually the same as on Brother Jack: McDuff, Wendell Marshall on bass, and Alvin Johnson on drums. Jennings' brother, Al, joins in on the later set, contributing second guitar and some effective work on vibes. Just as McDuff's organ here still has the imprint of the roller-rink sound of Doggett and Davis, Jennings' guitar is also a product of an earlier era. It's easy to hear the influence of the bluesy jazz of guitarist Tiny Grimes, along with the jumping Texas blues of T-Bone Walker, the elastic riffing of Chuck Berry, and the early bop of Charlie Christian. In other words, the music has a vintage charm that is appealing in its own right and insightful as a precursor to the more full-throttled sound of the classic jazz organ combos of Jimmy Smith. The earlier set predates Brother Jack by a few months; the later one was recorded at about the same time. The tracks are generally grounded in the blues, with occasional forays into popular songs, one or two of which don't quite catch fire. Highlights include &quot;Billin' and Bluin'&quot; (with McDuff on excellent blues piano), Wild Bill Davis' &quot;Azure-Te,&quot; and the sly, soul-jazz prototypes &quot;Enough Said&quot; and &quot;Glide One.&quot; \n\nENOUGH SAID\nAMG review by Richie Unterberger\nJennings leads a relaxed quartet which includes Jack McDuff (organ), Wendell Marshall (bass), and Alvin Johnson (drums) on this 1959 session. Jennings shows off the bluesy tone that made him a favorite of B.B. King on his composition &quot;Tough Gain&quot; and the group-penned &quot;Blue Jam,&quot; but aside from these, most of the tracks are slow-to-midtempo shuffles -- edifying yet not exciting. On &quot;Dark Eyes&quot; Jennings varies the pace in a more arresting fashion than usual, playing sleepy lines with a crying tone to achieve a near slide-effect before the tempo abruptly doubles and the tune drops into a bop groove in its last half. At times McDuff is almost an equal partner on the date; he assumes the lead instrument role on &quot;It Could Happen to You.&quot; The entire album is available on Prestige's expanded CD reissue of the 1960 LP Glide On (which also features McDuff), pairing both records onto one disc.\n\nGLIDE ON\nAMG review by Richie Unterberger\nThis is a pretty mellow set of bluesy jazz, with Jack McDuff on organ, Wendell Marshall on bass, Alvin Johnson on drums, and Bill Jennings' brother Al Jennings on vibes. McDuff switches to the piano for one number, the Jennings brothers' &quot;Billin' and Bluin',&quot; which, as the title suggests, is as downhome blues as this album gets. Jennings is more of a tasteful player than a fiery one, but he does crank up the heat for some rapid-fire single-note lines on &quot;Fiddlin'&quot; and &quot;Alexandria, Virginia.&quot; Jessie Stone's easy-trotting &quot;Cole Slaw&quot; might get more time (eight minutes) than it merits, but things wrap up on a perkier note with the gently rolling Latin rhythms of &quot;Hey Mrs. Jones.&quot; Prestige's 1999 expanded CD reissue of the album adds the entirety of the previous Enough Said! recorded just five months prior to Glide On with the same musicians (with the exception of Al Jennings).","torrent":{"xt":"urn:btih:2111c96ccaa03af550578b18edf29b346d94cbce","amp;dn":"Bill+Jennings+and+Brother+Jack+McDuff+-+Glide+On+%7B1959-1960%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2111c96ccaa03af550578b18edf29b346d94cbce","infoHashBuffer":{"type":"Buffer","data":[33,17,201,108,202,160,58,245,80,87,139,24,237,242,155,52,109,148,203,206]},"announce":[],"urlList":[]}}