{"title":"Pillars.Of.Eternity.RE+The.White.Match.Part.I.v2.02.0749.PX1-GOG","uid":12653561,"size":13297312351,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:21432ed3d57c2e3c7639e1800b4cdefbe2f0ffed&amp;dn=Pillars.Of.Eternity.RE%2BThe.White.Match.Part.I.v2.02.0749.PX1-GOG&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Tenguken","files":20,"time":1446183182,"description":"Pillars Of Eternity: Royal Edition + The White Match: Part I (c) Paradox Interactive\r\n\r\nRelease Date : 10/2015\r\nProtection : -\r\nDiscs : 1\r\nGenre : RPG\r\nGame Version : 2.02.0749 PX1\r\nLanguages : EN/FR/DE/IT/ES/PL/RU\r\n\r\nPillars of Eternity is a role-playing game created by Obsidian\r\nEntertainment. The player controls the actions of a hero traversing a\r\nvast, fantastical world alongside a team of independent characters. The\r\ngame was created with the financial support gathered through the\r\nKickstarter platform. The creators of Baldur's Gate, Icewind Dale and\r\nFallout, among others, were involved in the production process.\r\nProject Eternity is the first completely independent game from Obsidian\r\nEntertainment. The developers decided to use the experience gained in\r\nBlack Isle Studios and create a role-playing game combining the best\r\nfeatures of the genre classics such as Baldur's Gate, Icewind Dale,\r\nPlanescape Torment, and Fallout. Among the developers are Tim Cain\r\n(Fallout, Arcanum, Temple of Elemental Evil), Josh Sawyer (Icewind Dale\r\nand Icewind Dale II, Fallout: New Vegas), Scott Everts (Fallout,\r\nPlanescape: Torment, Icewind Dale, Icewind Dale II, Fallout: New Vegas),\r\nBrian Menze (Planescape: Torment), and Dan Spitzley (Planescape: Torment).\r\nThe plot of Project Eternity is set in a vast fantasy world. The players\r\ncan visit a number of realms, including Ruins of Eir Glanfath, Free\r\nPalatinate of Dyrwood, Pearl Coast, and Lake of the Drow Tombs. The\r\nvarious locations are characterized by considerable diversity, including\r\ndifferent kinds of opponents. While traveling, the main character faces\r\nmany NPCs, some of which may give him a quest or, in some cases, join his\r\nparty.\r\n\r\nFor more info go to : https://www.gog.com/game/pillars_of_eternity_royal_edition\r\n\r\nPillars of Eternity: The White March - Part Iis a large sprawling\r\nexpansion pack with hours of gameplay integrated into the main\r\nadventure. Along with the new quests and area content, the team at\r\nObsidian continues to support and make improvements to the entire\r\ngame, including the additions of Player Party AI and Enhanced Enemy\r\nAI. Even if you haven't played Pillars of Eternity, now is a great\r\ntime to jump in and experience the hardcore classic RPG with The\r\nWhite March - Part I.\r\n\r\nFor more info go to : https://www.gog.com/game/pil...rnity_the_white_march_part_1\r\n\r\n- Install\r\n- Play","torrent":{"xt":"urn:btih:21432ed3d57c2e3c7639e1800b4cdefbe2f0ffed","amp;dn":"Pillars.Of.Eternity.RE%2BThe.White.Match.Part.I.v2.02.0749.PX1-GOG","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21432ed3d57c2e3c7639e1800b4cdefbe2f0ffed","infoHashBuffer":{"type":"Buffer","data":[33,67,46,211,213,124,46,60,118,57,225,128,11,76,222,251,226,240,255,237]},"announce":[],"urlList":[]}}