{"title":"Ibn Warraq - The Origins of the Koran (mobi, epub)","uid":6927090,"size":1460300,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:21940d5e683a9ccfab22750790de0efd68d620d2&amp;dn=Ibn+Warraq+-+The+Origins+of+the+Koran+%28mobi%2C+epub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":null,"files":2,"time":1325544979,"description":"The Origins of the Koran: Classic Essays on Islam's Holy Book\n\nThis volume rejects the notion that Islam's sacred text is error free and cannot be critically evaluated. The study of the Koran must develop and mature. Scholars of Islam are of course familiar with the book's many errors and contradictions, but these inherent flaws have rarely been revealed to a wider public. &quot;The Origins of the Koran&quot; is an attempt to remedy this deficiency by bringing together classic critical essays which raise key issues surrounding Islam's holy book. Divided into four parts, this important anthology begins with Theodor Noldeke's first truly scientific study of the Koran. Part Two focuses on the difficulty of establishing a reliable Koranic text, while Part Three examines the Jewish, Christian, and Zoroastrian sources of Muhammad's &quot;revelation.&quot; Part Four is a consideration of the controversial interpretations of contemporary scholar John Wansbrough, who questions the historical reliability of the earliest Islamic sources. This superb collection, which includes additional selections from Leone Caetani, Arthur Jeffery, David Margoliouth, Andrew Rippin, C C Torrey, and more, will prove indispensable to scholars and all those interested in the textual underpinning of one of the fastest growing religions in the world.\n\nAuthor: Ibn Warraq\nPublisher: Prometheus Books\nPublication Date: October 13, 2010\n\nFormats:\n.epub (compatible with Sony Reader, Cruz Reader, iPad, iPodTouch/iPhone, etc.)\n.mobi (compatible with Amazon Kindle, etc.)\n\nFree Calibre eBook reader: &lt;a href=&quot;\nhttp://calibre-ebook.com/download&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://calibre-ebook.com/download&lt;/a&gt;\n","torrent":{"xt":"urn:btih:21940d5e683a9ccfab22750790de0efd68d620d2","amp;dn":"Ibn+Warraq+-+The+Origins+of+the+Koran+%28mobi%2C+epub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21940d5e683a9ccfab22750790de0efd68d620d2","infoHashBuffer":{"type":"Buffer","data":[33,148,13,94,104,58,156,207,171,34,117,7,144,222,14,253,104,214,32,210]},"announce":[],"urlList":[]}}