{"title":"Xeno - A Cure For Diabetes","uid":7502583,"size":987689366,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:21f484b9a8fce244c0d45a68b8e451a63b6a6933&amp;dn=Xeno+-+A+Cure+For+Diabetes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"fruityloop7","files":1,"time":1344064187,"description":"About Xeno a Cure for Diabetes\n\nThis is the story of Karen Skinner.  She has Type 1 diabetes and her body is no longer able to make insulin.  She's had it for over twenty years and, try as she might, she just isn't able to control it well with insulin injections.  Her blood sugar levels swing from so high that they are slowly stealing her sight and damaging her kidneys and heart, to so low she is at risk of slipping in to a coma and dying.\n\nShe's going to take part in a remarkable trial.  Researchers are going to implant insulin-producing cells from pigs into her in an effort to cure her diabetes - or at least help her control it better.  The cells are Islet cells, the cells that the body uses to make insulin.  They are cleverly wrapped in a coating of Alginate - a super-refined seaweed extract that hides them from her immune system so her body doesn't reject them.\n\nBut these pigs aren't just any pigs.  Left on the Auckland Islands just north of Antarctica almost 200 years ago to feed shipwrecked sailors, these pigs have lived in isolation ever since.   They are the cleanest pigs in the world - free of the viral infections that have halted other attempts to perform animal to human xenotransplants.\n\nIt's the first time anyone has tried it and nobody knows what is going to happen - it could revolutionise the treatment of diabetes forever.","torrent":{"xt":"urn:btih:21f484b9a8fce244c0d45a68b8e451a63b6a6933","amp;dn":"Xeno+-+A+Cure+For+Diabetes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21f484b9a8fce244c0d45a68b8e451a63b6a6933","infoHashBuffer":{"type":"Buffer","data":[33,244,132,185,168,252,226,68,192,212,90,104,184,228,81,166,59,106,105,51]},"announce":[],"urlList":[]}}