{"title":"iDisplay v2.3.6 Final By bobiras2009","uid":7609847,"size":920450,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:21f693461cfba9022362ecc945c4d3fef35e00d3&amp;dn=iDisplay+v2.3.6+Final+By+bobiras2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bobiras2009","files":-1,"time":1347036007,"description":"                                 By bobiras2009\t\t\n\n\n\nIf you appreciate my work you can leave a commnent and seed this for as long you can to help me upload more.\n\n\nRequirements: Android 2.1+\nOverview: Turn your Android tablet or phone into additional display for your Mac or Windows computer. Increase your personal productivity by extending your computer screen! Perfect tool for multitaskers, iDisplay lets you use your Android as interactive wireless display to give you more screen real estate.\n\n\nTurn your Android device into the second monitor for your Mac or Windows PC!\n\nTurn your Android tablet or phone into additional display for your Mac or Windows computer. Increase your personal productivity by extending your computer screen! Perfect tool for multitaskers, iDisplay lets you use your Android as interactive wireless display to give you more screen real estate.\n\n&quot;That's: brilliant. I mean, I can think of about a billion uses for this.&quot; -MobileCrunch\n\nWhy choose iDisplay over hardware display?\n\n- Your Android can be your secondary display\n- Works with both Mac and Windows computers\n- Choose between WiFi and USB connection options: whichever is more suitable in any particular situation\n- iDisplay lets you interact with your additional display: move objects, draw, control playback\n- Zoom and Pan your desktop right on your Android\n- Easily switch between portrait and landscape screen orientations: simply rotate your device and it will adjust automatically\n- Perfect fit for any Android screen resolution\n\nCOMPATIBILITY:\n\nAndroid OS 2.1 or later\n\nMac OS X\niDisplay Desktop application needs to be installed on your Mac.\niDisplay Desktop is free and can be downloaded anytime at getidisplay.com\niDisplay is compatible with Intel-based Macs running on Mac OS X 10.5 and later.\n\nWINDOWS\niDisplay Desktop application needs to be installed on your PC.\niDisplay Desktop is free and can be downloaded anytime at getidisplay.com\niDisplay is compatible with Windows XP (32-bit only), Windows Vista (32- and 64-bit) and Windows 7 (32- and 64-bit), Windows 8.\nWindows 7 Starter Edition is not supported.\nFor Windows Vista and Windows 7 &quot;Aero&quot; theme may be disabled when connected to iDisplay and will be re-enabled upon disconnection).\n\nNETWORK CONNECTIVITY\nYour computer and Android must be connected to the same Wi-Fi network.\n\nNOTE: Video playback on iDisplay may be laggy. We're working on its optimization, please make sure to keep your iDisplay up to date!\n\n\n                                 By bobiras2009\t\t","torrent":{"xt":"urn:btih:21f693461cfba9022362ecc945c4d3fef35e00d3","amp;dn":"iDisplay+v2.3.6+Final+By+bobiras2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21f693461cfba9022362ecc945c4d3fef35e00d3","infoHashBuffer":{"type":"Buffer","data":[33,246,147,70,28,251,169,2,35,98,236,201,69,196,211,254,243,94,0,211]},"announce":[],"urlList":[]}}