{"title":"The.Great.British.Year--BBC--w.subs--720p","uid":12634611,"size":4197432089,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:22c3d50f67b42b3dfff8ce6f418354f722480d78&amp;dn=The.Great.British.Year--BBC--w.subs--720p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"uggauga","files":8,"time":1445905798,"description":"The Great British Year\r\n\r\nA portrait of the spectacular, dynamic nature of Britain over the course of one year. Great footage of British nature over the course of the 4 seasons.\r\n\r\nOriginally shown in 2013 (I think).\r\n\r\n1280x720 resolution, with subtitles - enjoy !\r\n\r\nMore info: http://www.bbc.co.uk/programmes/b04hvfck\r\n_____________________________________________\r\nWinter\r\nThe Great British Year, Original Series Episode 1 of 4\r\nStarting on New Year's Day, Britain is in the grip of winter. Time-lapses show a magical country shrouded in frost and mist swirling in hollows. Water becomes the enemy as it freezes, and the wildlife must cope. Red squirrels resort to subterfuge, and kites track a farmer ploughing to get at the worms beneath the frost. As winter fades, adders bask in the sun and the woodland floor erupts with snowdrops. On a lake in Wiltshire, new hope is captured in the evocative dance of the great crested grebe.\r\n\r\nSpring\r\nThe Great British Year, Original Series Episode 2 of 4\r\nSpring marks the start of an epic race for life where timing is everything; trees explode with blossom and mornings fill with the magical chorus of birdsong. Long-tailed tits frantically build nests whilst, in our oceans, seahorses sway to a graceful courtship dance.\r\nAs we celebrate Easter, a stoat mother hunts the young rabbits to feed her own playful young. As spring becomes summer, guillemot chicks leap from their cliffs to begin life at sea, and this year's young prepare for life alone.\r\n\r\nSummer\r\nThe Great British Year, Original Series Episode 3 of 4\r\nWhilst the human population of Britain kicks back, summer is boom time for the animals. More sun means more food, but animals are arriving from afar to share, and competition is high. Hunters time their arrival from Africa to feast on the huge glut of flying insects, hobbies race after dragonflies, and thermal cameras reveal nightjars on a Dorset heath. Will the weather hold? One day harmful UV rays force sea urchins to cover up, the next sees thunderstorms bring out hordes of hungry snails.\r\n\r\nAutumn\r\nThe Great British Year, Original Series Episode 4 of 4\r\nThe fading sun brings an energy change to Britain - a time of storms and unpredictable weather. The trees go dormant, but not before a final fling of colour. For animals, the shortening days are a cue to prepare, hibernating and hoarding for the dark times ahead. For some, its still a time to breed - deer rut, seals give birth and the Atlantic salmon leaps waterfalls in order to lay its eggs. Beneath the fallen leaves, slime moulds, earthworms and fungi take advantage of autumn's spoils","torrent":{"xt":"urn:btih:22c3d50f67b42b3dfff8ce6f418354f722480d78","amp;dn":"The.Great.British.Year--BBC--w.subs--720p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"22c3d50f67b42b3dfff8ce6f418354f722480d78","infoHashBuffer":{"type":"Buffer","data":[34,195,213,15,103,180,43,61,255,248,206,111,65,131,84,247,34,72,13,120]},"announce":[],"urlList":[]}}