{"title":"Java Application Development on Linux (REPOST)","uid":4723958,"size":2374403,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:22e687e02433697834e7226123d24efb02b36d84&amp;dn=Java+Application+Development+on+Linux+%28REPOST%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"VasiaZozulia","files":1,"time":1234648674,"description":"Java and Linux have come a long way since their respective introductions. Java is a serious contender as a platform for application development on the web, while Linux is widely regarded as an excellent platform for developing applications. For those who haven't kept current with Java development since the heady days of applet development, the myriad of Java technologies can look like a morass of car parts, musical genres, and acronyms. Java Application Development on Linux helps make sense of the current Java technologies and developments, while ensuring that the reader uses Open Source technologies as much as possible from start to finish.\n\nPart one of Java Application Development on Linux covers the Linux and Java foundations used in the rest of the book. Chapter one covers the fundamentals of UNIX and Linux by introducing Standard I/O, Pipes, Environment Variables, and rudimentary commands such as ls, find, chmod, tar, and man. Next, the authors introduce the venerable vi editor. The basic moves of vi are explained as well as regular expressions. (Lest other editor afficianados complain, other editors, as well as sed, are introduced, but not fully covered). Chapter 3 is a whirlwind tour of the fundamentals of Java and Object Oriented programming. This chapter is an admirable distillation of the concepts of Java, but by no means will it teach a rank beginner all of the points needed for full Java proficiency. Chapter 4 ties the first three chapters together by creating a simple Java program, compiling it, and reditecting input streams into the compiled program. The latter part of the chapter deals with incorporating environment variables into Java code using getProperties() and getproperty(), and with executing code via the Runtime class. Next, the book looks back at the Sun JDK, providing an overview of the Java Compiler, the Java Runtime, javadoc, JNI, and RMI, the Java Debugger (jdb), and jar. Chapter 6 is a quick look at the IBM Developer kit, and then it's on to chapters covering The GNU Java Compiler (gcj) and CVS. Chapter 9 picks up with Ant, and provides a look at why Ant was created and how to create buildfiles. Chapters 10 rounds out the first part of the book with an unfortunately dated look at Netbeans 3 and Eclipse 2 (both of which have recently released radically updated versions).\n\nPart two of Java Application Development on Linux is entitled &quot;Developing Business Logic&quot;. Chapter 11 covers the not-so-fun portions of development: requirements gathering and prototyping. This chapter also introduces a budget analysis project used throughout the rest of the book. Chapter 12 covers Analysis and Design, while chapter 13 covers everybody's favorite part of development: testing! Chapter 13 discusses installing and using JUnit to create automated test cases. The last two chapters in part two cover using a databases and JDBC together.\n\nPart three dips into Graphical interfaces, and gives equal time for both Swing and SWT. Both toolkits are given equal time, and the Budget application introduced in part two is given a stand-alone application front-end using both toolkits.\n\nJava gained lots of traction lately on the web application server, and part four introduces Servelets, JSP Servelts, and Open Source Web Application Servers. All three of these chapters keep using the budgetting application as the basis for their examples. In part five, Enterprise Java Beans (EJBs) are introduced in the context of this same budgeting application. While the authors admit that EJBs may be overkill for the budgeting application, they give ample coverage to clarify the role of EJBs in the enterprise.\n\nEvery chapter in Java Application Development on Linux includes a section describing what the authors didn't tell the reader, along with a section on additional reading. I found it extremely helpful to know what the authors didn't cover about each of the presented topics, and where to go for more information. Each topic is presented frankly, with a conversational style that makes the book easy to follow and easy to read. The book's style was so good that I found myself at the end of several chapters reading the &quot;What you don't know&quot; section hoping that there was more for me to digest. The authors had a large task in distilling the whole of Java and Linux development into one small book, but I wish that in future editions of the book they would have more space to delve deeper into these subjects.\n\nJava Application Development on Linux presents a broad picture of the state of Java and how Linux can play a part in developing applications under this framework. While this book did leave me wanting more, it still stands as an excellent introduction to Linux, Java, and the various Open Source tools for Java Development. Readers interested in stepping into the vast ocean of Java Development will find Java Application Development on Linux a handy guide, and a resource which they will refer to along the way.","torrent":{"xt":"urn:btih:22e687e02433697834e7226123d24efb02b36d84","amp;dn":"Java+Application+Development+on+Linux+%28REPOST%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"22e687e02433697834e7226123d24efb02b36d84","infoHashBuffer":{"type":"Buffer","data":[34,230,135,224,36,51,105,120,52,231,34,97,35,210,78,251,2,179,109,132]},"announce":[],"urlList":[]}}