{"title":"Fatal Frame 1, 2 &amp; 3_PS2_NTSC_USA_NSDOTHACK (Compressed)","uid":5099509,"size":5594608066,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:247b2527e9adcb80914d92648e79e87a7e087f57&amp;dn=Fatal+Frame+1%2C+2+%26+3_PS2_NTSC_USA_NSDOTHACK+%28Compressed%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"d3m0n1q_733rz","files":55,"time":1253856837,"description":"If you don't read this, chances are you won't know what you're doing.  First off, the files offered in this torrent are not my own.  Do not get on my case about it since I really don't need to hear it.  NSDOTHACK is the original creator, I've just done some recompressing to shrink the file size by a few hundred MB so that people can download this a little faster.\n\nBefore you download, be sure you have some sort of program to open 7z files.  If you have Winzip, you might as well uninstall it because it will be of no help here.  Winrar, no help either.  7z is a LZMA compression format with superior compression ratios; for this reason, I have decided to use it to compress everything.  Now, you're probably wondering to yourself, &quot;What the hell is 7z and what do I do with it?&quot;  Don't worry, you're not daft.  7z is the extension given to 7-zip files.  7-zip being a free program from 7-zip.org that will compress zip, 7-zip, tar, gz, and bz2 files.  It also decompresses a wide range of other files including rar.  There are far too many to list here, but you should download it and give it a try just because.\n\nAnyhow, mad props to NSDOTHACK.  I hope you don't mind my supplying an alternative to your own torrent, I'm just not a real fan of the rar format.\n\nOh, and before I forget, the 7z files are not compatible with the rar files.  If you have a few rar files already and decide to use this instead, those rar files you have completed won't help you one bit.\n\nAs a side note, I've made each portion of the 7z file 100 MB with the exception of the last portion which retains what's left over.  With each torrent piece being 4 MB, each portion of the 7z file will be 25 pieces.\n\nEnjoy!","torrent":{"xt":"urn:btih:247b2527e9adcb80914d92648e79e87a7e087f57","amp;dn":"Fatal+Frame+1%2C+2+%26+3_PS2_NTSC_USA_NSDOTHACK+%28Compressed%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"247b2527e9adcb80914d92648e79e87a7e087f57","infoHashBuffer":{"type":"Buffer","data":[36,123,37,39,233,173,203,128,145,77,146,100,142,121,232,122,126,8,127,87]},"announce":[],"urlList":[]}}