{"title":"Curses - Comics by Kevin Huizenga","uid":8590071,"size":152380443,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:249d28a4bb0d48857c9d6f9f516a43832934b68f&amp;dn=Curses+-+Comics+by+Kevin+Huizenga&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"LeonardTSpock","files":-1,"time":1371617338,"description":"'Curses - Comics by Kevin Huizenga'\n\nDrawn &amp; Quarterly, 2006, 148 pages\n\nWritten and Illustrated by Kevin Huizenga\n\nDelving into mythology, belief, and spirituality, Kevin Huizenga's short stories are based on the lives of familiar characters confronting the textures of mortality in unique and sometimes peculiar ways. Huizenga fuses the most banal aspects of modern culture with its most looming questions in a consistently genial style.\n\nLighthearted, but with a healthy dose of nineteenth-century spine tingling, the\nnarratives presented in Curses are insightful portrayals of reality. Huizenga's central character in his comics is Glenn Ganges, a seemingly middle-class man living in the suburbs whose blank-eyed wonderment at everyday experiences brings together such diverse aspects of our world as golf, theology, late-night diners, parenthood, politics, Sudanese refugees, and hallucinatory vision, into a complete experience as multifaceted as our own lives.\n\nHuizenga is regarded by many as one of the most promising young cartoonists of his generation, whose artistic talent, singular writing, and studied substance prove the versatility of his skill. Curses collects his work from Kramer's Ergot and The Drawn &amp; Quarterly Showcase, his award-winning and nominated comic-book series Or Else, and Time magazine; it is the most extensive selection of his comics to date in a single volume.","torrent":{"xt":"urn:btih:249d28a4bb0d48857c9d6f9f516a43832934b68f","amp;dn":"Curses+-+Comics+by+Kevin+Huizenga","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"249d28a4bb0d48857c9d6f9f516a43832934b68f","infoHashBuffer":{"type":"Buffer","data":[36,157,40,164,187,13,72,133,124,157,111,159,81,106,67,131,41,52,182,143]},"announce":[],"urlList":[]}}