{"title":"[Fakku! Subs] Cafe junkie #1 - Caffe Machiatto","uid":5294073,"size":206371680,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:25d2694449105f12976acd2b6b501196970a281b&amp;dn=%5BFakku%21+Subs%5D+Cafe+junkie+%231+-+Caffe+Machiatto&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"megadethmen","files":1,"time":1263998565,"description":"Based on the game by Buruge on Demand (label of Blue Gale).\nThe story revolves around Masaru and his friend Ijuuin, and their sexually oriented exploits with 3 sisters, Kaede, Nanami, and Kurumi.. whom all work and manage a Cafe together. Kaede owns the cafe, which is also worked by her two sisters Nanami and Kurumi. Masaru has been offered a part-time job by Kaede, which sets him to work alongside the two other girls. When Kaede ends up needing to be away from the Cafe for a month on an internship, she leaves Masaru in charge of the Cafe, putting an extension on his part-time job.. and granting him the extra responsibility of 'looking after' the other girls in Kaede's absence.\nHaving his alone time with Nanami and Kurumi leads to some unexpected events. Kurumi first confesses her love for Masaru, and he makes sure to take full advantage of the situation.. but then wouldn't you know it? Nanami seems to be falling for the male protagonist as well. The sisters find out about Masaru's two-timing efforts (like he cares), and they naturally become jealous of each other. When Kaede returns early from her internship, she accidentally happens across the others indulged within their expressions of affection for each other, which gives her and Ijuujin perfect opportunity to act on certain interests as well. Too bad for him that Masaru will still end up getting all the love all to himself from all three of the sisters in the end.\n\nCensored but worth a watch. \n","torrent":{"xt":"urn:btih:25d2694449105f12976acd2b6b501196970a281b","amp;dn":"%5BFakku%21+Subs%5D+Cafe+junkie+%231+-+Caffe+Machiatto","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25d2694449105f12976acd2b6b501196970a281b","infoHashBuffer":{"type":"Buffer","data":[37,210,105,68,73,16,95,18,151,106,205,43,107,80,17,150,151,10,40,27]},"announce":[],"urlList":[]}}