{"title":"Pablo Neruda - Memoirs (improved pdf)","uid":8355322,"size":9180597,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:25f7511d7fd628ae5cfe35a93b65c5f817edded7&amp;dn=Pablo+Neruda+-+Memoirs+%28improved+pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pharmakate","files":-1,"time":1365476956,"description":"Pablo Neruda - Memoirs (Penguin, 1978; original edition 1974). 370 pages.\n\nImproved pdf of a previously existing scan. Searchable (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\nMemoir of the Nobel prize-winning poet and radical.\n\n\ndescription:\n\nPerhaps no other modern poet received as much international recognition as Pablo Neruda, for in his poetry he addressed universal concerns, writing passionately about love, nature, the beauty of one's homeland (in his case, Chile), and the human condition. In his memoirs, first published in Spain a few months after his death in 1973, Neruda expanded upon these themes to provide a full portrait of one of the great poets of our age.\n\nBorn the son of a railwayman in 1904, Neruda studied in Santiago before becoming a consul in countries ranging from Burma to Spain, later returning to Chile to become a senator. As a member of the Communist Party, which he saw as the only hope for the desperately poor miners of the Chilean lowlands, he became a target of official persecution and in 1948 was driven from his senate seat into hiding. He eventually escaped to Europe, where he met such individuals as Eluard, Gandhi, Mao, and Picasso and traveled to Russia and China. Finally able to return home in 1952, he left Chile again to serve as ambassador to France; while in Europe in 1971, he was awarded the Nobel Prize. But his happiest years were spent at his home in the verdant Isla Negra off the coast of Chile, where he wrote this volume, which is not only a record of his extraordinary life but also a significant part of the history of our time.\n\nReview\n\n&quot;A sort of distilled essence of [Neruda] in both substance and form . . . the starting point for all future biographers.&quot; --Robert Maurer, Saturday Review\n\n&quot;Some of the descriptions of places--India, China, Mexico especially--are brilliant, but it is Chile that emerges most clearly with lights and shadows.&quot; \n--Selden Rodman, National Review\n","torrent":{"xt":"urn:btih:25f7511d7fd628ae5cfe35a93b65c5f817edded7","amp;dn":"Pablo+Neruda+-+Memoirs+%28improved+pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25f7511d7fd628ae5cfe35a93b65c5f817edded7","infoHashBuffer":{"type":"Buffer","data":[37,247,81,29,127,214,40,174,92,254,53,169,59,101,197,248,23,237,222,215]},"announce":[],"urlList":[]}}