{"title":"Alice Cooper - I'll Bite Your Face Off (2nafish)","uid":7080434,"size":21487873,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:262ef4fa053397a92bd6d6daad8d4553ce7cd060&amp;dn=Alice+Cooper+-+I%27ll+Bite+Your+Face+Off+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"2nafish","files":-1,"time":1331006976,"description":"File Info:\n\nFormat            : MPEG-4\nLength            : 20 MiB\n\nVideo #0          : AVC at 638 Kbps\nAspect            : 634 x 360 (1.761) at 25.000 fps\n\nAudio #0          : AAC at 96.0 Kbps\nInfos             : 2 channels, 44.1 KHz\n\n\nThis video has no logos or titles.\n\n\nWelcome 2 My Nightmare is the 26th studio album by Alice Cooper, released in September 2011. Peaking at #22 in the Billboard 200 it is Cooper's highest-charting album in the US since 1991's Hey Stoopid.\n\nThe idea for the album came about soon after the thirtieth anniversary of the original Welcome to My Nightmare album, while Cooper was talking with producer Bob Ezrin, who proposed the idea of a sequel to Welcome to My Nightmare. Cooper liked the idea, and decided to recruit previous members of the Alice Cooper band. The concept of the album was described by Cooper as &quot;another nightmare, and this one is even worse than the last one.&quot; Cooper said that he had originally intended to make a sequel to his previous album, Along Came a Spider, but decided to make the Nightmare sequel after Ezrin explained that he &quot;wasn't really into it.&quot;\n\nThe album was completed sometime during early 2011, with Cooper announcing its completion in February 2011 on his radio show, Nights with Alice Cooper. It was first scheduled to be released late in 2011 on Bob Ezrin's Bigger Picture label as part of a deal involved marketing, touring and production work by Bigger Picture for Cooper in the future. The album was then announced as being delayed until some time in 2012 due to Cooper's touring commitments, however it was finally released on 13 September 2011.\n\n&quot;I'll Bite Your Face Off&quot;\n\nThe song's classic rock tone was Cooper's nod to the early Rolling Stones. In this song, Alice is introduced to the devil, his female guide in Hell (the same from &quot;What Baby Wants&quot;). &quot;I'll Bite Your Face Off&quot; was the album's first single and was released with a music video which features various live performances. One of these includes Cooper's show at the 100 Club in London with Johnny Depp on guitar. The single was another song on the album played by the original Alice Cooper band.\n\n\nMy Videos:\n  &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\t","torrent":{"xt":"urn:btih:262ef4fa053397a92bd6d6daad8d4553ce7cd060","amp;dn":"Alice+Cooper+-+I%27ll+Bite+Your+Face+Off+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"262ef4fa053397a92bd6d6daad8d4553ce7cd060","infoHashBuffer":{"type":"Buffer","data":[38,46,244,250,5,51,151,169,43,214,214,218,173,141,69,83,206,124,208,96]},"announce":[],"urlList":[]}}