{"title":"Life aquatic[DVDrip][Spanish]","uid":5495284,"size":731953152,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:26b8526106439f74bc81c13b818752487a9c253e&amp;dn=Life+aquatic%5BDVDrip%5D%5BSpanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sahae","files":1,"time":1271237030,"description":"DirecciÃƒÂ³n: Wes Anderson.\nPaÃƒÂ­s: USA.\nAÃƒÂ±o: 2004.\nDuraciÃƒÂ³n: 120 min.\nGÃƒÂ©nero: Comedia, aventuras.\nInterpretaciÃƒÂ³n: Bill Murray (Steve Zissou), Owen Wilson (Ned Plimpton), Cate Blanchett (Jane Winslett-Richardson), Anjelica Huston (Eleanor Zissou), Willem Dafoe (Klaus Daimler), Jeff Goldblum (Alistair Hennessey), Michael Gambon (Oseary Drakoulias), Noah Taylor (Vladimir Wolodarsky), Bud Cort (Bill Ubell), Seu Jorge (PelÃƒÂ© dos Santos), Robyn Cohen (Anne-Marie Sakowitz).\nGuiÃƒÂ³n: Wes Anderson y Noah Baumbach.\nProducciÃƒÂ³n: Wes Anderson, Barry Mendel y Scott Rudin.\nMÃƒÂºsica: Mark Mothersbaugh.\nFotografÃƒÂ­a: Robert Yeoman.\nMontaje: David Moritz.\nDiseÃƒÂ±o de producciÃƒÂ³n: Mark Friedberg.\nDirecciÃƒÂ³n artÃƒÂ­stica: Stefano Maria Ortolani.\nVestuario: Milena Canonero.\nEstreno en USA: 25 Diciembre 2004.\nEstreno en EspaÃƒÂ±a: 23 Marzo 2005.\n\nSINOPSIS\n\nConozca a Steve Zissou (Bill Murray): el legenda-rio explorador submarino, distinguido presumido, y un hombre conocido en todo el mundo por sus documentales acerca de la rebosante vida debajo del mar azul. ÃƒÅ¡ltimamente, sin embargo, la vida en la tierra no es muy indulgente con Zissou. Su mejor amigo y por mucho tiempo tambiÃƒÂ©n socio, Esteban, fue recientemente devorado por un hambriento tiburÃƒÂ³n jaguar. Se comienza a rumorear que estÃƒÂ¡ perdiendo su maestrÃƒÂ­a. Y ahora, de la nada, llega un genuino caballero sureÃƒÂ±o y copiloto de Air Kentucky llamado Ned Plimpton (Owen Wil-son) quien asevera que ÃƒÂ©l podrÃƒÂ­a ser, o no ser, el hijo perdido que Ste-ve nunca llegÃƒÂ³ a conocer. Imperioso, egÃƒÂ³latra y adorablemente despis-tado, Steve Zissou estÃƒÂ¡ ahora listo para realizar su pelÃƒÂ­cula mÃƒÂ¡s im-presionante hasta la fecha, en la que se vengarÃƒÂ¡ del tiburÃƒÂ³n jaguar, se convertirÃƒÂ¡ en el padre que nunca pensÃƒÂ³ que podrÃƒÂ­a ser, y recuperarÃƒÂ¡ al-go del efÃƒÂ­mero sentido de su propia nobleza. HaciÃƒÂ©ndose a la mar en su barco, The Belafonte, Zissou reÃƒÂºne una tripulaciÃƒÂ³n que tambiÃƒÂ©n in-cluye a: Jane Winslett-Richardson (Cate Blanchett), por raro que pa-rezca una periodista encinta cubriendo la historia de la expediciÃƒÂ³n; Eleanor Zissou (Anjelica Huston), la brillante esposa de Zissou y vice presidente de The Zissou Society; el afectuoso ingeniero alemÃƒÂ¡n, Klaus Daimler (Willem Dafoe); el archi enemigo y rival oceanÃƒÂ³grafo, Alistair Hennessey (Jeff Goldblum); el septuagenario productor de Zis-sou, Oseary Drakoulias (Michael Gambon); el fÃƒÂ­sico y compositor de mÃƒÂºsica original, Vladimir Wolodarsky (Noah Taylor); el funcionario de la compaÃƒÂ±ÃƒÂ­a de bonos, Bill Ubell (Bud Cort); PelÃƒÂ© dos Santos (Seu Jor-ge), el experto en seguridad brasileÃƒÂ±o quien en forma regular le da se-renatas al equipo con pegajosas interpretaciones musicales en portu-guÃƒÂ©s de canciones de David Bowie. El resto del Equipo Zissou incluye a la siempre topless chica del guiÃƒÂ³n Anne-Marie Sakowitz (Robyn Co-hen); al camarÃƒÂ³grafo Vikram Ray (Waris Ahluwalia); el hombre rana Bobby Ogata (Neils Koizumi) y al editor y tÃƒÂ©cnico de sonido Renzo Pietro (Pawel Wdowczak).\n\n","torrent":{"xt":"urn:btih:26b8526106439f74bc81c13b818752487a9c253e","amp;dn":"Life+aquatic%5BDVDrip%5D%5BSpanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"26b8526106439f74bc81c13b818752487a9c253e","infoHashBuffer":{"type":"Buffer","data":[38,184,82,97,6,67,159,116,188,129,193,59,129,135,82,72,122,156,37,62]},"announce":[],"urlList":[]}}