{"title":"The Open Games for Black (Igor Lysyj &amp; Roman Ovetchkin)","uid":8791029,"size":4204473,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2793f3ed7480e535194d42a5008d4e37187594ff&amp;dn=The+Open+Games+for+Black+%28Igor+Lysyj+%26amp%3B+Roman+Ovetchkin%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"OmeGa15","files":-1,"time":1375946898,"description":"From the Preface by Igor Lysyi: &quot;My main opening weapon throughout my chess career, from 1998 to 2010, was the French Defence. However, in the last five years of this period I played a large number of games in the strongest tournaments in Russia, mostly against players rated over 2600, and I suffered many humiliating but well-deserved defeats.\n\nThese losses made me reconsider the situation and I came to the conclusion that the cramped positions in the French Defence are strategically risky and do not quite suit my playing style [...]\n\nIn this book I have presented all my analyses and my discoveries during the World Cup 2011. I believe that it will be useful for chess players at all levels to study them, together with the excellent annotations and explanations of Roman Ovetchkin.\n\nThe reader might justifiably pose the following question: &quot;How to cope with the Ruy Lopez if you are Black?&quot;. In fact, almost every variation of this opening deserves to be analyzed in a separate volume, so we shall reveal to you the tremendously complicated and fashionable Berlin Defence in our next book.&quot;\n\n\n-- About the authors --\n\nRoman Ovetchkin is an international grandmaster and an experienced coach and trainer. He was part of the team which enabled Ekaterina Kovalevska to become a vice-champion of the world in 2004. In 2007 he coached the &quot;ABC&quot; team and they shared 1st-2nd place in the European Cup for women. He was the winner of numerous international chess competitions. \n\nIgor Lysyi is an international grandmaster. He won many times the students' championships and the Russia Universiades, both as an individual and as a member of the team of the Ural University. He participated in the team of Russia which won the World Students' Championship in 2008. He was the winner of numerous international chess tournaments.\n","torrent":{"xt":"urn:btih:2793f3ed7480e535194d42a5008d4e37187594ff","amp;dn":"The+Open+Games+for+Black+%28Igor+Lysyj+%26amp%3B+Roman+Ovetchkin%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2793f3ed7480e535194d42a5008d4e37187594ff","infoHashBuffer":{"type":"Buffer","data":[39,147,243,237,116,128,229,53,25,77,66,165,0,141,78,55,24,117,148,255]},"announce":[],"urlList":[]}}