{"title":"The Life and Times of Judge Roy Bean","uid":10410485,"size":2037221034,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:27d5a051186d2629f9c5c598ff30297ba2e9def6&amp;dn=The+Life+and+Times+of+Judge+Roy+Bean&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"strawberry5","files":-1,"time":1403482766,"description":"IMDB:\nThe real-life Judge Roy Bean, the law west of the Pecos, was a legendary figure who pulled off numerous publicity stunts for &quot;his&quot; town of Langtry, meanwhile administering a little justice along the way. If you'ver ever watched Northern Exposure, a good comparison might be Barry Corbin's Maurice Minnifield. That being said, the real Judge Bean pales in comparison to the legend that has built up over the years. That legend is what Huston concerns himself with, and it serves him well. The film is very episodic in nature, and for the first half, it does not disappoint. Paul Newman's first scene, where he's beaten, left for dead, and returns to wreck vengeance on every last one of his attackers sets the tone for the rest of the film. This is high mythology, tall tales at their best; you get the impression that this is how we Texans really wish our history read--colorful, eclectic, ruthless at times, and occasionally downright bizarre. From beer drinking bears to albino bandits, it's certainly interesting.\n\nThat being said, the film definitely takes a melancholy tone as civilization comes to Langtry. With it comes the disdain for such colorful characters as Bean, who seemingly has no place in the new, modern world. It's sad, but makes for an especially poignant ending. Newman's Judge is a blustering wonder; other standouts include Anthony Perkins, Ned Beatty, Roddy McDowell, and a very young and fetching Victoria Principal. Also making cameos are Jacqueline Bissett, Stacy Keach, Ava Gardner, and even the director himself.\n\nAll in all, a funny, touching film.","torrent":{"xt":"urn:btih:27d5a051186d2629f9c5c598ff30297ba2e9def6","amp;dn":"The+Life+and+Times+of+Judge+Roy+Bean","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"27d5a051186d2629f9c5c598ff30297ba2e9def6","infoHashBuffer":{"type":"Buffer","data":[39,213,160,81,24,109,38,41,249,197,197,152,255,48,41,123,162,233,222,246]},"announce":[],"urlList":[]}}