{"title":"Ernest Tubb - Let's Say Goodbye Like We Said Hello [1947-1953]","uid":6857458,"size":1587831967,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:27f1ded0ad2b0d720dab485f7264efffcd8d576d&amp;dn=Ernest+Tubb+-+Let%5C%27s+Say+Goodbye+Like+We+Said+Hello+%5B1947-1953%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bonnie335","files":221,"time":1322751841,"description":"Ernest Tubb - Let's Say Goodbye Like We Said Hello - 1947-1953 \n\nBear Family Records 5 disc set. Release: 2002. With Covers &amp; Disography\n\n\nThese 119 songs over five CDs represent Ernest Tubb at the very peak of his career musically and commercially, from 1947 until 1953. Disc One is filled with winners; Tubb's voice on these and the rest of the songs in this collection is at its richest and most expressive, not exactly soaring (it never did that) but never straining into the top of his range, and the results, coupled with Jerry Byrd's steel guitar and Tubb's and Jimmie Short's guitars, are exceptionally satisfying, crisp and well-articulated playing bringing out his singing at its best. Disc Two is highlighted by the presence of several duets featuring Tubb with the Andrews Sisters, which work beautifully, the Andrews Sisters crossing over from pop to country rather than Tubb moving in the other direction; here also is Red Foley, along with an album of religious songs and some great solo numbers. (By itself, this disc would have made a great single-platter release.) Disc Three features a bunch of duets with Red Foley, and even a pair of cuts with the trio of Tubb, Foley, and Minnie Pearl. Disc Four has more work with Foley, all of it worthwhile, and also includes Tubb's tribute records to Hank Williams and Jimmie Rodgers, as well as his topical Korean War songs and his first covers of compositions by his son Justin. Disc Five is a mixed bag, nearly half of it comprised of good duets with Red Foley and a few prime solo numbers, and the other half dominated by a dozen religious songs and Christmas numbers recorded for a theme album. The notes are informative and nicely thorough, though the booklet also has a few more photos than is typical on these sets. ~ Bruce Eder","torrent":{"xt":"urn:btih:27f1ded0ad2b0d720dab485f7264efffcd8d576d","amp;dn":"Ernest+Tubb+-+Let%5C%27s+Say+Goodbye+Like+We+Said+Hello+%5B1947-1953%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"27f1ded0ad2b0d720dab485f7264efffcd8d576d","infoHashBuffer":{"type":"Buffer","data":[39,241,222,208,173,43,13,114,13,171,72,95,114,100,239,255,205,141,87,109]},"announce":[],"urlList":[]}}