{"title":"Born Again Handcuffed Anal Slapper In Cuffs","uid":11697906,"size":725819821,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:282a9171a90bc128608fd496e074b6b400112fe8&amp;dn=Born+Again+Handcuffed+Anal+Slapper+In+Cuffs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"sarah.jensen","files":1,"time":1423798969,"description":"A proven fact, youthful looks and a high and weird sex drive in females is derived from the absorption of copious amounts semen from varied sources over an extended period. Just look at Salee. Broadly, what that means is that because she gets fucked up the ass regularly, and has done so for fucking years on end, all that sperm in her asshole, combined with what she takes in her mouth and swallows has kept her young looking, vigorous and healthy, and keeps her wanting more sex. It is rather scientific really. The various hormones and chemicals in sperm interact with the female blood supply and produce incredible youth extending effects. It is not as simple as that, it needs not just a lot of sperm, not just in pure ounces, it needs a broad spectrum of these hormones to form the correct matrix, which can only be derived if there is sperm from thousands of different men interacting. So a girl can achieve this condition if she fucks like mad. And more importantly uses her anus and mouth. There will be some marginal effect from using the vagina, but really, that hole is for procreation. The rectum is different. Inside the rectum, near the base is quite a bit of porous membrane that allows the hormones from sperm to pass through and be absorbed internally. There is similar membrane tissue in the mouth under the tongue. So if you come in a girl's mouth, you should always get the girl to swish it around in her mouth and show you before she swallows. Now Salee is the biggest slut I know, and has been plying her asshole for years, decades. And here she is knocking on my door and begging to get fucked up her bum. So I throw her in handcuffs and bugger her up little botty. She shuffles around and knows what is good for her. Sodomize the video, it will last forever","torrent":{"xt":"urn:btih:282a9171a90bc128608fd496e074b6b400112fe8","amp;dn":"Born+Again+Handcuffed+Anal+Slapper+In+Cuffs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"282a9171a90bc128608fd496e074b6b400112fe8","infoHashBuffer":{"type":"Buffer","data":[40,42,145,113,169,11,193,40,96,143,212,150,224,116,182,180,0,17,47,232]},"announce":[],"urlList":[]}}