{"title":"The Monsters Inside by Stephen Cole (Doctor Who New Series Adven","uid":8097011,"size":803592,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:28595bdd89e7cae7d01a50692d67697972f1b463&amp;dn=The+Monsters+Inside+by+Stephen+Cole+%28Doctor+Who+New+Series+Adven&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sputnikvi","files":1,"time":1359864573,"description":"I didn't make the eBook, but I noticed it wasn't on individually and decided to upload it for you guys. Please support Doctor Who and buy the book if you can!\n\nDescription from Amazon:\n\nThe TARDIS takes the Doctor and Rose to a brutal deep-space prison colony. Can they stay out of gaol long enough to discover who - or what - is behind the sinister scientific plot that threatens billions of human lives? The TARDIS takes the Doctor and Rose to a destination in deep space - Justicia, a prison camp stretched over seven planets, where Earth colonies deal with their criminals. While Rose finds herself locked up in a teenage borstal, the Doctor is trapped in a scientific labour camp. Each is determined to find the other, and soon both Rose and the Doctor are risking life and limb to escape in their distinctive styles. But their dangerous plans are complicated by some old enemies. Are these creatures fellow prisoners as they claim, or staging a takeover for their own sinister purposes? Featuring the Doctor and Rose as played by Christopher Eccleston and Billie Piper.\n\nI have a bunch of other Doctor Who eBooks from another torrent that grouped them together. If you have a request for an individual book let me know and I'll see if I have it.","torrent":{"xt":"urn:btih:28595bdd89e7cae7d01a50692d67697972f1b463","amp;dn":"The+Monsters+Inside+by+Stephen+Cole+%28Doctor+Who+New+Series+Adven","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"28595bdd89e7cae7d01a50692d67697972f1b463","infoHashBuffer":{"type":"Buffer","data":[40,89,91,221,137,231,202,231,208,26,80,105,45,103,105,121,114,241,180,99]},"announce":[],"urlList":[]}}