{"title":"The Strange Case of the End of Civilization as We Know It [1977,","uid":5731826,"size":2586370048,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:28b0a356073f83c76a7540e4a5d4d9836bbaa440&amp;dn=The+Strange+Case+of+the+End+of+Civilization+as+We+Know+It+%5B1977%2C&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":8,"time":1280682104,"description":"The Strange Case of the End of Civilization as We Know It is a 1977 \ncomedy starring John Cleese. It is a low-budget spoof of the Sherlock \nHolmes detective series, as well as the mystery genre in general.\n\nThe film also features Connie Booth, who especially takes over at\nthe end of the film.\n\nThe grandson of the world's first and foremost consulting detective and his bumbling, bionic sidekick attempt to catch the only living descendant of Professor Moriarty.\n\nThe film begins aboard a luxury aircraft as Dr. Gropinger (Ron Moody) \n(parody of Henry Kissinger) travels on a goodwill tour. He misplaces his \ndiary and is thrown into a panic as, without the diary, he no longer \nknows where he is or is supposed to be next. Stepping off the plane, he \nis shot dead after extending erroneous greetings to a congregation of \nArabs. Soon after, the U.S. President (Joss Ackland in a caricature of \nGerald Ford) receives a threatening letter signed only &quot;Moriarty&quot;, \nclaiming responsibility for the death. The letter also claims Moriarty has \nset in motion a plan that will allow him to gain control of the world. The \npresident dispatches a top agent to London to work with the world's top \nlaw enforcement officials and find a strategy to combat Moriarty.\n\nHeaded by an incompetent Englishman (Denholm Elliott), the \ncommittee settles on contacting the &quot;present-day&quot; Sherlock Holmes \n(John Cleese). He is enrolled by the Commissioner of Police (Stratford \nJohns) to lay plans for the capture of the descendant of Moriarty before \nhe gains control of the world. Holmes reveals himself to be a great \neccentric, with an affinity for certain addictive drugs (a nod to the literary \nSherlock Holmes' experience with cocaine). He is accompanied by the \ndescendant of Doctor Watson, both a medical doctor and utter fool. \nUnfortunately, the commissioner is murdered before leaving the \nHolmes' residence, his death mainly the result of Doctor Watson's \n(Arthur Lowe) rampant stupidity.\n\nThe duo then proceed to Scotland Yard to discuss the situation with the \ncommittee. Before any plans can be made, much of the committee is \nmurdered by a distant sniper. Without their help, Holmes dreams up a \nplan to invite all of the great detectives in the world to a party, with the \nhope of discovering the true identity of Moriarty. He reasons that \nMoriarty will be unable to pass up a chance at attacking all of them in \none fell swoop. Many fictional detectives are parodied and handed \ngruesome deaths while Holmes and Watson wait in a suite. The \nmurderer is revealed to be none other than an exact copy of Watson. \nDue to Watson's ineptitude and the impersonator's great skill in \ndeception, Holmes is faced with a quandary in determining the real \nculprit (who is actually Moriarty).\n\nThe Strange Case of the End of Civilization as We Know It\nDirected by \tJoseph McGrath\nProduced by \tHumphrey Barclay\nWritten by \tJohn Cleese\nJack Hobbs\nJoseph McGrath\nStarring \tJohn Cleese\nArthur Lowe\nRon Moody\nConnie Booth\nStratford Johns\nDenhold Elliot\nMusic by \tIvor Slaney\nRelease date(s) \t1979\nRunning time \t55 minutes\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0076770/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0076770/&lt;/a&gt;","torrent":{"xt":"urn:btih:28b0a356073f83c76a7540e4a5d4d9836bbaa440","amp;dn":"The+Strange+Case+of+the+End+of+Civilization+as+We+Know+It+%5B1977%2C","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"28b0a356073f83c76a7540e4a5d4d9836bbaa440","infoHashBuffer":{"type":"Buffer","data":[40,176,163,86,7,63,131,199,106,117,64,228,165,212,217,131,107,186,164,64]},"announce":[],"urlList":[]}}