{"title":"Elements Defender v1.2 (Free Shopping) Android ","uid":10391027,"size":100494227,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:28b4a2fc2c446d0aac0109fab675ceef1a7e9178&amp;dn=Elements+Defender+v1.2+%28Free+Shopping%29+Android+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":".BONE.","files":-1,"time":1403196064,"description":"LANGUAGE: English\nOS: Android\n\nOverview:\n\nThe most expected and popular top notch 3D visual feast!\n\nOn the continent of Palantiria, ancient wizard masters crafted a Magicrystal that possess powerful elemental energy. It keeps the energy of the continent in balance. However, an evil force came at work from the shadows. Their goal is to destroy the Magicrystal, and seize the control over the land. Young warrior, your duty is to protect the Magicrystal and defeat the incoming enemies. Are your ready for the challenge?\n\n&quot;Featured as Today's Best Apps&quot; --- From Appadvice\n&quot;Giving Elements Defender 3D a style of gameplay that is reminiscent of action RPGs like Torchlight 1 and 2&quot; --- From gamezebo\n&quot;Their teams self made gaming engine looks beautiful and the game plays just like they describe&quot; --- From Toucharcade.com\n&quot;Character animations are top class too. The real time shadow on the hero is pretty cool too&quot; --- From Toucharcade.com\n\nGame Features\n- Stunning 3D graphics; Next-gen game engine; Realistic yet Fantasy-themed lighting and shadow effects; Magnificent magic and particle effects;\n\n- A hybrid of RPG and Strategy; Defeating incoming enemies yourself, or placing defensive crystals and traps to protect the Magicrystal;\n\n- 5 Chapters and 25 Different Levels; Amazing scenario experience;\n\n- Three difficulties that challenges your limit; Higher difficulty means better item and pet loots;\n\n- Innovative character growth system and an ample tree of talents;\n\n- A wide selection of weapons that can be equipped and upgraded; Each weapon possesses a unique magical skill; Also various items to aid your combat;\n\n- Dozens of pets for your collection, and train them to reveal their hidden powers;\n\n- Hundreds of distinctive monsters that impresses you;\n\n- Challenge powerful hidden Boss and win wonderful rewards;\n\n- Dozens of Achievements for you to complete;\n\n- There are more in the game!\n\nUnpack, copy to SDCard, install with your file manager","torrent":{"xt":"urn:btih:28b4a2fc2c446d0aac0109fab675ceef1a7e9178","amp;dn":"Elements+Defender+v1.2+%28Free+Shopping%29+Android+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"28b4a2fc2c446d0aac0109fab675ceef1a7e9178","infoHashBuffer":{"type":"Buffer","data":[40,180,162,252,44,68,109,10,172,1,9,250,182,117,206,239,26,126,145,120]},"announce":[],"urlList":[]}}