{"title":"2 Stand Alone novels by Brian Haig (ePub Retail)","uid":8367097,"size":1128303,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2907dc7093e2f63fdbf7b6d91b676882dbde6d07&amp;dn=2+Stand+Alone+novels+by+Brian+Haig+%28ePub+Retail%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TxJag","files":6,"time":1365800083,"description":"Brian Haig is the son of former US Secretary of State Alexander Haig and has been born and bred in the American military. Since retiring from duty and has been a special advisor to the Joint Chiefs of Staff and now runs a large Helicopter company.\n\nThe Capitol Game: It was the deal of the decade, if not the century. A small, insignificant company on the edge of bankruptcy had discovered an alchemist's dream; a miraculous polymer, that when coated on any vehicle, was the equivalent of 30 inches of steel. With bloody conflicts surging in Iraq and Afghanistan, the polymer promises to save thousands of lives and change the course of both wars. \n\nJack Wiley, a successful Wall Street banker, believes he has a found a dream come true when he mysteriously learns of this miraculous polymer. His plan: enlist the help of the Capitol Group, one of the country's largest and most powerful corporations in a quick, bloodless takeover of the small company that developed the polymer. It seems like a partnership made in heaven...until the Pentagon's investigative service begins nosing around, and the deal turns into a nightmare. Now, Jack's back is up against the wall and he and the Capitol Group find themselves embroiled in the greatest scandal the government and corporate America have ever seen...\n\nThe Hunted: New York Times bestselling author Brian Haig delivers his a thriller inspired by a true story about one man running between two countries, trying desperately to escape his past.\n\nIn 1987, Alex Konevitch was thrown out of Moscow University for &quot;indulging his entrepreneurial spirit.&quot; But by 1991, he was worth $300 million. On track to become Russia's wealthiest man, he makes one critical mistake: he hires the former deputy director of the KGB to handle his corporate security. And then his world begins to fall apart. Kidnapped, beaten, and forced to relinquish his business and his fortune, Alex and his wife escape to the United States, only to be accused by his own government of stealing millions from his business. With a mob contract out on his life and the FBI hot on his trail, Alex is a desperate man without a country-facing the ultimate sacrifice for the chance to build a new life for himself and his family.\n\nFull Retail ePub. Calibre and eReader ready. Metadata is complete\n &lt;a href=&quot;\nhttps://thepiratebay.se/torrent/7721888/Sean_Drummond_Series_(ePub__Mobi__AZW3_Retail)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.se/torrent/7721888/Sean_Drummond_Series_(ePub__Mobi__AZW3_Retail)&lt;/a&gt;","torrent":{"xt":"urn:btih:2907dc7093e2f63fdbf7b6d91b676882dbde6d07","amp;dn":"2+Stand+Alone+novels+by+Brian+Haig+%28ePub+Retail%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2907dc7093e2f63fdbf7b6d91b676882dbde6d07","infoHashBuffer":{"type":"Buffer","data":[41,7,220,112,147,226,246,63,219,247,182,217,27,103,104,130,219,222,109,7]},"announce":[],"urlList":[]}}