{"title":"The Health Wyze Report - Episode 27","uid":8239610,"size":26149486,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:2921f1b6ab98190205f06548fdc27d51623c0860&amp;dn=The+Health+Wyze+Report+-+Episode+27&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mandalasarah","files":-1,"time":1362936277,"description":"For God and Country\n\nWe discuss the importance of buying products that are manufactured in ethical nations. We describe the silent economic warfare by the communists, and how it is happening right under our noses. It is process through which the Republics of the West will be overthrown using only economic means. We explain how this is responsible for the economic collapses throughout the industrialized world. Their infiltration in our educational system has deceitfully convinced the current generation of young adults that a parasitic society is healthy and productive. We describe the crucial historic role of Christianity in producing strong, moral nations. We explain how socialism is a type of institutionalized sociopathology, and we talk about the deception by treacherous manufacturers who falsely market that they employ domestic workers.\n\nWe report on a case in which cannabis (marijuana) was portrayed by the media and medical establishment to be more harmful than chemotherapy. We elaborate on some of the side effects of chemotherapy that effect survivors. We describe the manipulation attempts that are used by critics of marijuana use. We mention fluoride, and how it actually causes cavities. We then discuss the moral implications of forced medicating using the water supply.\n\nFor more information, health information, or to browse the complete audio archive, then visit us at: http://healthwyze.org","torrent":{"xt":"urn:btih:2921f1b6ab98190205f06548fdc27d51623c0860","amp;dn":"The+Health+Wyze+Report+-+Episode+27","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2921f1b6ab98190205f06548fdc27d51623c0860","infoHashBuffer":{"type":"Buffer","data":[41,33,241,182,171,152,25,2,5,240,101,72,253,194,125,81,98,60,8,96]},"announce":[],"urlList":[]}}