{"title":"Noi vivi - Addio Kira! (1942)  We the Living","uid":10724595,"size":1468106752,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:29286a5956a915af96e0779d3e00a60654551bed&amp;dn=Noi+vivi+-+Addio+Kira%21+%281942%29++We+the+Living+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pg168","files":2,"time":1407541149,"description":"The time is the Russian Revolution. The place is a country burdened with fear - the midnight knock at the door, the bread hidden against famine, the haunted eyes of the fleeing, the grublike fat of the appeasers and oppressors. In a bitter struggle of the individual against the collective, three people stand forth with the mark of the unconquered in their bearing: Kira, who wants to be a builder, and the two men who love her - Leo, an aristocrat, and Andrei, a Communist. In their tensely dramatic story, Ayn Rand shows what the theories of Communism mean in practice. We the Living is not a story of politics but of the men and women who have to struggle for existence behind the Red banners and slogans. It is a picture of what dictatorship - of any kind - does to human beings, what kind of men are able to survive, and which of them remain as the ultimate winners. What happens to the defiant ones? What happens to those who succumb? Who are the winners in this conflict? Against a vivid panorama of political revolution and personal revolt, Ayn Rand offers an answer that challenges the modern conscience.","torrent":{"xt":"urn:btih:29286a5956a915af96e0779d3e00a60654551bed","amp;dn":"Noi+vivi+-+Addio+Kira%21+%281942%29++We+the+Living+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29286a5956a915af96e0779d3e00a60654551bed","infoHashBuffer":{"type":"Buffer","data":[41,40,106,89,86,169,21,175,150,224,119,157,62,0,166,6,84,85,27,237]},"announce":[],"urlList":[]}}