{"title":"Plague Inc: Evolved v0.7.3 (2-click run)","uid":10221809,"size":147070155,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:293aedbaf5255fdde0b325cdd12a413348d2ca3c&amp;dn=Plague+Inc%3A+Evolved+v0.7.3+%282-click+run%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"The_Duck1","files":-1,"time":1401053087,"description":"No need for serials and cracks to get the full version, (already done it for you).\nNo unnecessary registry changes. \nNo boring installation of tool-bars in your browser or other unwanted things.\nYou can even run this torrent from an USB-Stick.\nEasy Uninstall with the Windows control panel.\nChoose where you want to put the files on your PC. \nThese are a few things that makes a 'Easy Run' version a better version.\n\nIf everybody seeds, you will get higher downloading speeds.\n\nDESCRIPTION:\nPlague Inc. is a simulation game, where the objective is to kill all humans on\nEarth with a disease. It is similar in design to the Pandemic series of browser\ngames. The game offers various types of plagues, such as Bacteria, Virus,\nFungus all with their own characteristics. The disease is not controlled\ndirectly, but can be evolved to desired attributes. At some point the disease\nwill be discovered, and humanity will start working on a cure. The game will\nonly be won if all humans in all countries are dead. It is important to balance\nthe infectivity, severity, and lethality of the plague. The game also contains\na lot of information on different aspects of diseases.\n\n\nPlague Inc: Evolved - Update 0.7.3 full change log:\n\nNew additions:\n*Added 4 new scenarios, along with several new achievements\n*New cheats and cheat functionality (use multiple cheats at the same time, on any disease type)\n*New endgame screens added\n*Portuguese, Spanish &amp; Italian languages added\n\nTweaks:\n*Major update to game engine &amp; events to fix a number of gameplay/event issues.\n*Space positioning of some UI elements (so translations work better).\n*Added pulsing feature to minimap in Necroa Virus\n\nFixes:\n*Number of typos and XML errors fixed.\n*Fixed issue where expanded information for countries not displaying\n\n\nInstallation instructions:\n1. Execute the .exe file.\n2. Follow the instructions.\n3. Enjoy the program.","torrent":{"xt":"urn:btih:293aedbaf5255fdde0b325cdd12a413348d2ca3c","amp;dn":"Plague+Inc%3A+Evolved+v0.7.3+%282-click+run%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"293aedbaf5255fdde0b325cdd12a413348d2ca3c","infoHashBuffer":{"type":"Buffer","data":[41,58,237,186,245,37,95,221,224,179,37,205,209,42,65,51,72,210,202,60]},"announce":[],"urlList":[]}}