{"title":"Grey Wolf: The Escape of Adolf Hitler - Simon Dunstan (mobi)","uid":7000823,"size":11569842,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:297d13c052a37e399c6cb24f284687ba86466226&amp;dn=Grey+Wolf%3A+The+Escape+of+Adolf+Hitler+-+Simon+Dunstan+%28mobi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Lucybabe","files":4,"time":1328049427,"description":"Grey Wolf: The Escape of Adolf Hitler - Simon Dunstan (mobi retail)\n\n\nDid Hitler (code name Grey Wolf) really die in 1945? The evidence says no. Heres the gripping story of what might have happened... When Truman asked Stalin in 1945 whether Hitler was dead, Stalin replied bluntly, No. As late as 1952, Eisenhower declared: We have been unable to unearth one bit of tangible evidence of Hitler's death. What really happened? Simon Dunstan and Gerrard Williams have compiled extensive evidence, some recently declassified, that Hitler actually fled Berlin and took refuge in a remote Nazi enclave in Argentina. The recent discovery that the famous Hitler's skull in Moscow is female, as well as newly uncovered documents, provide powerful proof for their case. Dunstan and Williams cite people, places and dates in over 500 detailed notes that identify the plan's escape route, vehicles, aircraft, U-boats and hideouts. Among the details: the CIA's possible involvement and Hitler's life in Patagonia, including his two daughters. \n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:297d13c052a37e399c6cb24f284687ba86466226","amp;dn":"Grey+Wolf%3A+The+Escape+of+Adolf+Hitler+-+Simon+Dunstan+%28mobi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"297d13c052a37e399c6cb24f284687ba86466226","infoHashBuffer":{"type":"Buffer","data":[41,125,19,192,82,163,126,57,156,108,178,79,40,70,135,186,134,70,98,38]},"announce":[],"urlList":[]}}