{"title":"Democracy Now - 09 feb 2012","uid":7020276,"size":450975506,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:298677a40748b8438fdf126b096132f8052d8096&amp;dn=Democracy+Now+-+09+feb+2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1328814021,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Feb 09, 2012\n\n- U.S., Banks Reach $26 Billion Settlement for Mortgage Abuses\n- Pakistan: Taliban Leader Among 4 Killed in U.S. Drone Strike\n- Hundreds Killed in Syria as Arab League Monitors Plan Return\n- Bahraini Activists Prepare for Protests' 1st Anniversary\n- Iraq Vows Crackdown on Private Military Firms\n- U.S. Military Scales Back Bases in Japan, Guam; Seeks Expanded Presence in Philippines\n- House to Vote on Weakened Ethics Rules\n- Romney: Rivals &quot;Act Like Democrats&quot;\n- Gingrich Warns Ohioan Voters of Deadly &quot;Iranian Nuclear Weapon&quot;\n- Washington Set to Back Same-Sex Marriage\n- Civil Rights Activist Patricia Stephens Due Dies at 72\n\n\nSpecial reports\n\n- Coup in Maldives: Adviser to Ousted Pres. Mohamed Nasheed Speaks Out from Hiding as Arrest Sought\n\nThe first democratically elected president of the tiny Indian Ocean state of Maldives, Mohamed Nasheed, has been ousted in what he has described as a coup d'ÃƒÂ©tat at gunpoint. A longtime pro-democracy activist who was jailed for six years, Nasheed has achieved international prominence as a leading campaigner to save island nations from global warming. Earlier today, Nasheed said an arrest warrant has been issued for him following two days of street protests against the coup. We speak with Paul Roberts, who served as Nasheed's communications adviser and was with him on the day of the coup. Roberts says he fears a warrant has been issued for his own arrest and speaks to us from an undisclosed location.\n\n\n- Ousted Maldives Pres. Mohamed Nasheed a Leading Voice for Island States Threatened by Global Warming\n\nFor years, Mohamed Nasheed was the most vocal world leader on the threat climate change poses to residents of small island states. After becoming the first democratically elected president in Maldives, he pledged to make the nation the first carbon neutral country and once held a cabinet meeting underwater. We discuss Nasheed's ouster and his outspoken campaigning on global warming with environmental activist Bill McKibben, whose group 350.org has collected some 30,000 signatures on a petition in support of Nasheed. We also speak with Jon Shenk, director of the new documentary film, &quot;The Island President,&quot; which chronicles Nasheed's rise from jailed pro-democracy activist to the Maldives presidency and island-state champion. McKibben says Nasheed &quot;was in certain ways the first precursor of the Arab Spring, the 'Mandela of the Indian Ocean,' who really brought democracy to a country where it hadn't been before,&quot; as well as &quot;the most outspoken head of state around the issue of climate change on our planet.&quot; McKibben further argues Nasheed, &quot;was a thorn in the side [of the U.S.] because he kept bringing up the topic of climate change, a topic they're not that keen on. On the other hand, he - almost to a fault - was cooperative with U.S. efforts about climate change. The State Department owes him and I hope that they take this seriously.&quot;\n\n\n- LGBTQ Rights Activists on Victories for Marriage Equality in California and Washington\n\nWashington state is set to become the seventh state to legalize gay marriage following a vote in the State House. The vote came just a day after a U.S. appeals court ruled California's ban on same-sex marriage, known as Proposition 8, is unconstitutional. We discuss marriage equality with Josh Friedes of Equal Rights Washington; Rick Jacobs of Courage Campaign; and Kalil Cohen, a transgender community organizer based in Los Angeles. Jacobs says the Prop. 8 fight &quot;has supercharged the entire movement for full equality, and has, pushed people like me to be much more comfortable talking about transgender issues that I didn't really pay that much attention to before.&quot; Cohen, meanwhile, is critical of the LGBTQ community's emphasis on gay marriage, saying: &quot;My biggest concern is how much resources in the LGBTQ movement t have been funneled towards marriage equality alone, and away from basic survival [issues] that a lot of LGBTQ people still face such as lack of access to education, healthcare, housing, and criminal justice reform. These are issues that have really taken a backseat to marriage equality, and that has harmed the most vulnerable members of our community.&quot;\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:298677a40748b8438fdf126b096132f8052d8096","amp;dn":"Democracy+Now+-+09+feb+2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"298677a40748b8438fdf126b096132f8052d8096","infoHashBuffer":{"type":"Buffer","data":[41,134,119,164,7,72,184,67,143,223,18,107,9,97,50,248,5,45,128,150]},"announce":[],"urlList":[]}}