{"title":"Andy Kasch - Torian Reclamation [1-3]","uid":12860662,"size":516014593,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:2a076abe1c22e33a0cccd5836ea7b0a839e2e83c&amp;dn=Andy+Kasch+-+Torian+Reclamation+%5B1-3%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Cybotage","files":3,"time":1448732687,"description":"Two thousand years ago, a superior race of beings from a planet known only as Erob contacted dozens of advanced worlds in a wide section of the galaxy they chose to exert influence over. The inhabitants of these planets were all invited to join in a coalition, being offered assured peace and prosperity in exchange for the incorporation of Erob moral law into their societies. Motivated at least partly by fear over the power and technology possessed by the vastly superior Erobs, there were no dissenters.\r\n\r\nThe Erob coalition was formed. Female members of each race were taken and impregnated by the Erobs, then returned to their respective worlds to give birth to a race of Erob half-breeds who would teach the laws on each member world. Erob interstellar travel technology was freely shared with all coalition planets, and so an era of space travel and cultural expansion ensued in what became known as the Erobian Sphere.\r\n\r\nThen, the Erobs abruptly broke off all communication with the coalition worlds. That was more than 1900 years ago. The coalition members have, for the most part, continued to abide by the original agreement—until now. Things are starting to change in the Erobian Sphere. An infection is beginning to spread, much to the chagrin of the half-breed races who are desperately calling for a return to the old ways or face possible annihilation as a result. Only a few seem to be listening to their pleas.\r\n\r\nThe Tora star system is a coalition member whose fate now rests on the Torians' ability to stave off the infection. Sadly, they fail to realize it was their adherence to a strict set of ethical standards that was the driving force behind the highly revered cultural advancements of their twin worlds. Cardinal-4, the illustrious and magnificent 80-story Torian space station, represents the pride of their achievements and is the talk of the coalition.\r\n\r\nOne of the problems now facing Tora is the no-longer-ignorable existence of sizable cryonic preservation networks containing species collected from underdeveloped worlds, which were amassed during the peak of their space exploration era. They were taken over a 55-year period and have been kept in preservation for decades. Political developments now force the Torians to address the resuscitation of these species, who have been swept under the proverbial rug with the label of science research project far too long. The largest of these collections is an intelligent race of beings from a planet called Earth that lies just outside the Erobian Sphere.\r\n\r\nAs the Earthlings begin to be revived, they find few friends and powerful foes. In addition, their awakenings coincide with the first interstellar wars and the arrival of the infection to the Torian home worlds. They will be tested, along with all inhabitants of the Erobian Sphere, and will be forced to discover for themselves whether they are an asset or a liability to the crisis they find themselves thrust into.\r\n\r\n\r\n01 - Test of Magnitude\r\n02 - Flash Move\r\n03 - Test of Fortitude\r\n\r\n\r\nRead by James Killavey\r\nFormat: M4A\r\nBitrate: 32 Kbps\r\nUnabridged","torrent":{"xt":"urn:btih:2a076abe1c22e33a0cccd5836ea7b0a839e2e83c","amp;dn":"Andy+Kasch+-+Torian+Reclamation+%5B1-3%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a076abe1c22e33a0cccd5836ea7b0a839e2e83c","infoHashBuffer":{"type":"Buffer","data":[42,7,106,190,28,34,227,58,12,204,213,131,110,167,176,168,57,226,232,60]},"announce":[],"urlList":[]}}