{"title":"Danelle Harmon - The Wild One (De Monforte Brothers #1)","uid":10473462,"size":1700308,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2a86e548debd2585181e5277ddafe47e387ea908&amp;dn=Danelle+Harmon+-+The+Wild+One+%28De+Monforte+Brothers+%231%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":6,"uploader":"taylorman","files":1,"time":1404289342,"description":"The bluest of blood; the blackest of rogues; the de Montforte Brothers will take your breath away -- meet Lord Gareth:\n\n&quot;They call me The Wild One, and for good reason. The devil only knows whether or not I am husband material. But I do know one thing. I will do anything to win Juliet's love... and to be the husband and father -- the man -- I know it is within me to be.&quot; Lord Gareth de Montforte, Blackheath Castle, Berkshire, England, 1776\n\nLord Gareth de Montforte is known as an irresponsible rake with a heart of gold. When he thwarts a stagecoach robbery, he is stunned to discover that the beautiful young woman he has heroically rescued, Juliet Paige, is his deceased brother's fiancee, accompanied by her infant daughter. Despite his family's refusal to acknowledge Juliet, Gareth is determined to do right by the courageous woman who crossed an ocean to give her baby the name she rightfully deserves.\n\nAs a practical American woman, Juliet is wary of marrying this black sheep aristocrat, yet she is hopelessly charmed by the dashing devil. Never has she met anyone who embraces life so thoroughly, who makes her laugh, who loves her so well. And, even when it seems the odds are against them, Juliet has absolute faith that Gareth will go beyond the call of duty to give her and her daughter a home -- and a love that will last a lifetime\n &lt;a href=&quot;\nhttps://d.gr-assets.com/books/1304878466l/1955837.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://d.gr-assets.com/books/1304878466l/1955837.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:2a86e548debd2585181e5277ddafe47e387ea908","amp;dn":"Danelle+Harmon+-+The+Wild+One+%28De+Monforte+Brothers+%231%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a86e548debd2585181e5277ddafe47e387ea908","infoHashBuffer":{"type":"Buffer","data":[42,134,229,72,222,189,37,133,24,30,82,119,221,175,228,126,56,126,169,8]},"announce":[],"urlList":[]}}