{"title":"Chronicles of Dinosauria - Dave Woetzel","uid":11773178,"size":9758020,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2bf005430c728a01155d3094ab4601b0d925e89c&amp;dn=+Chronicles+of+Dinosauria+-+Dave+Woetzel&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"starxteel","files":1,"time":1427157532,"description":"\nExplore legends, mythical sightings, and intriguing explorations from around the globe!\n\n-Enjoy the unique combination of visual illustrations and unforgettable accounts.\n-Discover why the author calls into question what we've been taught to believe and understand about the history of dinosaurs and man.\n\nEvery legend is said to include some grain of truth, and for years co-author Dave Woetzel has sought to separate fact from fiction as he explores mysteries related to dinosaurs, mankind's history, and the biblical time-line. Teaming with artist and designer Richard Dobbs, the two have created a visual archive of expeditions and intriguing clues to explore, all of which highlight the connection to the authority and reliability of scripture.\n\nProvocative artifacts from around the world are examined in an exquisite, full-color book that hints at man's familiarity with living dinosaurs. Studies point to more than simple answers beneath the waves of Loch Ness, and other sites around the world, many investigated personally by the author. Here is the study of cryptozoology and the discoveries that seem to defy all evolutionary time-lines, vividly illustrated and filled with rare photos.\n\n\nAbout the author:\n&quot;Dino Dave&quot; Woetzel was privileged to grow up in a Christian home and, as a child, accepted Christ as his personal Savior. He was fascinated with dinosaurs at an early age and grew to love science. Dave graduated from Bob Jones University in 1987 with a Bachelor's of Science Degree. He currently resides with his wife Gloria and two children in Concord, New Hampshire, where he is the president of CCR Data Systems, a technology firm.\n\nDave has had numerous opportunities to speak on the topic of Science and the Bible around the world. In 1999 Dave started the Genesis Park website which showcases evidence that men and dinosaurs coexisted, much of which is now included in this book.\n\nHe has also spearheaded some fascinating expeditions that have earned him the nickname &quot;Dino Dave.&quot; These include a trip into the unexplored African rainforest of Cameroon; travel to a remote volcanic island in Papua New Guinea; an expedition up the Amazon through the Madidi River in Bolivia; an investigation into the swamps of Lake Bangweulu, Zambia; research at Scotland's Loch Ness; pursuit of swimming monsters in Lake Champlain and Lake Okanagan in North America; and research on Lake Nahuel Haupi in South America","torrent":{"xt":"urn:btih:2bf005430c728a01155d3094ab4601b0d925e89c","amp;dn":"+Chronicles+of+Dinosauria+-+Dave+Woetzel","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2bf005430c728a01155d3094ab4601b0d925e89c","infoHashBuffer":{"type":"Buffer","data":[43,240,5,67,12,114,138,1,21,93,48,148,171,70,1,176,217,37,232,156]},"announce":[],"urlList":[]}}