{"title":"Science Fiction Theatre (1956) s02e17","uid":14367731,"size":84462517,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:2bf0cd93d8e75da3c615e16b90935cfefae74ddc&amp;dn=Science+Fiction+Theatre+%281956%29+s02e17&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"loninappleton","files":2,"time":1461130448,"description":"Science Fiction Theatre  (1955 to 1957)  with host Truman Bradley\r\n\r\nAll episodes approximately 25 minutes run time.\r\n\r\nEpisode 57 on the DVD Disc Six\r\n\r\nSeason Two\r\n\r\n2-17 \tLiving Lights \tAugust 25, 1956\r\n\r\n   Skip Homeier, Joan Sinclair, Michael Garth \r\n\r\n   A graduate student attempts to reproduce the conditions on the surface of Venus in a large bell jar. His experiment results in the creation of a ball of light that acts like a living being. A curious student inadvertently allows it to escape. It returns and others appear. They seem to be trying to attack people with ultra violet light. He destroys them by increasing the vacuum in the bell jar until it explodes. He resolves to try again under more secure conditions with the full support of the university.\r\n\r\nDescription of the series\r\n\r\nBlending the discoveries of factual science with the limitless frontiers of fantasy, Science Fiction Theatre offered Atomic Age television viewers an intriguing look at the possibilities science could provide us in the near future as well as the immediate present. Airing from 1955 to 1957 and hosted by Truman Bradley, Science Fiction Theatre's seventy-eight episodes presented its intelligent and fantastic stories in an anthology format.\r\n\r\nMy notes\r\n\r\n  This was a recent acquisition of my library.  They are half hour episodes and there's a wiki for the details.\r\n\r\n  But the wiki or synopses cannot describe this picture of the 1950's adequately except in the viewing.  SFT is an unique blend of science fact such as the children's program Mr Wizard with Don Herbert provided for youngsters and science fiction 'from the edge of tomorrow' as the show puts it.\r\n\r\n  In it's 78 episodes most every familiar face from television appears.  If you remember that time you can play along and either remember or wait for the credits to see the names.  Vera Miles appears in one.  And Marie Windsor with Don Defore.  Warren Stevens from &quot;Forbidden Planet&quot; {but not Jack Kelly or Ann Francis).\r\n\r\n  Concurrent with my viewings of SFT,  I was watching the Tribune Company's new series &quot;Manhattan&quot;'  It is both a contrast and a parallel \r\nviewing experience to see the period costumes in Manhattan and the every day dress in SFT.\r\n\r\n  Your host Truman Bradley will tell you that &quot;This has been a story of fiction, it did not happen&quot;.  But it is indeed hard to believe that the mention of LSD occurs in one episode of a program made in the mid 1950's.\r\n\r\n  Imagine being a youngster who goes into science because of such a show.  I can, but I was maybe a year or two too young to have that effect.  I would have been eight or nine.\r\n\r\n  SFT is available as a full DVD box.  It is a worthwhile collection to have as historical material for a time when science was at the forefront of the American imagination and in the Cold War.\r\n\r\n   It is available from Timeless Media Group,  the same company which released &quot;Johnny Staccato&quot;  with John Cassavetes (also in my collection of fileshares.)\r\n\r\n   I will do this as single episodes.  The disclaimer tells us that these transfers were made from the best available media.  You will see some variation as the series progresses.\r\n\r\n   See the wiki for more on this captivating series and share with others on your indexes","torrent":{"xt":"urn:btih:2bf0cd93d8e75da3c615e16b90935cfefae74ddc","amp;dn":"Science+Fiction+Theatre+%281956%29+s02e17","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2bf0cd93d8e75da3c615e16b90935cfefae74ddc","infoHashBuffer":{"type":"Buffer","data":[43,240,205,147,216,231,93,163,198,21,225,107,144,147,92,254,250,231,77,220]},"announce":[],"urlList":[]}}