{"title":"Michael Franti's - I Know I'm Not Alone, a musicians journey t","uid":6508026,"size":651579274,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2bf730d20d0631d307f3f27390247520b56b7043&amp;dn=Michael+Franti%5C%27s+-+I+Know+I%5C%27m+Not+Alone%2C+a+musicians+journey+t&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"satoriforsale","files":-1,"time":1309530381,"description":"I Know I'm Not Alone is a documentary by singer-songwriter and political activist Michael Franti. It features footage of Iraq, the Palestinian territories, and Israel. Franti decided to embark on this three week journey with friends to view the cost of war in the Middle East first-hand. Franti states, &quot;This film came out of my frustration with watching the nightly news and hearing generals, politicians, and pundits explaining the political and economic cost of the war in the Middle East, without ever mentioning the human cost. I wanted to hear about the war by the people affected by it most: doctors, nurses, poets, artists, soldiers, and my personal favorite, musicians.&quot; The film aims to speak multiple generations and to give people a better understanding of the people who still live in war-torn countries. He did not embark on the trip for the film with any special government groups or organizations, but instead bought plane tickets and headed off to Iraq, the Palestinian territories, and Israel armed with nothing more than his guitar and an extreme passion for music and a love of people. He says, &quot;When I first had the idea for this journey, I had no idea how to get to Iraq and almost no idea how to make a film. After discovering that all you need to get into Iraq is a plane ticket, I prayed that movie making would be that simple...&quot;\n\n\n(source Wikipedia)","torrent":{"xt":"urn:btih:2bf730d20d0631d307f3f27390247520b56b7043","amp;dn":"Michael+Franti%5C%27s+-+I+Know+I%5C%27m+Not+Alone%2C+a+musicians+journey+t","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2bf730d20d0631d307f3f27390247520b56b7043","infoHashBuffer":{"type":"Buffer","data":[43,247,48,210,13,6,49,211,7,243,242,115,144,36,117,32,181,107,112,67]},"announce":[],"urlList":[]}}