{"title":"EnigmaT Set Rips { Cuts } - September 15th, 2013","uid":8920313,"size":687540398,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2e9861dca63e2de76781eb1cf93d45eea354ca12&amp;dn=EnigmaT+Set+Rips+%7B+Cuts+%7D+-+September+15th%2C+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EnigmaT","files":64,"time":1379237728,"description":"Above &amp; Beyond feat. Jeff Buckley - Tongue of God (ABGT 045 Rip)-enTc.mp3\nAce Ventura - Presence (Daniel Lesden Remix) (Cut From Mueller Set)-enTc.mp3\nAlex Ender &amp; Alter Future - Egypitian Euphoria (Original Mix) (Cut From Alen&amp;Envy Set)-enTc.mp3\nAlex Wackii - Budapest (Sound of Cream Anthem) (Cut From Nadz Set)-enTc.mp3\nAllen &amp; Envy feat Julie Harrington - Always (Original Mix) (Cut From Alen&amp;Envy Set)-enTc.mp3\nAndre Sobota - Absolute (ABGT 045 Rip)-enTc.mp3\nAnthony Lichiere - Get Back Together (Cut From Solarstone Set)-enTc.mp3\nBlue Shift &amp; Senia - Reach Out To Love (Rene Ablaze Dub Mix) (Cut From Nadz Set)-enTc.mp3\nBrian Laruso - Selina (Original Mix) (Cut From Shah Set)-enTc.mp3\nCharles McThorn - Oxydizing (Original Anthem Mix) (Cut From Alen&amp;Envy Set)-enTc.mp3\nCharles McThorn - Oxydizing (Original Anthem Mix) (Cut From Nadz Set)-enTc.mp3\nCloudwalker - Phoenix (Sam Slim Remix) (Cut From Alen&amp;Envy Set)-enTc.mp3\nCloudwalker - Phoenix (Sam Slim Remix) (Cut From Bobina Set)-enTc.mp3\nCosmic Heaven - Inspiration (Etasonic Remix) (Cut From NorthPole Set)-enTc.mp3\nDave Winnel &amp; Chris Arnott - Remember To Breathe (FTampa Remix) (Cut From Tydi Set)-enTc.mp3\nDennis Shepherd Feat. Cold Blue - FreeFalling (2013 Club Mix) (Cut From Tydi Set)-enTc.mp3\nDuKa - Joining (Johlin's 138 Mix) (Cut From Turner Set)-enTc.mp3\nEssonita feat. K.I.R.A - Tonight (Stonewave &amp; Alex Blest Remix) (Cut From Sunset Set)-enTc.mp3\nEssonita feat. K.I.R.A. - Tonight (Stonewave &amp; Alex Blest Remix) (Cut From Photographer Set)-enTc.mp3\nEvave - Talk To Me (Outlook Remix) (Cut From Shah Set)-enTc.mp3\nFirebird vs Fred Baker - Lost In My Mind (Purple Stories Remix) (Cut From Bin Fin Set)-enTc.mp3\nFrench Skies - Blaster (Stephane Badey Remix) (Cut From NorthPole Set)-enTc.mp3\nG8 - Escape (Parametric Mind! Remix) (Cut From NorthPole Set)-enTc.mp3\nGlideslope - Pyramid (Cut From Sunchild Set)-enTc.mp3\nID feat. ID - ID (Sunset Remix) (Cut From Alen&amp;Envy Set)-enTc.mp3\nIllusion - Chronicles (Original Mix) (Cut From Turner Set)-enTc.mp3\nImagine Dragons - Radioactive (George Acosta Remix) (Cut From Tydi Set)-enTc.mp3\nJohn Look - What's Next (Original Mix) (Cut From GO Set)-enTc.mp3\nJoseph Loduca - No Life Without You (Original Mix) (Cut From Turner Set)-enTc.mp3\nJoyce Muniz - Sleepless (Cut From Config Set)-enTc.mp3\nKaranda - Kingpin (Cut From Wandii Set)-enTc.mp3\nKukuzenzo feat. Al Jet - Beyond the Worlds (Kheiro &amp; Medi Dub Mix) (Cut From Sunchild Set)-enTc.mp3\nLee Miller - Black Light (Original Mix) (Cut From Above Clouds Set)-enTc.mp3\nLostly feat Roberta Harrison - These Streets (Allen &amp; Envy Remix) (Cut From Alen&amp;Envy Set)-enTc.mp3\nMatson - Hold Back (Original Mix) (Cut From Bukovski Set)-enTc.mp3\nMaximus Bellini - Last Try (Cut From Tydi Set)-enTc.mp3\nMeramek - Feeling (ABGT 045 Rip)-enTc.mp3\nMichael Brun - Halfway (ABGT 045 Rip)-enTc.mp3\nMindflower - Sound Like a Melody (Imperfect Hope Remix) (Cut From NorthPole Set)-enTc.mp3\nMoonhare - Odysseia (Matt Farmer Remix) (Cut From Sunset Set)-enTc.mp3\nMorvan - Only Forever (Original Mix) (Cut From Bukovski Set)-enTc.mp3\nMorvan - Spartacus (tranzLift Remix) (Cut From Above Clouds Set)-enTc.mp3\nNew World - ID (Cut From Receptive Set)-enTc.mp3\nNine Gates - Odyssey (Ico Remix) (Cut From Above Clouds Set)-enTc.mp3\nOrjan Nilsen - Mercer (ABGT 045 Rip)-enTc.mp3\nPaul Rudd Feat. Sam Calver - Wake The World Tonight (Timothy Allan &amp; Mark Loverush Remix) (Cut From Shah Set)-enTc.mp3\nPaul Webster &amp; Eddie Bitar - Meloque (Cut From Webster Set)-enTc.mp3\nPM AttitudE - White Night (M.I.S.H &amp; Eric Alamango Remix) (Cut From JP Bates Set)-enTc.mp3\nReceptive &amp; New World - ID (Original Mix) (Cut From Receptive Set)-enTc.mp3\nRicardo van Valker - Chemical Imbalance (Matt Holliday Remix) (Cut From Solarstone Set)-enTc.mp3\nRogier de Kreuk - Is There Anybody Out There (ABGT 045 Rip)-enTc.mp3\nSettleR - Antares (Truenorth 303Dub Mix) (Cut From Above Clouds Set)-enTc.mp3\nStephen J. Kroos - Europa (Matthijs Breijer Storyteller Remix) (ABGT 045 Rip)-enTc.mp3\nSunflare - Breaking Waves (Hiroki Nagamine Remix) (Cut From Above Clouds Set)-enTc.mp3\nSunset &amp; Myk Bee - After The Sunrise (Dub Mix) (Cut From Sunset Set)-enTc.mp3\nSunset &amp; Myk Bee - ID (Original Mix) (Set Rip)-enTc.mp3\nSunset - I Believe (Original Mix) (Cut From Sunset Set)-enTc.mp3\nThe Madison - Delhi (ABGT 045 Rip)-enTc.mp3\nThe XX - Intro (Dimitri Vegas &amp; Like Mike &amp; Sander Van Doorn Bootleg Mix) (ABGT 045 Rip)-enTc.mp3\nTime Axis - Proper T (Manuelle Lagunes Remix) (Cut From NorthPole Set)-enTc.mp3\nTritonal feat. Underdown - Follow Me Home (Instrumental Mix) (Cut From Wandii Set)-enTc.mp3\nVictor - Leave and Fly (Original Mix) (Cut From GO Set)-enTc.mp3\nVladimir An - Another Way (Cloudwalker Remix) (Cut From Rutovski Set)-enTc.mp3\nWhite Water - The Unknown (Bryan Kearney Remix) (Cut From Mueller Set)-enTc.mp3\n","torrent":{"xt":"urn:btih:2e9861dca63e2de76781eb1cf93d45eea354ca12","amp;dn":"EnigmaT+Set+Rips+%7B+Cuts+%7D+-+September+15th%2C+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e9861dca63e2de76781eb1cf93d45eea354ca12","infoHashBuffer":{"type":"Buffer","data":[46,152,97,220,166,62,45,231,103,129,235,28,249,61,69,238,163,84,202,18]},"announce":[],"urlList":[]}}