{"title":"The Hills Run Red (1967) Xvid 1cd - Western - Dan Duryea, Thomas","uid":11181813,"size":734472822,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2f1a0c5b705d65f3d98f5555b2b9221aafd897e0&amp;dn=The+Hills+Run+Red+%281967%29+Xvid+1cd+-+Western+-+Dan+Duryea%2C+Thomas&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SaM","files":-1,"time":1412868316,"description":"The Hills Run Red (1967) Xvid 1cd - Western - Dan Duryea, Thomas Humter [DDR]\n\nThe Hills Run Red (Un Fiume di dollari) is one of the earliest spaghetti westerns made after the Eastwood/Leone Italian western boom, in 1967 and directed by Carlo Lizzani. \nThe film stars Thomas Hunter in the heroic lead role, along with veteran American actors Henry Silva and Dan Duryea.\n\n    CAST:-\n    Thomas Hunter as Jerry Brewster\n    Henry Silva as Mendez\n    Dan Duryea as Getz\n    Nicoletta Machiavelli as Mary Ann\n    Gianna Serra as Hattie\n    Nando Gazzolo as Ken Seagull\n    Jeff Cameron as Randall\n    Geoffrey Copleston as Brian Horner\n    Puccio Ceccarelli as Mendez' henchman\n    Guglielmo Spoletini as Pedro\n    Mirko Valentin as Sancho\n\nDirected by Carlo Lizzani\nProduced by Luigi Carpentieri, Ermanno Donati\nMusic by Ennio Morricone\nRunning time 89 minutes\n\nSYNOPSIS:- The Hills Run Red (1967)\nIn the aftermath of the American Civil War, two rebel Texans are seen fleeing toward the Mexican border in a wagon, having made off with a huge sum of money stolen from the United States government. Just before reaching the safety of foreign soil they are intercepted by a U.S. army patrol. As the mounted soldiers close in, the men draw cards to decide who will stay on the wagon and draw the pursuit, and who will jump off with the loot and escape, keeping the other man's share safe until he can claim it. Ken Seagull (Nando Gazzolo) wins the draw, jumps off and successfully hides. Jerry Brewster (Thomas Hunter) crashes the wagon, is apprehended by the troopers, and is sent to a military prison.\n\nFive years later, Brewster is released and returns home to reunite with his wife and son. He finds his house deserted and in ruins, but discovers his wife's journal, which tells him that Seagull not only gave her no aid, but told her nothing of the money or the fact that her husband was alive. Maddened by the betrayal, the unarmed Brewster immediately finds himself under gunfire: Seagull has learned of his release and sent men to get him out of the way once and for all. Running into the barn for cover, Brewster finds a mysterious stranger (Dan Duryea) who throws him a weapon with which Brewster kills his attackers. His benefactor, who introduces himself as Winnie Getz, offers to tell Seagull that, while Brewster killed the hired gunmen, Getz himself finished their job and killed their target. The seemingly homeless Getz says he hopes to parlay that false intelligence into a steady job with Seagull.\n\nGetz goes on ahead, while Brewster (now using the name Jim Houston) follows on his quest for vengeance. Brewster soon learns that Seagull, now known as Ken Milton, has used his wealth to acquire a ranch and the services of vicious killer Garcia Mendez (Henry Silva), with whose help he has expanded his holdings by terrorizing other landowners. Brewster also learns that Seagull killed his wife, but finds his young son alive and living nearby as an orphan. The man called Houston gets a job with Mendez (while managing to stay out of sight of his employer &quot;Milton&quot;) and, with Getz's help, proceeds to play a double game wherein he rides with Mendez and his killers, but secretly aids their intended victims.\n\nEventually Brewster, with the help of his son and the surprisingly loyal Getz, confronts and kills Mendez and his men, and eventually Seagull. Afterward Getz reveals himself to be a government agent who had been on Seagull/Milton's trail all along. The government restores all property to its rightful owners, but Getz assures the authorities that the ex-convict Brewster was indeed murdered in the ambush at the empty house, freeing &quot;Houston&quot; to begin a new life with his son.\n\nTECHNICAL SPECIFICATIONS\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 448 kbps\nVideo Resolution: 640x480\nVideo Aspect Ratio: 2.353:1\nFrames Per Second: 23.976\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages: English\nRunTime 89 mins\nSubtitles: NONE\nRipped by: Trinidad [DDR]","torrent":{"xt":"urn:btih:2f1a0c5b705d65f3d98f5555b2b9221aafd897e0","amp;dn":"The+Hills+Run+Red+%281967%29+Xvid+1cd+-+Western+-+Dan+Duryea%2C+Thomas","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f1a0c5b705d65f3d98f5555b2b9221aafd897e0","infoHashBuffer":{"type":"Buffer","data":[47,26,12,91,112,93,101,243,217,143,85,85,178,185,34,26,175,216,151,224]},"announce":[],"urlList":[]}}