{"title":"The Complete Inspector Grant Mystery Collection","uid":11684601,"size":706140991,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:2f30b40fa8cb848b6f85d1220b57bface0a1eb69&amp;dn=The+Complete+Inspector+Grant+Mystery+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"davieboy1966","files":70,"time":1423265276,"description":"Audio Books : Mystery and Suspense : Other quality : English\n\n\n\nBooks 3 and 5 are from CDs and the rest were only available on Cassette tapes. Recorded either 48kbps or 32 kbps Mono Fraunhofer CBR.\nStephen Thorne narrates four of the six titles here.\n\n\n\n\n#1. The Man in the Queue (1929). [7 hrs 30 mins] read by Stephen Thorne. (32kbps)\nLondon's West End hit musical &quot;Didn't You Know?&quot; is in the last week of its run. Its newly famous star, Ray Marcable, who is London's darling, is leaving for America to seek even greater fame and fortune there. The show has been sold out for weeks, but there is a huge line (the queue of the title) outside, waiting for a chance to get same day only seats for the show. The people in line have been waiting several hours, on the whole good-naturedly, but there is considerable pushing and shoving and re-aligning as the line finally begins to move forward. When a middle-aged woman reaches the ticket booth, she indignantly turns to say something to the man who is pushing hard against her back and is horrified when he falls to the ground dead with a silver dagger sticking out of his back. No one can say when the dead man was stabbed, for the crush of the crowd has supported and carried him forward for some time. When his body is examined by the police, the young man is revealed to be carrying no identification, and has no tags or marks in his clothes. The only item of interest is a service revolver in his pocket, with fingerprints on it that prove not to be the victim's. Inspector Grant of Scotland Yard is assigned the case and the remainder of the book is an absorbing police procedural documenting the painstaking process of his quest to discover first the victim's identity and then his murderer. The search truly does become a quest for Grant, who is moved by something in the face of the victim and angered by the anonymity and callousness of his end.\n\n#2. A Shilling for Candles (1936). [6 hrs 58 mins] read by Stephen Thorne. (32kbps)\nA naive young man spends a few days with an anonymous, but rich and beautiful, female benefactor at her country cottage until he is accused of her murder after she's found dead by the seaside. Inspector Grant, of Scotland Yard, feels the additional pressure of the investigation when it's discovered that the victim was Christine Clay, a renowned and popular actress and the wife of an English aristocrat. The investigation gets even more complicated when the young and adventurous daughter of Inspector Grant's boss injects herself into helping to solve the crime. While a manhunt ensues for the young suspect, who initially evades Grant's clutches, alternative suspects do not escape his shrewd eye and, from there, Tey weaves a masterful set of sub-plots into this solid mystery. (P.W.Crabtree)\n\n#3. The Franchise Affair (1948). [7 hrs 23 mins] read by Carole Boyd. (48kbps) CD\nMarion Sharpe and her mother seem an unlikely duo to be found on the wrong side of the law. Quiet and ordinary, they have led a peaceful and unremarkable life at their country home, The Franchise. Unremarkable that is, until the police turn up with a demure young woman on their doorstep. Not only does Betty Kane accuse them of kidnap and abuse, she can back up her claim with a detailed description of the attic room in which she was kept, right down to the crack in its round window. But there's something about Betty Kane's story that doesn't quite add up. Inspector Alan Grant of Scotland Yard is stumped. It takes Robert Blair, solicitor turned amateur detective, to solve the mystery that lies at the heart of The Franchise Affair.\n\n#4. To Love and Be Wise (1950). [6 hrs 46 mins] read by Stephen Thorne. (48kbps)\nIt was rumoured that Hollywood stars would go down on their knees for the privilege of being photographed by the good-looking, brilliantly talented and ultra-fashionable portrait photographer Leslie Searle. But what was such a gifted creature doing in such an English village backwater of Salcott St Mary? And why - and how - did he disappear? If a crime had been committed, was it murder... fraud... or simply some macabre practical joke? Inspector Grant was determined to find out.\n(This audio book is rare and this is the only copy I could ever find. The tapes had a very slight echo to them that I could not eradicate, but the speech is still quite clear and listenable in my opinion.)\n\n#5. The Daughter of Time (1951). [5 hrs 21 mins] read by Derek Jacobi. (32kbps) CD\nThe title of the book is derived from a historical source, as it is attributable to Sir Francis Bacon, &quot;For truth is rightly named after the daughter of time, and not of authority.&quot; The book itself is not a traditional mystery but rather an application of deductive reasoning to an actual historical event. The event in question is the murder of the princes in the tower, sons of King Edward IV, allegedly by their uncle, Richard III, who eventually usurped the English throne after the death of his brother. It has been widely held that Richard III did, indeed, murder the two young princes, his nephews, in order to secure his claim to the throne. Scotland Yard Inspector Alan Grant, is hospitalized and recovering from injuries sustained in the line of duty. While convalescing, he becomes intrigued by a picture of a portrait of Richard III, a likeness with which he is unfamiliar. Grant is puzzled that someone with such a sensitive face could have been such a monster as to murder his two nephews in cold blood. So, our intrepid Inspector decides that he will reconsider the evidence upon which such a dastardly assumption has been based. With the help of an American researcher doing the necessary legwork, Grant compiles enough archival historical fact that incrementally helps him formulate a new theory as to who actually may have murdered the princes in the tower.\n\n#6. The Singing Sands (1952). [6 hrs 48 mins] read by Stephen Thorne. (32kbps)\nOn his train journey back to Scotland for a well-earned rest, Inspector Grant learns that a fellow passenger, one Charles Martin, has been found dead. It looks like a case of misadventure - but Grant is not so sure. Teased by some enigmatic lines of verse that the deceased had apparently scrawled on a newspaper:\n\n&quot;The beasts that talk,\nthe streams that stand,\nthe stones that walk,\nthe singing sands,\nthat guard the way to paradise...&quot;\n\nGrant follows a trail to the Outer Hebrides. And though it is the end of his holiday, it is also the beginning of an intriguing investigation into the bizarre circumstances shrouding Charles Martin's death...\n\n* Note that some of these recordings were only available from cassette tapes, that are in some cases quite old - but although the sound quality may not be pristine they are reasonably hiss free and clear.\n* No CD or Electronic Download versions of the Cassette versions here are available to my knowledge.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:2f30b40fa8cb848b6f85d1220b57bface0a1eb69","amp;dn":"The+Complete+Inspector+Grant+Mystery+Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f30b40fa8cb848b6f85d1220b57bface0a1eb69","infoHashBuffer":{"type":"Buffer","data":[47,48,180,15,168,203,132,139,111,133,209,34,11,87,191,172,224,161,235,105]},"announce":[],"urlList":[]}}