{"title":"Advanced Video Compressor 2012.0.3.8 Incl Serials - SceneDL (by ","uid":10246901,"size":5987529,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:2f4d82af6b2afd19669895032b461c4db3e4f1a0&amp;dn=Advanced+Video+Compressor+2012.0.3.8+Incl+Serials+-+SceneDL+%28by+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"susan1973","files":4,"time":1401304665,"description":"Advanced Video Compressor for Windows is the world's leading software for compressing digital video files in MPEG4 (MP4), FLV, 3GP, AVI and other popular video formats. Advanced Video Compressor (AVC) performs all video processing tasks you need to get your video files ready for for sharing or storing, convert video for portable devices.\nUse Advanced Video Compressor for a variety of personal or business purposes:\n\nSize Your Digital Video:\nAdvanced Video Compressor can reduce file size impressively - without any loss of quality. Smaller files take less space and can be uploaded and downloaded more quickly: effectively optimize videos for faster downloading from the Web, faster e-mail smaller video files - avoiding exceeding size limits. Resize video frame sizes, set any video and audio bitrates, plus more!\n\nConvert video for portable devices:\nAdvanced Video Compressor can easily convert your video files for using them on portable devices, such as a mobile phone or a media player.\nAVC can work as a powerful video converter to convert videos in MPEG4 (MP4), FLV, 3GP, AVI and other popular video formats.\n\nAdvanced Video Compressor lets you the use of 'profiles' and the batch processing mode. These features make software very easy and efficient especially for processing multiple videos. A lot of other options, such as batch renaming are also available.\n\nAdvanced Video Compressor has a very convenient and flexible user interface. All of the AVC's user interface solutions have been designed to save your time and money. Download a free trial version now! It takes just a few seconds to download and install it on your PC. All Windows versions are supported.","torrent":{"xt":"urn:btih:2f4d82af6b2afd19669895032b461c4db3e4f1a0","amp;dn":"Advanced+Video+Compressor+2012.0.3.8+Incl+Serials+-+SceneDL+%28by+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f4d82af6b2afd19669895032b461c4db3e4f1a0","infoHashBuffer":{"type":"Buffer","data":[47,77,130,175,107,42,253,25,102,152,149,3,43,70,28,77,179,228,241,160]},"announce":[],"urlList":[]}}