{"title":"Rise and Fall of the Third Reich","uid":6125306,"size":2060209418,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:2f6add9b0c8e39f6ac19c4534b63f816da57666e&amp;dn=Rise+and+Fall+of+the+Third+Reich&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"Gallant0","files":8,"time":1295916269,"description":"Review\nOne of the most important works of history of our time. --New York Times\n\nA splendid work of scholarship, objective in method, sound in judgment, inescapable in its conclusions. --New York Times Book Review \n\n\n\n\nProduct Description\nWinner of the National Book Award for Nonfiction in 1961, The Rise and Fall of the Third Reich, which has sold more copies for the Book-of-the-Month Club than any other book in the club's history, is the worldwide best-selling classic about the most infamous era of our times.\n\nSince its publication in 1960, William L. Shirer's monumental study of Hitler's German empire has been widely acclaimed as the definitive record of this century's blackest hours. The Rise and Fall of the Third Reich offers an unparalleled and thrillingly told examination of how Adolf Hitler nearly succeeded in conquering the world. \n\nShirer's unforgettable account of the pivotal characters and events of that critical era benefit from his many years as a reporter and his own personal recollections, as well as from the mass of historical documents retrieved from the German Foreign Office. The result is a brutally objective account of how Hitler wrested political control of Germany and managed to take the country with him on his mad six-year quest for world domination, only to see it go down in flames in the end. \n\nPublisher: Blackstone Audio, Inc.; MP3CD Unabridged edition (July 15, 2010) \nLanguage: English \nISBN-10: 144173421X \nISBN-13: 978-1441734211 \nProduct Dimensions: 7.5 x 5.3 x 0.6 inches \nShipping Weight: 0.3 ounces (View shipping rates and policies) \nAverage Customer Review: 4.6 out of 5 stars  See all reviews (298 customer reviews) \n298 Reviews \n5 star:    (235) \n4 star:    (35) \n3 star:    (18) \n2 star:    (4) \n1 star:    (6) \n\nRuntime - Approx 48 Hours - 80KBPS","torrent":{"xt":"urn:btih:2f6add9b0c8e39f6ac19c4534b63f816da57666e","amp;dn":"Rise+and+Fall+of+the+Third+Reich","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f6add9b0c8e39f6ac19c4534b63f816da57666e","infoHashBuffer":{"type":"Buffer","data":[47,106,221,155,12,142,57,246,172,25,196,83,75,99,248,22,218,87,102,110]},"announce":[],"urlList":[]}}