{"title":"VMware Workstation 10.0.1 Build 1379776","uid":9975539,"size":514705143,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:2fb0712fac16ee884cff89c4a299995ba0286d9e&amp;dn=VMware+Workstation+10.0.1+Build+1379776&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mindcrasher","files":-1,"time":1397687416,"description":"VMware Workstation 10 delivers best-in-class Windows 8 support, and innovative\nnew features that transform the way technical professionals work with virtual\nmachines, whether they reside on their PCs or on private enterprise clouds.\n   \n*New Operating System Support\n Support has been added for: \n-Windows 8.1\n-Windows 8.1 Enterprise\n-Windows Server 2012 R2\n-Ubuntu 13.10\nAs well as for the latest Fedora, CentOS, Red Hat and OpenSUSE releases.\n\n\n*VMware Hardware Version 10\nThis version of VMware Workstation includes VMware hardware Version 10 and is\ncompatible with vSphere 5.5. Hardware versions introduce new virtual hardware\nfunctionality and new features while enabling VMware to run legacy operating\nsystems in our virtual machines. New features included in this hardware\nversion:\n\n*16 vCPUs\nVirtual machines can now run with up to 16 virtual CPUs. This enables very\nprocessor intensive applications to be run in a virtual machine.\nNote: Running virtual machines with 16 vCPUs requires that both your host\nand guest operating system support 16 logical processors. Your physical\nmachine must have at least 8 cores with hyper-threading enabled to power\non a virtual machine with this configuration.\n\n*8 Terabyte Disks \nVirtual machines can now include virtual disks greater than 2 Terabytes.\nGiven the limitations of most operating systems to boot from disks greater\nthan 2 Terabytes, These large disks are most useful as secondary drives for\nfile storage.\n\nNote: To use a disk greater than 2TB for a boot disk, your guest operating\nsystem would need to boot using EFI in order to read a GPT formatted disk\nwhich is required to access all of the sectors on a disk of this size.\nAdditionally, the Buslogic controller is not capable of supporting a disk\ngreater than 2TB.\n\nExtra murphy78 note: To enable EFI boot mode, edit the .VMX file and add:\nfirmware = &quot;efi&quot;\nAlternatively, to set it back to bios (legacy) boot, change to:\nfirmware = &quot;bios&quot;\n\n*Virtual SATA Disk Controller\nA SATA I/O controller can now be selected during the creation of a custom\nvirtual machine in addition to an IDE and SCSI controller. This enables use\nof in-box SATA drivers that are shipped with operation systems.\n\n\n*USB Improvements \nUSB 3 Streams have been implemented to enable high speed transfer of files\nfrom USB 3 external storage devices that support this technology. For\ncustomers running Workstation 10 on laptops with small hard disks, large\ndata files, video files etc., can be stored on an external USB 3 storage\ndevice and accessed quickly from within the virtual machine.\n\nVMware has also addressed issues Intel, NEC, AMD, TI and Linux Kernel host\nxHCI drivers to improve overall USB 3 compatibility and performance.\n\n*More VMnets\nDue to demand, VMware has doubled the number of VMnets in Workstation 10\nto twenty! This provides you with more virtual networks to dedicate to\nspecific uses, and it enables more complex networked virtual environments\nto be built.","torrent":{"xt":"urn:btih:2fb0712fac16ee884cff89c4a299995ba0286d9e","amp;dn":"VMware+Workstation+10.0.1+Build+1379776","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2fb0712fac16ee884cff89c4a299995ba0286d9e","infoHashBuffer":{"type":"Buffer","data":[47,176,113,47,172,22,238,136,76,255,137,196,162,153,153,91,160,40,109,158]},"announce":[],"urlList":[]}}