{"title":"Aerosmith - Get A Grip (1993) WMA320","uid":6171125,"size":182149134,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3070d41e8ca70cf6ffc9a7e5c4e633809a8dca7f&amp;dn=Aerosmith+-+Get+A+Grip+%281993%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1297583585,"description":"This album is PACKED with songs - and they happen to be big songs that rock. Granted, it's produced with polish, but when you've got loads of money and you're in the big game (AND trying to keep your 2nd wind rolling with momentum in your third decade of relevance), there WILL be some &quot;commercialization&quot; to your music. But if I ever get any point across to anyone, hear ye hear ye: Commercialization doesn't have to be a bad word if you still back it up with your musical integrity.\nMany people say that Get a Grip does not back up the integrity of Aerosmith. It's funny how in the early 90's, this album was the ONLY thing acceptable in the teenage mainstream (aside from Zeppelin and Floyd) that wasn't spelled with an N, an I, an R, a V, an N, ... you get the idea. So, when it was trendy to bash the 80's, Aerosmith sort of fell through the cracks of adolescent ridicule and sold millions of this record, and they have been paying for it with many &quot;loyal and disappointed&quot; fans ever since Grunge faded out and the late 90's gave way to the new Millenium. Now, many call the AmazaCrazyCryin trilogy a bunch of cheesy garbage. Funny how these are the same songs that were colossal hit singles with fans and newly-converted alike, back in 93-94. Then you've got your older generation who won't shut up about how Aerosmith will never rock like &quot;Toys in the Attic.&quot;\n\nSo, as a fan of All Aerosmith Eras, I hope you can accept that as a chance for an objective (if passionate) review of &quot;Get a Grip&quot;, when placed into the big picture.\n\nFirst of all, in another 5 years, this album will probably be well-remembered again, and probably thought of as a classic, just as some of their 70's stuff (especially since word is they're going back to that direction at last). It's all just a big cycle, and if you need proof, trust me - the 80's are MUCH more tolerated now than a decade ago. It's just taboo to touch anything within the 5-15 year span after the initial craze dies down. But I'm gonna touch it. And listen to it. And talk about it. And love it.\n\nThis album rocks big time. And it doesn't rock shallowly, either. Joe Perry's got some scorching solos all throughout (especially given his &quot;sloppy&quot; bluesy balls-to-the-wall technique). The one in &quot;Livin' on the Edge&quot; is quite melodic and creative. The one in &quot;Crazy&quot; is so tasteful to the mood of the song. And mainly, &quot;Eat the Rich&quot;... this is one of Aerosmith's greatest non ballad songs ever. It starts with the 'Walk This Way' riff, but does not cash in. It dives into a fast gritty riff of its own and plunges into a real calorie-burner of a song, no pun intended. The lyrics, the music, the groove, the cohesiveness as a band, the refraining from substance abuse that often clouded the band's creativity - it all came together with &quot;Permanent Vaction&quot; and &quot;Pump,&quot; and triumphantly kept on going.\n\nLet's tackle the issue of AmazaCrazyCryin. These songs are expertly written, recorded, and performed. So emotional, not pretensious, at times epic, and when closely analyzed, creatively crafted. If you are thinking they sound like a formula that's been repeated over and over, ... don't forget that someone first has to invent the formula. There, issue tackled.\n\nAnyone thinking chants of &quot;sellout&quot; might want to think of the pressure-filled situation of having sold gazillions of copies and STILL having the ball in your court, knowing that the public won't forget you've got another album coming up again. This album also proves that not so long ago, you could have 5 HUGE big singles and NOT chalk the rest of an album up to filler. This album can be thought of as a great template which, aside from Amazin/Crazy/Cryin, has never stimulated later influence in other artists who boybands shall here britney go unnamed matchbox20.\n\nOnly &quot;Gotta Love it&quot; gets a bit boring and repetitive, and even there, they experimented with some different chords that just didn't happen to work. As far as 14 song journeys go, &quot;Get a Grip&quot; is one of the strongest albums. I think it's a wonderful touch to close with a well-written instrumental (&quot;Boogie Man&quot;), showcasing immense diversity for an American staple known as Aerosmith.\n\nDon't get me wrong, I DO have issues with outside writers, when the band could do it themselves (I've got huge problems with the Diane Warren infection that would soon follow), but in my modestly educated opinion, the product as a whole DOES sound like the band you expect it to sound like, just a next-decade upgrade (And I usually call veteran rockers' &quot;evolutions&quot; DOWNGRADES instead).\n\nBottom line, put all the mild controversy aside, put the phones on (or crank the stereo up) and blast off to Aeroland. You'd be hard-pressed to honestly call &quot;Get a Grip&quot; anything short of quality rock and roll from a legendary band that does just that. \n\nby D. Rausch \n\nTRACKLIST:\n\n01 - Intro.wma                                              \n02 - Eat The Rich.wma                                       \n03 - Get A Grip.wma                                         \n04 - Fever.wma                                              \n05 - Livin' On The Edge.wma                                 \n06 - Flesh.wma                                              \n07 - Walk On Down.wma                                       \n08 - Shut Up And Dance.wma                                  \n09 - Cryin'.wma                                             \n10 - Gotta Love It.wma                                      \n11 - Crazy.wma                                              \n12 - Line Up.wma                                            \n13 - Amazing.wma                                            \n14 - Boogie Man.wma  \n\nWMA 320Kbps 44100Hz STEREO\n\nMARCELODRGZ","torrent":{"xt":"urn:btih:3070d41e8ca70cf6ffc9a7e5c4e633809a8dca7f","amp;dn":"Aerosmith+-+Get+A+Grip+%281993%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3070d41e8ca70cf6ffc9a7e5c4e633809a8dca7f","infoHashBuffer":{"type":"Buffer","data":[48,112,212,30,140,167,12,246,255,201,167,229,196,230,51,128,154,141,202,127]},"announce":[],"urlList":[]}}