{"title":"Advanced Crime Scene Photography - Professional and accurate pho","uid":8670712,"size":8264808,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:30717c0bf392878ed92fcfec2e414072828f35b5&amp;dn=Advanced+Crime+Scene+Photography+-+Professional+and+accurate+pho&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"R0thschild","files":4,"time":1373490766,"description":"              ***********************************************\n\n                PublicHash - Largest Bittorrent Community\n      \n                         &lt;a href=&quot; http://publichash.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://publichash.com/&lt;/a&gt;\n\n          Crystal Clean files - Fast Speed! No Virus! No Fake! Enjoy!\n    \n              ***********************************************\nAdvanced Crime Scene Photography - Professional and accurate photographic documentation\n\n\nDetails:\n\nChristopher D Duncan, &quot;Advanced Crime Scene Photography&quot; \n2010 | ISBN: 1420087894 | 339 pages | PDF | 8 MB\n\nThe first pieces of evidence viewed by jurors are oftentimes the photographs recorded by the crime scene investigator. Professional and accurate photographic documentation is critical for creating lasting first impressions in the minds of a jury. Solving a range of photographic dilemmas and challenges, Advanced Crime Scene Photography assists investigators in creating photographic evidence that is engaging, interesting, and informative, giving them greater credibility when testifying in court.\n\nBeginning with a review of basic photography principles, the book seamlessly integrates this information with corresponding applications in crime scene photography. Mindful of cost-saving concerns in most law enforcement agencies, it provides useful tips on creating compelling photographic presentations on a limited budget using everyday items in lieu of expensive equipment. It demonstrates how to photograph images used in identification, including fingerprint, footwear, and tirewear impressions; tool and bite marks; and bloodstain patterns. It also explores specialized topics such as nighttime and low-light photography, flash photography, painting with light techniques, the photography of Luminol reactions, laser trajectories, and ultraviolet and infrared light photography.\n\nThinking outside of the box, analyzing photographic challenges, and determining the best way to record a particular composition are all keys to the successful capture of photographic images that will leave a lasting impression with the viewer. Advanced Crime Scene Photography helps photographers work through difficult compositions and capture truly outstanding pieces of photographic evidence. \n ","torrent":{"xt":"urn:btih:30717c0bf392878ed92fcfec2e414072828f35b5","amp;dn":"Advanced+Crime+Scene+Photography+-+Professional+and+accurate+pho","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"30717c0bf392878ed92fcfec2e414072828f35b5","infoHashBuffer":{"type":"Buffer","data":[48,113,124,11,243,146,135,142,217,47,207,236,46,65,64,114,130,143,53,181]},"announce":[],"urlList":[]}}