{"title":"Beer Money (2001) TVRip","uid":6547443,"size":731008650,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:30d7c9677991abbe73036d45f371d37ffd116950&amp;dn=Beer+Money+%282001%29+TVRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ToN10","files":-1,"time":1310929912,"description":"-----------------------------------------\n\nBeer Money (2001)\n\n-----------------------------------------\n\nMovie Info:\n\nIMDB: http://www.imdb.com/title/tt0259882\n\nIts title notwithstanding, this zany made-for-cable comedy-fantasy is motivated by a lack of &quot;beer money.&quot; While camping in the woods, a trio of impoverished party animals -- Tim (Mark-Paul Gosselaar), Rut (Nick von Esmarch), and Blank (J.P. Manoux) -- stumble upon a lovable E.T.-like space alien. Nicknaming their new &quot;friend&quot; Greenie, our dunderheaded heroes hope to sell the alien to a sleazy TV tabloid show, &quot;Unbelievable Encounters,&quot; thereby keeping themselves in beer money for the rest of their lives. The problem now is to keep Greenie a secret from the local townsfolk until the TV deal is finalized. The sort of film that makes The Three Stooges look subtle, Beer Money debuted over the USA network on June 19, 2001.\n\n-----------------------------------------\n\nEncode Notes:\n\nRuntime: 1h 27m 15s\nFramerate: 29.97\nVideo: XviD, 975kbit/s\nResolution: 680x464\nAudio: MP3 128kbit/s VBR\n\n-----------------------------------------\n\nNotes:\n\nI've been looking for this movie for almost 10 years - seriously. I caught it on TV when it was first played on USA, and never saw it again. It never came out on DVD in the US, but did in Brazil (and with the original english audio). I tried ordering a DVD from one of the websites, but of course had a ton of trouble and ended up having to cancel the sale.\n\nI found this uploaded on a video streaming site, but had to go through all kinds of crap just to watch it (&quot;special&quot; software needed to be installed, etc). So I grabbed it and decided to spread it around as best I could because I know there's a lot of people out there looking for this.\n\nThanks to member &quot;mbfrfly&quot; over at veehd.com for this copy. It's a TVRip that was saved on a VHS and later digitized. Commercials have been ripped out, along with most of the end credits unfortunately. The movie is intact however, and good enough quality to enjoy.\n\nI reencoded this so it fits on a CD-R (700MB), but I can assure you there was no further loss of quality than was already present in the original file.\n\nI'm still actively working to obtain the DVD, and if you or someone you know has it, let me know and we can work something out so we can share the best quality version available with those who want it.\n\nIt's not our fault USA Networks never released it on DVD and refused to answer emails and forum posts begging for it.\n\n - Creighton (http://beermoney.happypowerhouring.com)\n\n-----------------------------------------","torrent":{"xt":"urn:btih:30d7c9677991abbe73036d45f371d37ffd116950","amp;dn":"Beer+Money+%282001%29+TVRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"30d7c9677991abbe73036d45f371d37ffd116950","infoHashBuffer":{"type":"Buffer","data":[48,215,201,103,121,145,171,190,115,3,109,69,243,113,211,127,253,17,105,80]},"announce":[],"urlList":[]}}