{"title":"2:54 - The Other I (2014) [FLAC]","uid":11422453,"size":304979053,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:31d248435a2d307861ec51d32dd85db417133d74&amp;dn=2%3A54+-+The+Other+I+%282014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"politux","files":-1,"time":1415632475,"description":"\n  2:54 - The Other I (2014) [FLAC]\n\n  Genre: Rock\n  Styles: Dream Pop, Indie\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bit rate: ~ 1,000 kbps\n  Bit depth: 16\n  Sample rate: 44.1 kHz\n\n  01 Orion \n  02 Blindfold \n  03 In the Mirror \n  04 No Better Prize \n  05 Sleepwalker \n  06 Tender Shoots \n  07 The Monaco \n  08 Crest \n  09 Pyro \n  10 South\n  11 Glory Days \n  12 Raptor \n\n  On their sophomore release The Other I, sisters Colette and Hannah Thurlow sojourn deeper down the shadowy path they first cut on their 2012 debut. Operating under the numeric moniker 2:54 (which apparently is the track location of a favorite Melvins drum fill), the two Londoners sound moodier than ever as they blend pastoral, Cure-like dream pop with punchy, downcast guitar rock. While there's no shortage of bands mining similar moods and dark territories, 2:54 wear their atmospherics well, constructing a world full of hazy warmth that always seems just on the edge of contention and threat. They radiate some of the minor key beauty of the Smoke Fairies, but without the folk influences, relying instead on a more distinctly gothic presence and punk attitude. Whether building songs up slowly like on the dreamily shifting &quot;In the Mirror&quot; or digging straight in on the creepy, frenzied &quot;Crest,&quot; they emit an undercurrent of aggression that is felt throughout the record. Backed by the dynamic rhythm section of Joel Porter and Alex Robins, the Thurlow sisters' guitar playing is full of clever push and pull; they frequently play off of each other in a counterpoint of chiming arpeggios and dirty riffs. But even within their somber world, there is still variety. Like a brief ray of sun, the lovely &quot;Tender Shoots&quot; appears mid-album to offer a hopeful interlude before segueing into the more wistful, acoustic-driven track &quot;The Monaco.&quot; Fans who were drawn to 2:54's introspective blend the first time will see this as a natural continuation of their deepening, subtly changing world","torrent":{"xt":"urn:btih:31d248435a2d307861ec51d32dd85db417133d74","amp;dn":"2%3A54+-+The+Other+I+%282014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31d248435a2d307861ec51d32dd85db417133d74","infoHashBuffer":{"type":"Buffer","data":[49,210,72,67,90,45,48,120,97,236,81,211,45,216,93,180,23,19,61,116]},"announce":[],"urlList":[]}}