{"title":"Keith Urban - Making Memories Of Us","uid":4795893,"size":142243844,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:31dac907fa5cc9fa87e2a602dca1dd49e59fc226&amp;dn=Keith+Urban+-+Making+Memories+Of+Us&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"2nafish","files":-1,"time":1237878881,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Making Memories of Us&quot; is the title of a country music song written by Rodney Crowell that has been recorded by several artists. The first version was recorded by Tracy Byrd on his 2003 album The Truth About Men. One year later, Crowell and Vince Gill recorded the song as members of The Notorious Cherry Bombs, a side project comprising former members of Crowell's backing band.\n\nThe third version of this song was recorded by Keith Urban on his 2004 album Be Here, from which it was released in early 2005 as that album's third single. Urban's rendition was a Number One hit for him on the Billboard Hot Country Songs charts, a position that it held for five weeks.\n\nKeith Lionel Urban (born 26 October 1967 in Whangarei, New Zealand) is an Australian Grammy- and ARIA-winning country music singer, songwriter and guitarist whose commercial success has been mainly in the United States. Urban began his career in Brisbane, Australia participating in Tamworth Country Music Festival, having moved to Caboolture, Australia at an early age. In 1991, he released a self-titled debut album, and charted four singles in Australia before moving to the United States in 1992. Eventually, Urban found work as a session guitarist before starting a band known as The Ranch, which recorded one studio album on Capitol Records and charted two singles on the Billboard country charts.\n\nUrban has released a total of seven studio albums (one of which was released only in the United Kingdom), as well as one album in The Ranch. He has charted more than fifteen singles on the U.S. country charts, including ten Number Ones. Urban plays acoustic and electric guitar, as well as ganjo,bass guitar, mandolin, piano, and bouzouki.\n\nUrban is married to actress Nicole Kidman. The couple had their first child together in July 2008 named Sunday Rose Kidman Urban. She was named Sunday after Sunday Reed, an Australian noted for her influence on her country's arts and culture for several decades beginning in the 1930's. The middle name Rose is after Keith's grandmother.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:31dac907fa5cc9fa87e2a602dca1dd49e59fc226","amp;dn":"Keith+Urban+-+Making+Memories+Of+Us","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31dac907fa5cc9fa87e2a602dca1dd49e59fc226","infoHashBuffer":{"type":"Buffer","data":[49,218,201,7,250,92,201,250,135,226,166,2,220,161,221,73,229,159,194,38]},"announce":[],"urlList":[]}}