{"title":"Encyclopedia of Wars - 3 Volume Set (Malestrom)","uid":5828083,"size":35668232,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3204f01fa32cc943f440ed3de7cf10dda6e7051f&amp;dn=Encyclopedia+of+Wars+-+3+Volume+Set+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"malestrom_HH","files":-1,"time":1284404142,"description":"Charles Phillips, Alan Axelrod, &quot;Encyclopedia of Wars - 3 Volume of Set (Fact on File Library of World History)&quot;\nPublisher: Facts on File | 2004 | ISBN 0816028516 | PDF | 1502 pages \n\nPlaces wars in their historical context. The first reference work of its kind, &quot;Encyclopedia of Wars&quot; describes not only the military aspect of wars - the causes of conflict, an enumeration of battles, and a summary of the outcome(s) - but also the social and political context in which the wars occurred. This pres readers and researchers with the important facts as well as the historical background for each war. From the Crusades to the Revolutionary War to the Persian Gulf War, this three-volume encyclopedia covers every major war, rebellion, and revolution from 3,500 BCE to the present. \n\nIts valuable content is in an accessible format. In three comprehensive volumes and approximately 2,000 A-to-Z entries, this definitive resource pres more thorough, complete coverage than any other encyclopedia. Each entry pres an at-a-glance look at the war in question and a narrative discussion of the war, examining its social context, major battles and events, and broader significance in cultural and historical terms. Suggestions for further reading follow each entry, and a general bibliography of major texts on war is included in the final volume. Numerous cross-references, 60 maps, and a chronology make this attractive and informative encyclopedia highly accessible.","torrent":{"xt":"urn:btih:3204f01fa32cc943f440ed3de7cf10dda6e7051f","amp;dn":"Encyclopedia+of+Wars+-+3+Volume+Set+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3204f01fa32cc943f440ed3de7cf10dda6e7051f","infoHashBuffer":{"type":"Buffer","data":[50,4,240,31,163,44,201,67,244,64,237,61,231,207,16,221,166,231,5,31]},"announce":[],"urlList":[]}}