{"title":"Led Zeppelin - Keeper Of The Seasons [3CD][1975][2008][320KBPS]","uid":11335410,"size":411604431,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:321c1ac3737170b4329cc4ddcbfb30ddb4440167&amp;dn=Led+Zeppelin+-+Keeper+Of+The+Seasons+%5B3CD%5D%5B1975%5D%5B2008%5D%5B320KBPS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"LameDuck69","files":17,"time":1414723587,"description":"Led Zeppelin - Keeper Of The Seasons [3CD][1975][2008]\n\n\n01. Rock And Roll \n02. Sick Again \n03. Over The Hills And Far Away \n04. In My Time Of Dying \n05. The Song Remains The Same \n06. The Rain Song \n07. Kashmir \n\n\n\nDisc 2\n\n\n01. No Quarter \n02. Trampled Under Foot \n03. Moby Dick \n\n\n\nDisc 3\n\n\n01. Dazed And Confused \n02. Stairway To Heaven \n03. Whole Lotta Love - Black Dog \n04. Heartbreaker \n\n\n\n\n\n320 KBPS [CBR]\nCover Art\n\n***** Per Request *****\n\n\n***** Thanks To &quot;bluesmax&quot; For Sharing The FLAC Files That I Used To Convert To.mp3 Files.  I Know He'd Rather People Didn't Convert FLAC files To .mp3, But Not Everyone Can Make Use Of FLAC Files. I Had A Request To Create These .mp3 Files Or I Wouldn't Have Done So.  This Is A File Sharing Site After All.  FLAC Files Do Sound A Lot Better, But Some People Would Rather Have The .mp3 Files Instead Of Doing Without. Thank &quot;bluesmax&quot; For This Music, And The Cover Art That He Included, NOT Me.***********\n\nFrom Wikipedia:\n\n\n\nLed Zeppelin were an English rock band that consisted of guitarist Jimmy Page, singer Robert Plant, bassist and keyboardist John Paul Jones, and drummer John Bonham. Formed in London in 1968, the group's heavy, guitar-driven sound, rooted in blues on their early albums, has earned them recognition as one of the progenitors of heavy metal, though their unique style drew from a wide variety of influences, including folk music.\n\nAfter changing their name from the New Yardbirds, Led Zeppelin signed a deal with Atlantic Records that afforded them considerable artistic freedom. Although the group was initially unpopular with critics, they achieved significant commercial success with albums such as Led Zeppelin (1969), Led Zeppelin II (1969), Led Zeppelin III (1970), their untitled fourth album (1971), Houses of the Holy (1973), and Physical Graffiti (1975). Their fourth album, which features the track &quot;Stairway to Heaven&quot;, is among the most popular and influential works in rock music, and it helped to secure the group's popularity.\n\nPage wrote most of Led Zeppelin's music, particularly early in their career, while Plant generally supplied the lyrics. Jones' keyboard-based compositions later became central to the group's catalog, which featured increasing experimentation. The latter half of their career saw a series of record-breaking tours that earned the group a reputation for excess and debauchery. Although they remained commercially and critically successful, their output and touring schedule were limited during the late 1970s, and the group disbanded following Bonham's death from alcohol-related asphyxia in 1980. In the decades that followed, the surviving members sporadically collaborated and participated in one-off Led Zeppelin reunions. The most successful of which was at the 2007 Ahmet Ertegun Tribute Concert in London, with Jason Bonham taking his late father's place behind the drums.\n\nLed Zeppelin are widely considered one of the most successful, innovative and influential rock groups in history. They are one of the best-selling music artists in the history of audio recording; various sources estimate the group's record sales at 200 to 300 million units worldwide. With RIAA-certified sales of 111.5 million units, they are the second-best-selling band in the United States. Each of their nine studio albums placed on the Billboard Top 10 and six reached the number-one spot. Rolling Stone magazine described them as &quot;the heaviest band of all time&quot;, &quot;the biggest band of the '70s&quot;, and &quot;unquestionably one of the most enduring bands in rock history&quot;. They were inducted into the Rock and Roll Hall of Fame in 1995; the museum's biography of the band states that they were &quot;as influential&quot; during the 1970s as the Beatles were during the 1960s.\n\nJimmy Page: Guitars\n\nRobert Plant: Vocals, Harmonica\n\nJohn-Paul Jones: Bass, Keyboards\n\nJohn Bonham: Drums","torrent":{"xt":"urn:btih:321c1ac3737170b4329cc4ddcbfb30ddb4440167","amp;dn":"Led+Zeppelin+-+Keeper+Of+The+Seasons+%5B3CD%5D%5B1975%5D%5B2008%5D%5B320KBPS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"321c1ac3737170b4329cc4ddcbfb30ddb4440167","infoHashBuffer":{"type":"Buffer","data":[50,28,26,195,115,113,112,180,50,156,196,221,203,251,48,221,180,68,1,103]},"announce":[],"urlList":[]}}