{"title":"Williams Gynecology - (Malestrom)","uid":4909812,"size":131700637,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:325848c2850c97c8ba86215f3289136ada47b592&amp;dn=Williams+Gynecology+-+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"malestrom_HH","files":1,"time":1243096549,"description":" &lt;a href=&quot;http://www.image-upload.net/images/te7olz8hqx6nml57otsb.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.image-upload.net/images/te7olz8hqx6nml57otsb.jpeg&lt;/a&gt;\n \n***NOT optimized for fast web browsing.Sorry.\n\n \nWilliams Gynecology by John Schorge, Joseph Schaffer, Lisa Halvorson, Barbara Hoffman, Karen Bradshaw, F. Cunningham\nPublisher: McGraw-Hill Professional; 1 edition (April 21, 2008) | 2250 pages | ISBN: 0071472576 | PDF\n\nThe first guide to bridge the gap between medical and surgical gynecology\n\nWritten by clinicians from the same department of Obstetrics and Gynecology responsible for the landmark bestseller Williams Obstetrics, this full-color text and atlas offers a complete overview of gynecology that no other source can match. In its pages, you'll find a templated, in-depth examination of the entire spectrum of gynecologic disease.\n\nSupporting this unparalleled coverage are a gynecologic surgical atlas, and numerous comprehension-building algorithms, tables, and figures that clarify differential diagnoses and preferred management strategies for treatment. And unlike most multi-authored texts, Williams Gynecology has a consistent, even tone, as all of its editors and authors are affiliated with Parkland Hospital in Dallas.\n\nFEATURES:\n\n* Encyclopedic scope covers the full range of gynecologic disorders, from cancer and infertility, to urogynecologic disorders\n* Full-color atlas section consisting of 350 figures that illuminate operative surgical techniques -- created by the Director and students of the Biomedical Communications Graduate Program at UT Southwestern.\n* Strong procedure orientation, covering a wide array of surgical operations, which are illustrated in detail\n* Numerous clinical algorithms and boxes highlighting differential diagnoses and best-practice treatment methods\n* Experienced author team from Parkland Hospital that updated the classic Williams Obstetrics--the leading reference in obstetrics for more than a century\n\n\n\nAbout the Author\n\nJohn O. Schorge, MD\nHolder, Patricia Duniven Fletcher Professorship in Gynecologic Oncology\nDirector, Division of Gynecologic Oncology Fellowship Program\nAssociate Professor, Department of Obstetrics and Gynecology\nUniversity of Texas Southwestern Medical Center, Dallas\n\nJoseph I. Schaffer, MD\nDirector, Division of Gynecology\nDirector, Division of Urogynecology and Female Pelvic Reconstructive Surgery\nProfessor, Department of Obstetrics and Gynecology\nUniversity of Texas Southwestern Medical Center, Dallas\nChief of Gynecology, Parkland Memorial Hospital, Dallas\n\nLisa M. Halvorson, MD\nDirector, Division of Reproductive Endocrinology and Infertility\nAssociate Professor, Department of Obstetrics and Gynecology\nUniversity of Texas Southwestern Medical Center, Dallas\n\nBarbara L. Hoffman, MD\nAssistant Director, Third-year Medical Student Clerkship\nAssistant Professor, Department of Obstetrics and Gynecology\nUniversity of Texas Southwestern Medical Center, Dallas\n\nKaren D. Bradshaw, MD\nHolder, Helen J. and Robert S. Strauss and Diana K. and Richard C. Strass Distinguished Chairmanship in Women's Health\nDirector, Lowe Foundation Center for Women's Preventative Health Care\nAssociate Residency Program Director, Department of Obstetrics and Gynecology\nProfessor, Department of Obstetrics and Gynecology\nProfessor, Department of Surgery\nUniversity of Texas Southwestern Medical Center, Dallas\n\nF. Gary Cunningham, MD\nHolder, Beatrice &amp; Miguel Elias Distinguished Chair in Obstetrics and Gynecology\nChairman Emeritus, Department of Obstetrics and Gynecology\nProfessor, Department of Obstetrics and Gynecology\nUniversity of Texas Southwestern Medical Center, Dallas","torrent":{"xt":"urn:btih:325848c2850c97c8ba86215f3289136ada47b592","amp;dn":"Williams+Gynecology+-+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"325848c2850c97c8ba86215f3289136ada47b592","infoHashBuffer":{"type":"Buffer","data":[50,88,72,194,133,12,151,200,186,134,33,95,50,137,19,106,218,71,181,146]},"announce":[],"urlList":[]}}