{"title":"Chemical Thermodynamics [Vol 1&amp;2]","uid":15356149,"size":47941325,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3265c69b458fd98e66f7fdf9388db859e81c208c&amp;dn=Chemical+Thermodynamics+%5BVol+1%26amp%3B2%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":2,"time":1468973130,"description":"Vol 1\r\nChemical Thermodynamics: Principles and Applications presents a thorough development of the principles of thermodynamics--an old\r\nscience to which the authors include the most modern applications, along with those of importance in developing the science and those of\r\nhistorical interest. The text is written in an informal but rigorous style, including ancedotes about some of the great thermodynamicists (with some of whom the authors have had a personal relationship), and focuses on &quot;real&quot; systems in the discussion and figures, in contrast to the generic examples that are often used in other textbooks.\r\nThe book provides a basic review of thermodynamic principles, equations, and applications of broad interest. It covers the development of thermodynamics as one of the pre-eminent examples of an exact science. A discussion of the standard state that emphasizes its significance and usefulness is also included, as well as a more rigorous and indepth treatment of thermodynamics and discussions of a wider variety of applications than are found in more broadly based physical chemistry undergraduate textbooks.\r\nCombined with its companion book, Chemical Thermodynamics: Advanced Applications, the practicing scientist will have a complete reference set detailing chemical thermodynamics.\r\n\r\nKey Features\r\n* Outlines the development of the principles of thermodynamics, including the most modern applications along with those of importance in developing the science and those of historical interest\r\n* Provides a basic review of thermodynamic principles, equations, and applications of broad interest\r\n* Treats thermodynamics as one of the preeminent examples of an exact science\r\n* Provides a more rigorous and indepth treatment of thermodynamics and discussion of a wider variety of applications than are found in more\r\nbroadly based physical chemistry undergraduate textbooks\r\n* Includes examples in the text and exercises and problems at the end of each chapter to assist the student in learning the subject\r\n* Provides a complete set of references to all sources of data and to supplementary reading sources\r\n\r\n\r\n\r\nVol 2\r\nThis book is an excellent companion to Chemical Thermodynamics: Principles and Applications. Together they make a complete reference set for the practicing scientist. This volume extends the range of topics and applications to ones that are not usually covered in a beginning thermodynamics text. In a sense, the book covers a &quot;middle ground&quot; between the basic principles developed in a beginning thermodynamics textbook, and the very specialized applications that are a part of an ongoing research project. As such, it could prove invaluable to the practicing scientist who needs to apply thermodynamic relationships to aid in the understanding of the chemical process under consideration.\r\nThe writing style in this volume remains informal, but more technical than in Principles and Applications. It starts with Chapter 11, which\r\nsummarizes the thermodynamic relationships developed in this earlier volume. For those who want or need more detail, references are given to\r\nthe sections in Principles and Applications where one could go to learn more about the development, limitations, and conditions where these equations apply. This is the only place where Advanced Applications ties back to the previous volume. Chapter 11 can serve as a review of the fundamental thermodynamic equations that are necessary for the more sophisticated applications described in the remainder of this book. This may be all that is necessary for the practicing scientist who has been away from the field for some time and needs some review. The remainder of this book applies thermodynamics to the description of a variety of problems. The topics covered are those that are probably of the most fundamental and broadest interest. Throughout the book, examples of &quot;real&quot; systems are used as much as possible. This is in contrast to many books where &quot;generic&quot; examples are used almost exclusively. A complete set of references to all sources of data and to supplementary reading sources is included. Problems are given at the end of each chapter. This makes the book ideally suited for use as a textbook in an advanced topics course in chemical thermodynamics.\r\n\r\nKey Features\r\n* An excellent review of thermodynamic principles and mathematical relationships along with references to the relevant sections in Principles and Applications where these equations are developed\r\n* Applications of thermodynamics in a wide variety of chemical processes, including phase equilibria, chemical equilibrium, properties of mixtures, and surface chemistry\r\n* Case-study approach to demonstrate the application of thermodynamics to biochemical, geochemical, and industrial processes\r\n* Applications at the &quot;cutting edge&quot; of thermodynamics","torrent":{"xt":"urn:btih:3265c69b458fd98e66f7fdf9388db859e81c208c","amp;dn":"Chemical+Thermodynamics+%5BVol+1%26amp%3B2%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3265c69b458fd98e66f7fdf9388db859e81c208c","infoHashBuffer":{"type":"Buffer","data":[50,101,198,155,69,143,217,142,102,247,253,249,56,141,184,89,232,28,32,140]},"announce":[],"urlList":[]}}