{"title":"Genesis-Archive #2 1976-1992","uid":5374452,"size":1435852900,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:33576119fdcc1c182b51fff1a58d7e9c6dfbadf4&amp;dn=Genesis-Archive+%232+1976-1992&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"zappa100","files":-1,"time":1266527425,"description":"A little something for the Genesis fan who must have everything and preferably in a box--even if he or she owns most of it already: Volume 2 of the Archive series picks up the tale at the tricky point of Peter Gabriel's departure and follows, in annoyingly non-chronological fashion over the course of three CDs, the band's amazingly survivalist transformation from parochially English prog-rock eccentrics with heads full of crazed kindergarten-story-time fantasy, to purveyors of sleek but complex and not entirely quirk-free adult-rock adored by millions globally. All the more amazing, really, when you consider how in 1976 Genesis were flapping around with enforced instrument swaps (drummer Phil Collins to vocals, bassist Mike Rutherford to guitar, guitarist Steve Hackett to the door marked &quot;Exit&quot; and a solo career) much to the puzzlement of a bemused press, who clearly didn't fancy the band's chances of making it past either Christmas. How wrong they were. According to keyboard-player Tony Banks, Archive Vol. 2 mops up pretty much all of the out-takes and leftovers from the albums covered by this period (there are four off-cuts from the Abacab album alone, including errant hit single &quot;Paperlate&quot;, but these have all been released commercially before) while the second CD is composed of live recordings left off Seconds Out, Three Sides Live, etc. (watch out for &quot;Entangled&quot;, recorded on the A Trick Of The Tale tour in 1976 and featuring the interim post-Gabriel line-up with Yes/King Crimson man Bill Bruford on drums). Essentially, live cuts not withstanding, Archive Vol. 2 boils down to one previously unreleased track, a revealing work-in-progress version of &quot;Mama&quot; and a perfect creative example of just how flexibly limbed and effortlessly commercial Genesis had become. Therefore, committed long-term fans will see this set as representing a fairly meagre return on their investment. Nonetheless, for the inquisitive layman who wishes to dig deeper than the obligatory Greatest Hits collection and can live without hearing &quot;Match Of The Day&quot;, Archive Vol. 2 sets about sweeping the odds and ends from every nook and cranny of Genesis' most successful period","torrent":{"xt":"urn:btih:33576119fdcc1c182b51fff1a58d7e9c6dfbadf4","amp;dn":"Genesis-Archive+%232+1976-1992","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"33576119fdcc1c182b51fff1a58d7e9c6dfbadf4","infoHashBuffer":{"type":"Buffer","data":[51,87,97,25,253,204,28,24,43,81,255,241,165,141,126,156,109,251,173,244]},"announce":[],"urlList":[]}}