{"title":"Operative Treatment of Elbow Injuries","uid":4959988,"size":10613632,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:34744bee336be3c35ab6331d3e21744a273cedb5&amp;dn=Operative+Treatment+of+Elbow+Injuries&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"VasiaZozulia","files":-1,"time":1245265659,"description":"Autoimmune Diseases in Endocrinology is a comprehensive and novel text that examines key features that predispose individuals to autoimmune diseases. The text begins with three introductory chapters which provide sufficient information so that anyone, including those without a background in recent immunology, will be able to understand the developments in the field. The next and largest section of the book concerns autoimmune thyroid disease, and authors of these chapters take the reader through the basic epidemiology, genetic and environmental risk factors, immunopathogenesis, and the diagnostic and management aspect of the disease. The next section discusses Type 1 diabetes mellitus. In the final section, authors explain other autoimmune endocrinopathies, including Addisons disease, premature ovarian failure, autoimmune hypophysitis, and autoimmune polyglandular syndrome types 1 and 2. Comprehensive and timely, Autoimmune Diseases in Endocrinology will become an essential reference for all endocrinologists and internal medicine practitioners working in this field.\n","torrent":{"xt":"urn:btih:34744bee336be3c35ab6331d3e21744a273cedb5","amp;dn":"Operative+Treatment+of+Elbow+Injuries","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34744bee336be3c35ab6331d3e21744a273cedb5","infoHashBuffer":{"type":"Buffer","data":[52,116,75,238,51,107,227,195,90,182,51,29,62,33,116,74,39,60,237,181]},"announce":[],"urlList":[]}}