{"title":"Anne Holt: Skyggedød - Norsk","uid":15393012,"size":612521944,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:3549314a47850951c0ab4bd00e1f9b4e868955ce&amp;dn=Anne+Holt%3A+Skygged%26oslash%3Bd+-+Norsk&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"nexus01","files":116,"time":1469364937,"description":"n regnfull fredag ettermiddag i juli 2011 dør det åtte år gamle enebarnet Sander Mohr i sitt eget hjem. Foreldrene er utrøstelige. Kriminalpsykologen Inger Johanne Vik tror som alle andre at dødsfallet skyldtes en tragisk hjemmeulykke. Bare purunge Henrik Holme, nyutdannet politibetjent for seks uker siden, fatter mistanke: Alt var muligens ikke slik det skulle være i det resurssterke og tilsynelatende velfungerende hjemmet på en av Oslos beste adresser. Uten erfaring, men med stor viljestyrke og sikker teft, makter han å få med seg Inger Johanne i en etterforskning som skal vise seg fatal. I skyggen av den nasjonale katastrofen som rammet Norge den dagen Sander døde, forsøker de umake parhestene å nøste opp i en families skitneste hemmeligheter. Jakten på sannheten om åtteåringens død blir en brutal konfrontasjon med fordommer og unnvikenhet, skam og løgner, systemsvikt og menneskelig fornedring. Skyggedød er det femte og siste frittstående bind i serien om Inger Johanne Vik og Yngvar Stubø. Tidligere bøker i serien er Det som er mitt, Det som aldri skjer, Presidentens valg og Pengemannen. Serien er oversatt til 25 språk, og solgt i millioner av eksemplarer over hele verden","torrent":{"xt":"urn:btih:3549314a47850951c0ab4bd00e1f9b4e868955ce","amp;dn":"Anne+Holt%3A+Skygged%26oslash%3Bd+-+Norsk","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3549314a47850951c0ab4bd00e1f9b4e868955ce","infoHashBuffer":{"type":"Buffer","data":[53,73,49,74,71,133,9,81,192,171,75,208,14,31,155,78,134,137,85,206]},"announce":[],"urlList":[]}}