{"title":"Symbolism And Belief","uid":8944369,"size":2285628,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:356db4a118a503996e5a95b97305c442db690b97&amp;dn=Symbolism+And+Belief&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"livhre","files":-1,"time":1379737362,"description":"Originally published in 1938. SYMBOLISM AND BELIEF by EDWYN BEVAN PREFACE: THE lectures contained in this volume were given for the University of Edinburgh on Lord Giffords founda tion In the years 1933 and 1934. I have delayed their publication in the hope that with process of time I might, by further reading and thought, be able to expand and modify them, so as to make them more worthy of presen tation to the public in the form of a book. This hope has been so meagrely realized that it now seems best to let them go forth, with all their imperfections on their head, hardly at all altered from the form in which they were delivered. Some changes in arrangement have been made in the order of lectures the two on Time now follow immediately the two on the spatial symbol of Height. Four lectures have been omitted altogether from the present volume, those on image-worship and doctrines ondemning the manufacture of images in antiquity and in the Christian Church. Since in the rest of the lectures ihe symbolism of material objects in worship was not the kind of symbolism under consideration, these four lectures seemed somewhat of a digression from the main ine of argument.","torrent":{"xt":"urn:btih:356db4a118a503996e5a95b97305c442db690b97","amp;dn":"Symbolism+And+Belief","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"356db4a118a503996e5a95b97305c442db690b97","infoHashBuffer":{"type":"Buffer","data":[53,109,180,161,24,165,3,153,110,90,149,185,115,5,196,66,219,105,11,151]},"announce":[],"urlList":[]}}