{"title":"Secret Projects: Military Space Technology","uid":8456440,"size":114271533,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:363f2399e6601bd1eeab762b0e811d81417d96bf&amp;dn=Secret+Projects%3A+Military+Space+Technology&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"JinRohEX","files":-1,"time":1368117741,"description":"Secret Projects: Military Space Technology\nby Bill Rose\n\nDESCRIPTION:\nThis book outlines the development of space technology for military purposes from its very beginnings during World War II right up to the latest, most sophisticated systems. The author starts with references to the prewar era, then goes on to discuss German rocketry during World War II and their bold wartime ambitions, which were finally developed during the Cold War. By the mid-1950s, space was being visualized as the next big battlefield, and both the U.S. and Soviet Union had ambitions to expand their domains into the solar system. Many of these ideas were completely impractical, way beyond possible realization, extremely dangerous, and completely unaffordable. By the start of manned spaceflight, missions became politically motivated, although military projects continued in the background and this would eventually surface as the Star Wars proposals. \n This is a serious, factual study about the many projects that have come to the drawing board since the very beginning of space technology development; from the early experiments by the Germans in World War II, through the X-plane era, 'Star Wars', and then to the advanced spaceplane projects such as NASP (National Aerospace Plane), Copper Coast, and the Aurora spaceplane, Soviet spaceplanes and long-range USAF hypersonic strike and orbital aircraft. Many photos are included to illustrate the detailed and comprehensive text.\n\nAmazon.com title link: &lt;a href=&quot;\nhttp://www.amazon.com/Secret-Projects-Military-Space-Technology/dp/1857802969&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Secret-Projects-Military-Space-Technology/dp/1857802969&lt;/a&gt;","torrent":{"xt":"urn:btih:363f2399e6601bd1eeab762b0e811d81417d96bf","amp;dn":"Secret+Projects%3A+Military+Space+Technology","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"363f2399e6601bd1eeab762b0e811d81417d96bf","infoHashBuffer":{"type":"Buffer","data":[54,63,35,153,230,96,27,209,238,171,118,43,14,129,29,129,65,125,150,191]},"announce":[],"urlList":[]}}