{"title":"Have Fun, Get Paid - Christopher Duncan.epub","uid":9363959,"size":737971,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:365d84a763e26a9d7eed600a929339583558a94e&amp;dn=Have+Fun%2C+Get+Paid+-+Christopher+Duncan.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1387380210,"description":"From performers who bask in the spotlight to those who find inspiration in the midnight glow of a computer monitor, the world has no shortage of creative people. While the day-to-day realities of a ballerina may be quite different from that of a novelist, actor, graphic artist, musician, or software developer, they share many things in common. Chief among these is the desire to make a living with their art. Maybe you're working to build a sustainable, full-time creative career. Or perhaps you're happy in the corporate world but would like to turn your love for music, dance, painting, or programming into a steady stream of extra income. Either way, if you're like most creative souls, you tend to focus on your passion to the exclusion of all elseand you may scorn the details of business and promotion. Yet as Have Fun, Get Paid: How to Make a Living with Your Creativity shows, developing business skills couldn't be more important for those who want to achieve success and generate steady income from their work. With decades of professional experience in creative fields such as music, software, writing and speaking, bestselling author Christopher Duncan demystifies the path to getting paid for your artistic talents. With lighthearted stories and down-to-earth advice, he starts with the basics and shows you how to build a solid, dependable career. All that's required is consistent effort and a bit of commonsense. In Have Fun, Get Paid you will learn how to: Find paying work and get the gigs Market your talent without selling your soul Build an image as a highly sought after professional Manage the business details of your creative career Harness the power of relationships for long term success With advances in technology and the global reach of the Internet, creative people are empowered today as never before. Have Fun, Get Paid will show you how to take control of your dreams and bring them to life. What you'll learn After reading Have Fun, Get Paid, you will learn: What success means to you, no matter whether it entails becoming rich, earning personal validation from your work, or gaining the freedom to do things your own way How to avoid focusing on your passion to the exclusion of all else so that you have the time and energy necessary to manage your business Who your customers are, what value you provide to them, and how to keep them coming back for more How to become an authority in your field by teaching others to do what you do The ins and outs of sales and marketing, from the basics to new strategies Who this book is for\n\nWhether the goal is a full time living or a steady stream of part time income, creative people of all disciplines will gain the practical insights necessary to building a reputation as a professional. This image, coupled with effective promotion and the ability to foster lasting relationships, is the key to a rewarding career in the arts. Success is not reserved for the fortunate few but rather for those who are willing to roll up their sleeves and put in the effort required to achieve their goals. InHave Fun, Get Paid, you'll learn how to do exactly that. Table of Contents The Creative Mindset This is Business Becoming Self-Sufficient What Do You Want? Think Like a Startup Image Building Spreading the Word Going the Distance The Power Behind the Throne Paying the Bills Taking Care of Business Your Personal Style","torrent":{"xt":"urn:btih:365d84a763e26a9d7eed600a929339583558a94e","amp;dn":"Have+Fun%2C+Get+Paid+-+Christopher+Duncan.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"365d84a763e26a9d7eed600a929339583558a94e","infoHashBuffer":{"type":"Buffer","data":[54,93,132,167,99,226,106,157,126,237,96,10,146,147,57,88,53,88,169,78]},"announce":[],"urlList":[]}}