{"title":"Putt Like a Pro - Brian Lake - Golf Training","uid":5977331,"size":6191419,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:36a6dde4da0bf397ee31cb965a85da7818013450&amp;dn=Putt+Like+a+Pro+-+Brian+Lake+-+Golf+Training&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dmt01","files":1,"time":1290477220,"description":"Product Description\n\nFind your perfect putting style and solve the mystery of golf's most puzzling shot\n\nThe putt is the shortest swing in all of golf and requires the least amount of strength and coordination. Yet it is the most important, and potentially frustrating, shot in the game. &quot;To master the game of golf,&quot; writes author and teaching professional Brian Lake, &quot;you must master putting.&quot; In this comprehensive lesson book, Lake teaches you how, taking you from essential basics to advanced mechanics.\n\nLike no other book, Putt like a Pro explains in detail how to excel with the most unorthodox and successful putting strokes used by tour professionals today. With the innovative instruction of Brian Lake on your green, you'll learn how to:\n\n    * Develop your personal putting style\n    * Find the right equipment to fit your style\n    * Read the greens and strategize for any condition\n    * Master the mental game and build confidence\n    * Practice effectively with targeted skill-building sessions\n    * Execute the proper grip, stance, and stroke for the claw, the belly putter, the sidesaddle, and other professional-grade putting strokes\n\nAbout the Author\n\nBrian Lake is a golf professional who has given countless lessons to men, women, children, young pros, andsince becoming a Class-A PGA member in 1995. He lives in Bradenton, Florida.","torrent":{"xt":"urn:btih:36a6dde4da0bf397ee31cb965a85da7818013450","amp;dn":"Putt+Like+a+Pro+-+Brian+Lake+-+Golf+Training","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36a6dde4da0bf397ee31cb965a85da7818013450","infoHashBuffer":{"type":"Buffer","data":[54,166,221,228,218,11,243,151,238,49,203,150,90,133,218,120,24,1,52,80]},"announce":[],"urlList":[]}}