{"title":"Law and Order SVU S14E03 720p HDTV (Optimised for PS3)","uid":7715831,"size":952151461,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:370698cf9d77d4f7099d76e54174672cae81f545&amp;dn=Law+and+Order+SVU+S14E03+720p+HDTV+%28Optimised+for+PS3%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Flying_Milkan","files":-1,"time":1349929173,"description":"Law and Order SVU S14E03 720p HDTV MPEG2 SM10 (Optimised for PS3)    \n\nOriginal Uploader: Spidermike2010\nRuntime: 60 min\nLanguage: English\n\nDirector: David Platt, Peter Leto, Constantine Makris, Juan Jos&amp;#xE9; Campanella, Jean de Segonzac, Arthur W. Forney, Steve Shill, Alex Zakrzewski, Helen Shaver, Jonathan Kaplan, Ted Kotcheff, Richard Dobbs, Jud Taylor, Alex Chapple, Michael Fields, Rick Wallace, Michael Slovis, Donna Deitch, Aaron Lipstadt, Norberto Barba, Lesli Linka Glatter, Rick Rosenthal, Steve Wertimer, James Quinn, Matt Earl Beesley, George Pattison, Eriq La Salle, Kate Woods, Christopher Zalla, Holly Dale, Jim McKay.\n\nCast: Mariska Hargitay, Richard Belzer, Dann Florek, Ice-T, Christopher Meloni, BD Wong, Tamara Tunie, Diane Neal, Stephanie March, Mike Doyle.\n\nLaw &amp; Order: Special Victims Unit (often abbreviated to Law &amp; Order: SVU or just SVU) is an American police procedural crime drama television series set in New York City, where it is also primarily produced. In the style of the original Law &amp; Order, episodes are often &quot;ripped from the headlines&quot; or loosely based on real crimes that have received media attention. Created and produced by Dick Wolf, the series premiered on NBC on September 20, 1999 as the first spin-off of Wolf's successful crime drama, Law &amp; Order.\n\nLaw &amp; Order: Special Victims Unit originally centered almost exclusively around the detectives of the Special Victims Unit in a fictional version of the 16th Precinct of the New York City Police Department. As the series progressed, additional supporting characters were added as allies of the detectives in the Manhattan District Attorney's office and the Medical Examiner's office. Typical episodes follow the detectives and their colleagues as they investigate and prosecute sexually based offenses. The show starred Christopher Meloni as Detective Elliot Stabler and Mariska Hargitay as Detective Olivia Benson for its first twelve seasons until the former left the cast, unable to come to an agreement on his contract.","torrent":{"xt":"urn:btih:370698cf9d77d4f7099d76e54174672cae81f545","amp;dn":"Law+and+Order+SVU+S14E03+720p+HDTV+%28Optimised+for+PS3%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"370698cf9d77d4f7099d76e54174672cae81f545","infoHashBuffer":{"type":"Buffer","data":[55,6,152,207,157,119,212,247,9,157,118,229,65,116,103,44,174,129,245,69]},"announce":[],"urlList":[]}}