{"title":"Barbarian Women (Underground - Restored)","uid":8517874,"size":129647605,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:37cc5468a8f7949b55dbd45802eebfcbce1a670f&amp;dn=Barbarian+Women+%28Underground+-+Restored%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LeonardTSpock","files":-1,"time":1369813309,"description":"'Barbarian Women'\n\nCalifornia Comics, 1975, 1977 and 1995, 32-40 pages\n\nContributions from Bob Sidebottom, Nestor Redondo, Hale Han, Larry Sidebottom, Barney Steel, Trina Robbins, Ron Harris, Ed A Watson, S Clay Wilson, Chris Metz, Frank Bella, Liz Day Sidebottom, Danielle Lanear, Aaron Culala, Casper, Craig Parrotte, Randy Vogel, Mark Ritch\n\nWords from the Comix Joint...\n\nImmediately after publishing the final issue in the Barbarian Comics series, Bob Sidebottom and California Comics launched the Barbarian Women Comics series (the title was never exactly the same on any of the three issues). The first two issues came out about a year and a half apart, while the third issue came 18 years after the second, in 1995.\n\nBarbarian Women is, thankfully, less about barbarians than it was about women. Underground comic pioneer Trina Robbins contributes a full story to the inaugural issue, though the series was certainly never a feminist publication, as most of the content was produced by male artists and writers. Barbarian Women #2 features a lively cover by S. Clay Wilson.\n\n\n-------------------------------------------------------------------------------\n\nAs a side effect of the restoration process, depending on what you are using to view this file, you may need to reduce the image size in order to achieve the best possible quality. On a smaller screen you'll never notice it, but if you are viewing on a full size monitor the file will open a bit too large. Just shrink it a little and enjoy!\t\t\t\t\n\n","torrent":{"xt":"urn:btih:37cc5468a8f7949b55dbd45802eebfcbce1a670f","amp;dn":"Barbarian+Women+%28Underground+-+Restored%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"37cc5468a8f7949b55dbd45802eebfcbce1a670f","infoHashBuffer":{"type":"Buffer","data":[55,204,84,104,168,247,148,155,85,219,212,88,2,238,191,203,206,26,103,15]},"announce":[],"urlList":[]}}