{"title":"Billy Joe Shaver - Old Five And Dimers Like Me [1973][EAC,log,cu","uid":8461050,"size":237013241,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3830e847e1dee76fbd0cc24667b1380d8c8b8c9d&amp;dn=Billy+Joe+Shaver+-+Old+Five+And+Dimers+Like+Me+%5B1973%5D%5BEAC%2Clog%2Ccu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":33,"time":1368232004,"description":"Artist: Billy Joe Shaver\nRelease: Old Five And Dimers Like Me\nReleased: 1973\nLabel: 1996 Koch International\nCatalog#: KOC-CD-7938\nFormat: FLAC / Lossless / Log (100%) / Cue\n[color=blue]Country: USA\nStyle: Folk, World, &amp; Country\n\n\n\n\n\n1\t Black Rose\t2:44\t\n2\t Old Five And Dimers Like Me\t2:41\t\n3\t L.A. Turnaround\t2:49\t\n4\t Jesus Christ, What A Man\t2:26\t\n5\t Played The Game Too Long\t3:23\t\n6\t I Been To Georgia On A Fast Train\t2:18\t\n7\t Willy The Wandering Gypsy And Me\t2:29\t\n8\t Low Down Freedom\t2:53\t\n9\t Jesus Was Our Savior And Cotton Was Our King\t1:47\t\n10\t Serious Souls\t2:10\t\n11\t Bottom Dollar\t2:53\t\nBonus Tracks\n12\t Ride Cowboy Ride\t2:46\t\n13\t Good Christian Soldiers\t3:05\n\n\n\nBilly Joe Shaver slipped onto the recording scene very quietly in 1973. He was already heralded a fine songwriter by Jerry Jeff Walker, Willie Nelson, and Waylon Jennings, but even they'd recorded one or two songs of his up to that point. After the issue of this debut album, however, the floodgates opened for Shaver with the aforementioned trio and Johnny Cash himself recording Billy Joe's songs -- a trend that continued 30 years later. Old Five and Dimers Like Me reveals a songwriter at the height of his power, a songwriter who undersells his case via quiet melodic music steeped in Texas country, folk, and the blues. While the title track is best known and the most often recorded (Waylon based his entire Honky Tonk Heroes around that track as the basis for an album of Shaver's tunes), each of this CD's 14 songs are gems. &quot;Fit to Kill and Going Out in Style&quot; became an anthem of the outlaw movement, and &quot;Black Rose&quot; echoes the Band's &quot;Cripple Creek&quot; with its funky country shuffle. The old-time honky tonk blues of &quot;Played the Game Too Long&quot; features a Dixieland horn section in the middle, and &quot;Willie the Wandering Gypsy and Me&quot; became David Allan Coe's theme after &quot;Long Haired Redneck.&quot; And &quot;Low Down Freedom&quot; is the most poignantly written song about what it costs others when a man decides he needs to be free. Shaver was a study in contradictions on this album and proved to be so in life as well. He was a big man on the cover, a rough and tumble farmer who liked his music hot and simple and wrote words like a poet laureate. His performances of his own songs have been derided in the past because of the supposed limitations in his voice. But though he may not produce the performance drama that some of his peers can, his versions of these songs are far more poignant than any cover version of them. Shaver has always possessed an elegant and humble sense of dignity; it's on this recording, and on each one that followed. Old Five and Dimers Like Me is a masterpiece not only as a genesis for outlaw country, but of American songwriting at its very best.","torrent":{"xt":"urn:btih:3830e847e1dee76fbd0cc24667b1380d8c8b8c9d","amp;dn":"Billy+Joe+Shaver+-+Old+Five+And+Dimers+Like+Me+%5B1973%5D%5BEAC%2Clog%2Ccu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3830e847e1dee76fbd0cc24667b1380d8c8b8c9d","infoHashBuffer":{"type":"Buffer","data":[56,48,232,71,225,222,231,111,189,12,194,70,103,177,56,13,140,139,140,157]},"announce":[],"urlList":[]}}