{"title":"AcronisAlignTool_s_e_2_0_107.exe","uid":9720313,"size":72688520,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:390a55a66841d43b2479af425d5dac89cdfc01b0&amp;dn=AcronisAlignTool_s_e_2_0_107.exe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"fillinthisspace","files":1,"time":1394224030,"description":"Over the last five years or so I've bought quite a few WD AF drives so I can vouch for the fact the AcronisAlignTool has generally been some flavour of crap. If you can get it to download.....\nFor download problems on the W.D. site, once you've created an account at WD (and  you can supply fake details including your email address),log out and delete all your browser's temporary internet files. Go back to the WD site and when you've logged in again the AcronisAlignTool download should work. Crap software on a poorly designed web site....\n\nToday I bought a couple of 2TB Green drives. As I had a slightly older version, I downloaded AcronisAlignTool_s_e_2_0_111.exe only to discover it's a brand new flavour of crap. It aligned the first drive, but I copied a large number of files to it accidentally so I deleted the whole partition and reformatted, but the AcronisAlignTool refused to acknowledge it needed aligning again. I connected the second drive which had never been used and AcronisAlignTool reported it as aligned. Maybe after it's aligned a drive it saves the drive letter to the registry so it doesn't check the drive properly again. I don't know.... but it'd be pretty dumb if it did.\n\nSo I uninstalled the current version (2_0_107) and re-installed AcronisAlignTool_s_e_2_0_107.exe\nBingo! Now both drives were then reported as not aligned and I could align them.\n\nThere's torrents for the &quot;Paragon Alignment Tool&quot; on piratebay. If you're having trouble with the AcronisAlignTool it might pay to try them first, but in case it comes in handy for someone, here's AcronisAlignTool_s_e_2_0_107.exe\n\nIt may not work with WD's newest drives, but it'll work with the Green drives I bought today (8th March 2014).","torrent":{"xt":"urn:btih:390a55a66841d43b2479af425d5dac89cdfc01b0","amp;dn":"AcronisAlignTool_s_e_2_0_107.exe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"390a55a66841d43b2479af425d5dac89cdfc01b0","infoHashBuffer":{"type":"Buffer","data":[57,10,85,166,104,65,212,59,36,121,175,66,93,93,172,137,205,252,1,176]},"announce":[],"urlList":[]}}