{"title":"Slayin Asians (NEW 2013 Evil Angel) [DVDRip]","uid":8827893,"size":2860633226,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:3917fa874e27cb43898bd1a245ed0f86e770e41b&amp;dn=Slayin+Asians+%28NEW+2013+Evil+Angel%29+%5BDVDRip%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":7,"uploader":"chkm8te","files":1,"time":1376892777,"description":"Slayin Asians (NEW 2013 Evil Angel) [DVDRip]\n\nCAST\nAsa Akira, Cindy Starfall, Jessica Bangkok, Krissie Dee, London Keyes, Prince Yashua\n\nSlayin Asians: In Slayin Asians, Prince Yahshua (aka Black Assassin) gets his pick of the porn industrys most stunning, young dolls of Far Eastern heritage ... all under the glamour-drenched direction of extreme perv Jonni Darkko. The Prince seems to favor vixens whose craving for interracial dicking is most insatiable. So Yahshua and his occasional stud partners enjoy five scenes of nasty, cross-cultural fucking intended for fans of big black cock and little Asian sluts. Sleek, sensuous lingerie model Asa Akira, in the mood for a huge, throbbing black member, takes a slobbery-wet throat-banging, and Yahshuas enormous prick stretches her asshole until it gapes widely. Next, blue-haired punk cutie Krissie Dee takes a thorough DP reaming in a rough double-teaming by Prince and Sean Michaels. Petite Krissie gags on their huge, oily pricks and they shower her pretty face in sperm. Adorable, little bikini bunny Cindy Starfall lubricates Black Assassins massive shaft with both hands before sliding it into her tight twat. After Yahshua ejaculates in her face, a parade of five more dudes blasts Cindy with loads of messy jism! Busty bondage model Jessica Bangkok submits to some blindfolded body worship and eagerly services Princes veiny monster dick. Finally, all-natural bombshell London Keyes enjoys a glistening, oil-smeared session of intense sodomy, and her gorgeous face gets decorated with hot cum. Get ready for an explosion of beauty and filth Jonni Darkkos Slayin Asians is killer interracial hard-core!\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=7wge7beqzlp36jwl9fmq.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=7wge7beqzlp36jwl9fmq.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=yu00dwkz3nijlvs28n50.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=yu00dwkz3nijlvs28n50.jpeg&lt;/a&gt;","torrent":{"xt":"urn:btih:3917fa874e27cb43898bd1a245ed0f86e770e41b","amp;dn":"Slayin+Asians+%28NEW+2013+Evil+Angel%29+%5BDVDRip%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3917fa874e27cb43898bd1a245ed0f86e770e41b","infoHashBuffer":{"type":"Buffer","data":[57,23,250,135,78,39,203,67,137,139,209,162,69,237,15,134,231,112,228,27]},"announce":[],"urlList":[]}}