{"title":"Leah Hager Cohen The Grief of Others 2011 Retail eBook-BitBook","uid":8240116,"size":1460522,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:397d17a27f6936f4ff422f21c8045b450b134545&amp;dn=Leah+Hager+Cohen+The+Grief+of+Others+2011+Retail+eBook-BitBook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"BlackTar","files":3,"time":1362941644,"description":" |                          The Grief of Others                               |\n |                                                                            |\n |                                                                            |\n |                                                                            |\n |                                                                            |\n | DATE: 2012-05-18  SIZE: 1020,57KBDISKS: 01_______4,77MB      PAGES: 375    |\n |                                                                            |\n | PUBLISHER: Penguin Group                     GENRE: Fiction                |\n |                                                                            |\n | AUTHOR: Leah Hager Cohen                                                   |\n | AUTHOR:                                                                    |\n |                                                                            |\n | FORMAT: PDF    PROTECTION: DRM     EDITION:                                |\n |                                                                            |\n | URL: http://is gd/z1bWZm                                                   |\n |                                                                            |\n | LANGUAGE: English   ISBN: 978-1-101-54704-5                                |\n :                                                                            :\n : In the tradition of The Memory Keeper's Daughter, a gripping, generous, and:\n : provocative novel chronicling the grief that follows the death of a        :\n : newborn-and that leads to a family's emotional reawakening.                :\n :                                                                            :\n : It begins with loss. John and Ricky Ryrie are stricken by the death of     :\n : their third child, only fifty-seven hours after his birth. Struggling to   :\n : regain a semblance of normalcy, they find themselves pretending not only   :\n : that little has changed, but that nothing was wrong before this baby came  :\n : so briefly into their lives. Yet in the aftermath of his death,            :\n : long-suppressed uncertainties about their relationship come roiling to the :\n : surface. A dreadful secret emerges concerning what Ricky knew about her    :\n : pregnancy and concealed from everyone, even John.                          :\n : And the couple's two older children, grappling with the tensions around    :\n : them, begin to act out in exquisitely, perhaps courageously, idiosyncratic :\n : ways. Ultimately, though, the grief that was initially so isolating brings :\n : the four family members to connect powerfully with the sadness and burdens :\n : of others- to the grief that is part of every human life and that carries  :\n : within it the ability to draw us together. And in the end, Ricky and John's:\n : marriage is stronger for the transformation their grief has allowed.       :\n :                                                                            :\n : Moving, psychologically acute, and gorgeously written, The Grief of Others :\n : is Leah Hager Cohen at the height of her talent in what is sure to be her  :\n : breakout book, one that forces readers to ask themselves: What would I have:\n : done? The Grief of Others exposes the paradox that facing tragedy together :\n : can in fact awaken us to our better selves and take us from fear to a place:\n : of hope and optimism.                                                      :","torrent":{"xt":"urn:btih:397d17a27f6936f4ff422f21c8045b450b134545","amp;dn":"Leah+Hager+Cohen+The+Grief+of+Others+2011+Retail+eBook-BitBook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"397d17a27f6936f4ff422f21c8045b450b134545","infoHashBuffer":{"type":"Buffer","data":[57,125,23,162,127,105,54,244,255,66,47,33,200,4,91,69,11,19,69,69]},"announce":[],"urlList":[]}}