{"title":"Engines Under Ursus SciFi Audio Episodes 1-27","uid":7402486,"size":899061179,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:39a477e9c86567352eb143278df7f793bf89ded5&amp;dn=Engines+Under+Ursus+SciFi+Audio+Episodes+1-27&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"seadarie","files":27,"time":1341151327,"description":"This is a Science Fiction novel called 'Engines Under Ursus'. I will add new episodes when I get the time. The Nanoteks are called N-Teks in the story and is set far in the future on a world co-inhabited with other aliens who compete firecely with the humans. The N-Teks themselves are millions possibly billions of years old and have been around long before the new alien colonies arrived and settled Erstol and are essentially harmless. The center of human power in the city is CityNet on Erstol but something goes wrong; the normally harmless N-Teks start attacking CityNet, probing it out attempting to undermine it and they are succeeding. No-one knows why they are attacking CityNet. Could the other aliens be behind it? Only one man could possibly know but he was placed in the Tank for having done experiments with the N-Teks - a punishable crime. Now they must take Tom Fowler out of the Tank, the man whom they imprisoned for working with the N-Teks; the only man who can now possibly save human power on Erstol. The aliens with whom they once warred look on, offering no help; the competition between them is as fierce as ever. But what about Fowler, does he care enough to help out his own kind; especially those who took away his freedom and now want his help?\n\nVisit my website to read more of my creative writing and projects.\n\nThe Official Engines UnderUrsus site.\n &lt;a href=&quot;\nhttp://archive.org/details/EnginesUnderUrsus&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://archive.org/details/EnginesUnderUrsus&lt;/a&gt;","torrent":{"xt":"urn:btih:39a477e9c86567352eb143278df7f793bf89ded5","amp;dn":"Engines+Under+Ursus+SciFi+Audio+Episodes+1-27","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39a477e9c86567352eb143278df7f793bf89ded5","infoHashBuffer":{"type":"Buffer","data":[57,164,119,233,200,101,103,53,46,177,67,39,141,247,247,147,191,137,222,213]},"announce":[],"urlList":[]}}