{"title":"Putumayo Presents-Sahara Lounge By Ulysses56","uid":3509490,"size":83379377,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:39b1ab2e7c22d39882a92fa4f3a6c11dbaef3163&amp;dn=Putumayo+Presents-Sahara+Lounge+By+Ulysses56&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ulysses56","files":14,"time":1154788806,"description":"Putumayo Records Presents:\nSahara Luonge\nEntrancing fusions of middle eastern melodies and rhythms with cutting edge electronica and remixes \nRip 320kbs\nCovers Included\n\nPutumayo presents Sahara Lounge, a mesmerizing album of laid-back fusions of traditional Middle Eastern melodies, rhythms and instrumentation with cutting edge electronica, hip-hop beats and remixes. Algerian rai, Berber music, Sufi chants, and Egyptian al-jeel meet dub, trip hop, break beats and funk resulting in a hypnotic and captivating vibe. \nSahara Lounge, which will be released on January 20th, 2004, is the latest in a caravan of successful Putumayo releases focusing on exciting new directions in world music, including World Lounge, Euro Lounge and Arabic Groove. \nSahara Lounge includes six rare and previously unreleased tracks. The work of the innovative Lebanese electronica duo Soap Kills has been available almost exclusively on their self-produced, unreleased demo recordings. Ramin Sakurai?s collaboration with Iranian artist Shiraz has never before been widely released. Nabiha Yazbeck?s ?Astahel? has never been available outside of the Middle East until now. The Jasmon and Mohammed Mounir track ?Hanina (Jasmon Mix)? is hot off the presses in Germany. Bahia El Idrissi?s ?Arhil? has been heard only by the lucky few who managed to get a hold of the his rare Dutch release. Sahara Lounge also features a previously unreleased remix of the Nickodemus and Carol C. favorite ?Cleopatra in NewYork.? \nThe exotic rhythms and melodies of the Middle East have long served as a muse for musical adventurers. Haunting desert blues of North Africa, soaring violins that buoy Egyptian song poems, trance-inducing Sufi chants, uplifting percussion of raks sharki (aka bellydance) and soulful strains of the Arabic oud are a few of the many different sounds flowing forth from the dunes, bazaars, streets, nightclubs and radios of the Middle East. \n\n\nTracklist:\nSharif - Shiraz \nNabiha Yazbeck - Astahel \nBahia El Idrissi - Arhil \nMaya Nasri - Khallini Biljao \nDahmane El Harrachi - Ya Rayah \nSoap Kills - Dub4me \nNickodemus - Cleopatra in New York \nYasser Habeeb - Elama \nIlhan Ersahin - Fly \nJasmon - Hanina \nJustin Adams - Desert Road \nToufic Farroukh - Lili S&amp;#039;en Fout \n\n\nThis is one of the many PutumayoÂ´s records I have in mind to upload, so please help keep seeding after you downloaded.\nEnjoy It!\nUlysses56\n\n\nFor more info: http://www.putumayo.com/","torrent":{"xt":"urn:btih:39b1ab2e7c22d39882a92fa4f3a6c11dbaef3163","amp;dn":"Putumayo+Presents-Sahara+Lounge+By+Ulysses56","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39b1ab2e7c22d39882a92fa4f3a6c11dbaef3163","infoHashBuffer":{"type":"Buffer","data":[57,177,171,46,124,34,211,152,130,169,47,164,243,166,193,29,186,239,49,99]},"announce":[],"urlList":[]}}