{"title":"Ameranthe - Over And Done (Single) mp3","uid":11215099,"size":8868515,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3a37ae9b8937da308d6c0a09af5e824aed2d8546&amp;dn=Ameranthe+-+Over+And+Done+%28Single%29+mp3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"analogkid6103","files":2,"time":1413317243,"description":"\nAmaranthe is a Swedish/Danish power/melodic death metal band that originates from Sweden and Denmark. Formed by Jake E. and Olof Morck, the project began taking shape when singers Elize Ryd and Andy Solvestrom signed on, as did drummer Morten Lowe. In April 2011 their debut album &quot;Amaranthe&quot; was released to worldwide acclaim, charting high in Sweden and Finland, and was the 84th most played album on Spotify in the whole world, all genres!\nIn Spring of 2011 they did a full on European tour with Kamelot and Evergrey, and now they set their sights on the world!\n\nSweden's AMARANTHE have gone from zero to a sensation in the metal world in just months time; supporting KAMELOT on tour in Europe right after the release of their debut album, playing Japan several times in 2011, including the mighty LOUDPARK festival and charting high on several national album charts, AMARANTHE could make even seasoned metal veterans green with envy.\n\nSporting a line-up spearheaded by a unique combination of three singers, AMARANTHE are instantly recognizable both in recording and at one of their spectacular live shows. The music fuses the most cutting edge of melodic metal with immediate and catchy choruses that will leave you humming for days.\n\nAMARANTHE will finish up their hugely successful debuting year with a massive tour with Gothenburg metal legends HAMMERFALL, which will take them to every corner of the European continent, with a duration of almost two months. A Special Edition rerelease of their debut album is also scheduled for fall 2011, which will feature heaps of bonus content, including new songs, tour documentaries, behind the scenes footage and much more!\n\n\nLine-up:\n\nJake E - Vocals\nElize - Vocals\nHenrik - Screams\nOlof - Guitars and keys\nMorten - Drums\nJohan - Bass\n\n\nAmaranthe - Massive Addictive","torrent":{"xt":"urn:btih:3a37ae9b8937da308d6c0a09af5e824aed2d8546","amp;dn":"Ameranthe+-+Over+And+Done+%28Single%29+mp3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a37ae9b8937da308d6c0a09af5e824aed2d8546","infoHashBuffer":{"type":"Buffer","data":[58,55,174,155,137,55,218,48,141,108,10,9,175,94,130,74,237,45,133,70]},"announce":[],"urlList":[]}}