{"title":"[NDS] Yu-Gi-Oh! GX - Spirit Caller Nintendo DS ROM Europe","uid":4969974,"size":58620900,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:3a8c487968beef1ac545d2d4a262c8ffb26d1ec1&amp;dn=%5BNDS%5D+Yu-Gi-Oh%21+GX+-+Spirit+Caller+Nintendo+DS+ROM+Europe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dsromking","files":-1,"time":1245720993,"description":"Marking the first appearance of the new TV show's characters and academy setting on this format, Yu-Gi-Oh! GX: Spirit Caller sees the player allocated a room in the Duel Academy's Obelisk Dormitory, where the beginner duelists are sent. While there, the player meets spectral forms which are revealed to be the 'Spirits of the Cards' who befriend the player and accompany them at all times. Thus, in the company of the spirit, the player must take on the Academy's best duelists.\n\nFollowing on from the best-selling Nightmare Troubadour title for Nintendo DS, Yu-Gi-Oh! GX: Spirit Caller is a significant leap forward for the series. The pace of the dueling system has been improved making for a fast game, with the format's stylus and touch screen perfectly suited for setting the various trap and monster cards the game contains. The player's spirit guide will also be on hand to offer advice for school life and is also used to update the game's unfolding plot.\n\nThe social aspect of the Trading Card Game is also emphasised thanks to the new game's stunning wireless capabilities. Players can dual against each other in one-on-one bouts, courtesy of the Wi-Fi connection and can play against players anywhere in the world via a dedicated server.\n\nIn addition to presenting a fast and incredibly authentic recreation of the Trading Card Game, Yu-Gi-Oh! GX: Spirit Caller also lets the player effectively put themselves in the game. An all-new character editor menu will allow users to create an onscreen likeness for use in the game and to be seen by their networked rivals, adding a personal element to the duels.","torrent":{"xt":"urn:btih:3a8c487968beef1ac545d2d4a262c8ffb26d1ec1","amp;dn":"%5BNDS%5D+Yu-Gi-Oh%21+GX+-+Spirit+Caller+Nintendo+DS+ROM+Europe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a8c487968beef1ac545d2d4a262c8ffb26d1ec1","infoHashBuffer":{"type":"Buffer","data":[58,140,72,121,104,190,239,26,197,69,210,212,162,98,200,255,178,109,30,193]},"announce":[],"urlList":[]}}