{"title":"Incomplete series (Eclipse)","uid":9012217,"size":1754453013,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:3c795d3abef84dde0d8cb79a018738dab40661bc&amp;dn=Incomplete+series+%28Eclipse%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Ichthypod_Crane","files":93,"time":1381122539,"description":"The ECUP, in an act of finality, drives off a cliff while tonsil-boxing Geena Davis and Susan Sarandon, with 'Eclipse Comics - Incompletes'!\n\nWell, here we are. The last(?) Eclipse upload. This torrent is comprised of series where I found some issues but not all of them. \n\nWARNING TO OCD PEOPLE: THESE SERIES ARE INCOMPLETE!!!\n\nHere's a list of the series included within:\n\nAkihiro Yamada's Lost Continent\nArea 88\nAxel Pressbutton\nBlack Magic\nBullet Crow, Fowl of Fortune\nCyber 7 (Books I and II)\nDominion\nFusion\nLaser Eraser and Pressbutton\nMiracleman Family\nNew DNAgents\nParts Unknown\nPortia Prinz of the Glamazons\nReid Fleming, World's Toughest Milkman\nSiegel &amp; Shuster Dateline 1930s\nSun Runners\nThe Masked Man\nThe New Wave\nThe Prowler\nThe Retaliator\nXenon\n\n(For information on these series, search for them at Grand Comics Database)\n\nAfter this, going on hiatus for a week or two, spending some time actually READING comics instead of moving them thru cyberspace. But before I go, there's a little business to take care of:\n\nFirst off, in the style of Marvel's obnoxious one-word teasers, here's some clues to the things I will be uploading after my sabbatical terminates:\n\nDRECK\nELEMENTARY\nRESEED\nALLIES\nMACHINE\n\nNext up, a PLEA: if anyone happens across any of the missing issues listed in the 'Eclipse Missing.txt' file, feel free to contact me at the enclosed email address and I'll happily do addendums. Or, if you want to upload them yourselves, that's cool too. Getting them back into circulation is the important thing.\n\nAnd lastly, some kudos:\n\nTHANKS SO MUCH to those who helped me plug significant holes in the ECUP: unmanx, binderguy1 (and, by extension, STFmaryville) - I'm looking at you. This 'Incomplete' torrent would have been the largest one without your assistance and advice!\n\nPROPS also to all of you who scoured your collections only to find that you couldn't help. As Woody Allen said, '90% of life is just showing up.' You did indeed show up and I appreciate your efforts.\n\nMUCH, MUCH LOVE to everyone who commented and encouraged! This was a long, laborious process - searching, accessing, amassing, assimilating, checking, reviewing, torrenting, researching, writing intros - and your acknowledgement of my efforts definitely helped me keep going.\n\nPLEASE PLEASE PLEASE! Keep the torrents alive for future generations of comics fans!\n\nAnd now, with a demonstrative, end-of-game-show air-kiss, I say once again: Thank you, creative teams! Thank you, scanners! Get it, seed it!!!!","torrent":{"xt":"urn:btih:3c795d3abef84dde0d8cb79a018738dab40661bc","amp;dn":"Incomplete+series+%28Eclipse%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c795d3abef84dde0d8cb79a018738dab40661bc","infoHashBuffer":{"type":"Buffer","data":[60,121,93,58,190,248,77,222,13,140,183,154,1,135,56,218,180,6,97,188]},"announce":[],"urlList":[]}}