{"title":"Anthony de Mello - The Way to Love (pdf)","uid":8512500,"size":1591014,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3cc0006fe6784d333d606b1d971d0552dfa9ad4a&amp;dn=Anthony+de+Mello+-+The+Way+to+Love+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pharmakate","files":-1,"time":1369614692,"description":"The Way to Love: The Last Meditations of Anthony de Mello (Doubleday, 1991). 147 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\ndescription:\n\nThe Way to Love contains the final flowering of Anthony de Mello's thought. Here, more than ever before in his bestselling writing, he grapples with the ultimate question of love. In thirty-one meditations, each several pages long and each preceded by a Gospel quotation, he implores his readers with his usual pithiness to break through illusion, the great obstacle to love. &quot;Love springs from awareness&quot;, de Mello insists, saying that it is only when we see the other as he or she really is that we begin to love. The second act of love, he says, is seeing ourselves without illusion - without the coercive nature of our needs, desires, memories, prejudices, and projections. If these steps are taken, then love will steal upon a person or into a relationship. But the task is not easy. &quot;The most painful act the human can perform&quot;, de Mello says, &quot;is the act of seeing. It is in that act of seeing that love is born&quot;. These are meditations to be savored and shared. This is a book to be held close to the heart.","torrent":{"xt":"urn:btih:3cc0006fe6784d333d606b1d971d0552dfa9ad4a","amp;dn":"Anthony+de+Mello+-+The+Way+to+Love+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3cc0006fe6784d333d606b1d971d0552dfa9ad4a","infoHashBuffer":{"type":"Buffer","data":[60,192,0,111,230,120,77,51,61,96,107,29,151,29,5,82,223,169,173,74]},"announce":[],"urlList":[]}}