{"title":"Knowing(2009)DVDRip.AC3(ENG)-DROCK","uid":6553586,"size":733511986,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3cf80f7a1ef51511914e14edfc3da08a350f53be&amp;dn=Knowing%282009%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"drock232","files":-1,"time":1311194033,"description":"A time capsule containing a cryptic message about the coming apocalypse sends a concerned father on a race to prevent the horrific events from unfolding as predicted in this sci-fi thriller directed by Alex Proyas (Dark City) and starring Nicolas Cage. 1958: As the dedication ceremony for a newly constructed elementary school gets under way, a time capsule containing student drawings of the future is buried on the grounds and scheduled to be unearthed on the school's 50th anniversary. Instead of submitting a drawing, however, one little girl scribbles a series of seemingly random numbers on her paper before it is buried. Fifty years later, the time capsule is unearthed for a new generation of students to examine. Young Caleb Koestler (Chandler Canterbury) is one of those students. The mysterious sequence of numbers falling into his possession, Caleb takes the paper to his father, Professor John Koestler (Cage), for examination. Studying the numbers, Professor Koestler soon discovers that they aren't random at all, but an encoded message containing the precise dates, death tolls, and coordinates of every major disaster since the time capsule was buried. Not only that, but the document also indicates that there will be three more such events, the last of which indicates a doomsday scenario that appears directly tied to Professor Koestler and Caleb. His desperate plea to authorities falling on deaf ears, Professor Koestler realizes that his only hope for preventing more lives from being lost is to take personal action. Though the author of the prophecies is no longer living, Professor Koestler is eventually able to track down her daughter Diana Wayland (Rose Byrne), and granddaughter Abby, who reluctantly agree to aid in the investigation. As the final date on the list draws near, Professor Koestler enters into a frantic race against time to prevent destruction on a global scale, in the process realizing that in order to save millions of lives, he may have to make the ultimate sacrifice. \n\nRipped with Handbrake.\n\nLength: 2 Hours 1 Minute\n\nFile Type: MP4\n\nFrame Width: 720\n\nFrame Height: 304\n\nFrame Rate: 29fps\n\nAudio\n\nBit Rate: 159kbps","torrent":{"xt":"urn:btih:3cf80f7a1ef51511914e14edfc3da08a350f53be","amp;dn":"Knowing%282009%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3cf80f7a1ef51511914e14edfc3da08a350f53be","infoHashBuffer":{"type":"Buffer","data":[60,248,15,122,30,245,21,17,145,78,20,237,252,61,160,138,53,15,83,190]},"announce":[],"urlList":[]}}