{"title":"[SoM]Suspect - Presunto Colpevole[DvdRip-Divx.Ita-Mp3]","uid":4833524,"size":952942772,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3de406408cdbbc7e3950bf4335a6b57955c475be&amp;dn=%5BSoM%5DSuspect+-+Presunto+Colpevole%5BDvdRip-Divx.Ita-Mp3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mitimex","files":1,"time":1239223327,"description":"A Washington, mentre una sera un giudice della Corte Suprema si suicida, la sua segretaria viene trovata sgozzata in uno degli scarichi del Potomac. La Polizia indizia ed arresta Carl Wayne Anderson, un barbone sordomuto che vive lÃƒÂ , al riparo tra i suoi cenci, quale autore del truce delitto. Su richiesta del giudice Matthew Helms, la giovane avvocatessa Kathleen Riley viene incaricata della difesa d'ufficio. Forzatamente rinunciando alle vacanze natalizie, la Riley prende contatto in prigione con il suo assistito. Il suo mutismo (ÃƒÂ¨ un reduce dal Vietnam, che la guerra ed i suoi tragici eventi hanno traumatizzato) viene faticosamente superato, ponendo domande e ricevendo brusche e sintetiche risposte su cartelli e lavagne. Ma l'uomo si dichiara invariabilmente innocente dell'assassinio. Nella giuria popolare si trova Eddie Sanger, un consigliere politico presso una delle commissioni del Senato. Un po' di simpatia per la donna e qualche strano dettaglio che sta affiorando nel dibattito (tra l'altro, Anderson ÃƒÂ¨ mancino, per cui la coltellata inferta alla Queen si manifesta del tutto implausibile), spingono Sanger ad investigare ed a contattare Kathleen. L'avvocatessa non vuole, non essendo i contatti personali con i giurati ammessi dalla legge, ma Eddie insiste e, dopo aver scoperto una serie di indizi, convince Kathleen che il vero colpevole ÃƒÂ¨ proprio il presidente della Corte nel processo contro Carl Wayne Anderson: un magistrato corrotto, ambizioso e arrampicatore, l'integerrimo all'apparenza Matthew Helms, che tenta perfino di eliminare la coraggiosa Riley prima di essere smascherato.","torrent":{"xt":"urn:btih:3de406408cdbbc7e3950bf4335a6b57955c475be","amp;dn":"%5BSoM%5DSuspect+-+Presunto+Colpevole%5BDvdRip-Divx.Ita-Mp3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3de406408cdbbc7e3950bf4335a6b57955c475be","infoHashBuffer":{"type":"Buffer","data":[61,228,6,64,140,219,188,126,57,80,191,67,53,166,181,121,85,196,117,190]},"announce":[],"urlList":[]}}