{"title":"LogoTV.Trailblazers.2014.DSR.x264-DaViEW","uid":10500850,"size":324438505,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3de982daa2c1a9f46f7175ca0a1f5d455668c67b&amp;dn=LogoTV.Trailblazers.2014.DSR.x264-DaViEW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"duranie","files":1,"time":1404695996,"description":"LogoTV.Trailblazers.2014.DSR.x264-DaViEW\n\nAirdate: June 26, 2014\n\n\nAlmost half a century after the Stonewall Riots, and on the one-year anniversary of DOMA being overruled, Logo is proud to announce Trailblazers, a first of its kind event to honor the pioneers who have made historic strides for LGBT equality. The one-hour special will feature the celebrities, politicians, activists, and trendsetters who are transforming our cultural landscape - as well as musical\nperformances from some of todays biggest artists. Trailblazers will take place at The Cathedral of Saint John the Divine, one of the\nfirst churches to host gay marriages in New York.\n\n\nTrailblazers will honor Edie Windsor and Roberta Kaplan, Jason Collins and 'Orange Is the New Black' for their groundbreaking work in LGBT civil rights. Also during the event, Daniel Radcliffe will introduce Young Trailblazers, which will highlight four members of The Trevor Project's Youth Advisory Council who are making an impact in their communities. Former REM front man Michael Stipe will\nalso be on hand to present the International Trailblazer award to John 'Longjones' Abdallah Wambere for his work fighting for LGBT rights in Uganda.\n\nThe show will feature musical performances by A Great Big World and Sia, with special appearances by Demi Lovato, Pete Wentz, Jared Leto, Kylie Minogue, Ariana Grande, Rita Ora, Iggy Azalea, Tyler Glenn of Neon Trees, Macklemore and Ryan Lewis and Mary Lambert. \n\n","torrent":{"xt":"urn:btih:3de982daa2c1a9f46f7175ca0a1f5d455668c67b","amp;dn":"LogoTV.Trailblazers.2014.DSR.x264-DaViEW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3de982daa2c1a9f46f7175ca0a1f5d455668c67b","infoHashBuffer":{"type":"Buffer","data":[61,233,130,218,162,193,169,244,111,113,117,202,10,31,93,69,86,104,198,123]},"announce":[],"urlList":[]}}