{"title":"Fieldrunners HD v1.20 Final + SD Data By bobiras2009","uid":7611639,"size":38650319,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:3f0bd8c21fb7363fde9acd6845bd757259474dc4&amp;dn=Fieldrunners+HD+v1.20+Final+%2B+SD+Data+By+bobiras2009&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"bobiras2009","files":-1,"time":1347082612,"description":"                                By bobiras2009\t\t\n\n\n\nIf you appreciate my work you can leave a commnent and seed this for as long you can to help me upload more.\n\n\n\nRequirements: Requires a phone running OS 2.1 or above\nOverview: Armed and animated, a motley crew is bound and determined to infiltrate your base. Control the field in FieldrunnersHD, a tower defense game adapted for your Android device. Blowing up little helmeted soldiers, helicopters, and big, muscle-headed buffoons has never been so visually stunning--because now you can annihilate them in hi-definition graphics. HOO-rah!\n\nCreatively Construct Your Defenses\nChoose from seven towers, each with its own special weaponry, and unleash a medley of destruction. You'll start small, maybe with the Gatling Tower, and work your way up to the Mortar Tower, delivering ultimate destructive powers via the nuke.\n\nWith a bird's-eye view of your field, strategically place your towers where you believe they'll be most effective. Drag and drop them from the menu to your field. Replace a tower by tapping it and then selling it for cash.\n\nEarn more points and more cash by preventing enemies from crossing the grassy field and infiltrating your base. Lose a life for each fieldrunner that penetrates your defenses.\n\nDemolish Countless Waves of Combatants\nMaster a wide array of tactics and strategies to help stand victorious against countless waves of unique land and air combatants. With over 400 levels across four unique battlefields, there's always a Fieldrunner to slay, level to unlock, or achievement to earn.\n\nThree modes of gameplay will satiate your tower defense desires. Start with Classic-- offered in Easy, Medium, or Hard. Two additional modes, Extended and Endless, can only be unlocked by beating Classic.\n\nHi-Def Graphics Make Destruction More Fun\nStunning graphics, sound effects, and background music enhance the already-addictive gameplay. The enemy maintains an undaunting and tenacious character, grunting and collapsing with each blow. It's just graphic enough to be amusing, but not gruesome enough to feel like you need a therapist.\n\n\nProduct Features\nRequires a phone running OS 2.2 or above, and is not compatible with tablets\nStrategically construct tower defenses to protect your base\nEarn cash by keeping the enemy out and buy more destructive towers\nPlay over 400 levels and 4 battlefields\nEnjoy Hi-definition graphics, and amusing sound effects\n\nWhat's in this version:\n* Updated for Ice Cream Sandwich\n* New download mechanism\n* Audio improvements\n* Bug fixes\n\n\n                                By bobiras2009\t\t","torrent":{"xt":"urn:btih:3f0bd8c21fb7363fde9acd6845bd757259474dc4","amp;dn":"Fieldrunners+HD+v1.20+Final+%2B+SD+Data+By+bobiras2009","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f0bd8c21fb7363fde9acd6845bd757259474dc4","infoHashBuffer":{"type":"Buffer","data":[63,11,216,194,31,183,54,63,222,154,205,104,69,189,117,114,89,71,77,196]},"announce":[],"urlList":[]}}