{"title":"Buffy Sainte-Marie Discography","uid":4878074,"size":1415505629,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:40ce0313168e2006acb54572bd965d6f77998396&amp;dn=Buffy+Sainte-Marie+Discography&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sowingmyseed","files":84,"time":1241226526,"description":"Coincidence And Likely Stories\nIlluminations\nI'm Gonna Be A Country Girl Again\nIt's My Way!\nLittle Wheel Spin and Spin\nMoonshot\n\n\nBuffy Sainte-Marie has enjoyed a long career that has seen her rise to stardom on the folk circuit and try her hand at country, rock, soundtrack themes, acting, activism, and children's television. For most listeners, she remains identified with the material she wrote and sang for Vanguard in the mid-'60s. Her songs that addressed the plight of the Native American, particularly &quot;Now That the Buffalo's Gone&quot; and &quot;My Country 'Tis of Thy People You're Dying,&quot; were the ones that generated the most controversy. Yet she was also skilled at addressing broader themes of war and justice (&quot;Universal Soldier&quot;) and romance (&quot;Until It's Time for You to Go&quot;). She was also a capable interpreter of outside material, although her idiosyncratic vibrato made large-scale commercial success out of the question.\n\nSainte-Marie was born to Cree Indian parents and adopted by a white family. Signed to Vanguard, she was one of the folk scene's more prominent rising stars in the '60s, and certainly the only widely heard performer articulating Native American viewpoints in song. Much of her best material from this era, however, gained its greatest commercial inroads via cover versions. &quot;Universal Soldier&quot; was one of Donovan's first hits. &quot;Until It's Time for You to Go,&quot; perhaps her best composition, was covered by numerous pop singers, and became a big British hit for Elvis Presley in the early '70s. &quot;Cod'ine,&quot; one of the few '60s songs to explicitly address the dangers of drugs, was covered by Californian rock bands Quicksilver Messenger Service and the Charlatans.\n\nSainte-Marie didn't pigeonhole herself as a folky, though, recording in Nashville in the late '60s in attempts to break into the country market. In the 1970s, she would make some rock records, including one (1971's She Used to Wanna Be a Ballerina) with contributions from Ry Cooder and Crazy Horse. These country and rock outings were far less successful, both commercially and artistically, than her early folk efforts.\n\nBut Sainte-Marie was never as reliant on selling units as most musicians. She kept busy with a long-running stint on Sesame Street, performing benefits for and organizing on behalf of Native Americans, and composing for movies (she won an Oscar for the theme to An Officer and a Gentleman, co-written with her husband, producer Jack Nitzsche). She hadn't made an album for 15 years before issuing Coincidence and Likely Stories in 1992. ","torrent":{"xt":"urn:btih:40ce0313168e2006acb54572bd965d6f77998396","amp;dn":"Buffy+Sainte-Marie+Discography","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40ce0313168e2006acb54572bd965d6f77998396","infoHashBuffer":{"type":"Buffer","data":[64,206,3,19,22,142,32,6,172,181,69,114,189,150,93,111,119,153,131,150]},"announce":[],"urlList":[]}}