{"title":"Lorraine / Black Room - Early Work &amp; Pop Noir","uid":4909815,"size":186356060,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:41a7438370e086d82563f75084f6bdf8e85c0baa&amp;dn=Lorraine+%2F+Black+Room+-+Early+Work+%26+Pop+Noir&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"white_arcades","files":20,"time":1243096621,"description":"Lorraine are a 3 piece Norwegian synth pop band who recently changed their name to Black Room. I first encountered them supporting &quot;a-ha&quot; and i thoroughly enjoyed their performance - the best support act I've ever encountered.\n\nThey've sadly suffered many setbacks and false starts while launching their career - a genuine shame since they've recorded some of the most euphoric, uplifting pop music I've heard in years. For this reason, I'd urge anyone who enjoys this music to do the right thing and buy their debut album &quot;Pop Noir&quot; which is finally available as a physical release from HMV Japan or alternatively from i-tunes.\n\nThis torrent is a compilation of Lorraine's early work, together with their new album &quot;Pop Noir&quot; released under the guise of Black Room.\n\nMany of the tracks on Pop Noir are re-recordings of existing songs the band had made on their previous record label. For the most part, I prefer the production of the earlier recordings, so I've included these where possible instead of the newer album versions. \n\nThere really are so many fantastic songs on this compilation, ranging from big beat stadium fillers to delicate, moody intimate numbers. If you appreciate a good melody, i think you'll be blown away.\n\nLike i say, please support the artist if you like the music. ","torrent":{"xt":"urn:btih:41a7438370e086d82563f75084f6bdf8e85c0baa","amp;dn":"Lorraine+%2F+Black+Room+-+Early+Work+%26+Pop+Noir","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41a7438370e086d82563f75084f6bdf8e85c0baa","infoHashBuffer":{"type":"Buffer","data":[65,167,67,131,112,224,134,216,37,99,247,80,132,246,189,248,232,92,11,170]},"announce":[],"urlList":[]}}