{"title":"Librivox M4B Audiobook - On Liberty by John Stuart Mill","uid":5518579,"size":80377000,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:41b059d7975aaebb654a4b978143aa0ca821e9ba&amp;dn=Librivox+M4B+Audiobook+-+On+Liberty+by+John+Stuart+Mill&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"VoxRatio","files":-1,"time":1272328409,"description":"Published in 1859, On Liberty details Mill's view that individuals should be left wholly free to engage in any activity, thought or belief that does not harm others. Simple though it sounds, it is a position that challenges our ideas on the very nature of government and society, and sheds light on some of the key issues we face today. A key text of political philosophy, On Liberty has been continuously in print since its first publication.\n\n(Summary by David Barnes).\n    \n\n\n\n\nAn M4B file is an audio file which can be bookmarked. This is the audio-book file type. These files can have chapter markers which can be skipped through as you would skip through files on a play list. They can have built in cover art and chapter images. They will remember where you left off each time you stop the file and come back to it . And variable speed settings on Ipods and a growing number of other mp3 players can be utilized by this file type. The ability to bookmark allows for as little as one large file instead of many small ones without the burden of fast forwarding to find your spot every time you resume listening or the fear of otherwise losing your place. The reduced number of files also makes browsing through your files to find your book and your place in it much less effort.\n","torrent":{"xt":"urn:btih:41b059d7975aaebb654a4b978143aa0ca821e9ba","amp;dn":"Librivox+M4B+Audiobook+-+On+Liberty+by+John+Stuart+Mill","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41b059d7975aaebb654a4b978143aa0ca821e9ba","infoHashBuffer":{"type":"Buffer","data":[65,176,89,215,151,90,174,187,101,74,75,151,129,67,170,12,168,33,233,186]},"announce":[],"urlList":[]}}