{"title":"American Spring - Spring...Plus (1972) [FLAC]","uid":8061433,"size":286404217,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:41f79acf8fb1c9ee360465a855b88127dfe3146a&amp;dn=American+Spring+-+Spring...Plus+%281972%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":24,"time":1359091640,"description":"Released: 1972 / 1989\nLabel: United Artists Records / See For Miles Records Ltd.\nCatalog#: UAS-5571 / SEE CD 269\nFormat: FLAC / Lossless / Log (100%) / Cue / CD, Reissue\nCountry: UK\nStyle: Rock, Pop Rock\n\nTracklisting:\n\n01. Tennessee Waltz\n02. Thinkin' 'Bout You Baby\n03. Mama Said\n04. Superstar\n05. Awake\n06. Sweet Mountain\n07. Everybody\n08. This Whole World\n09. Forever\n10. Good Time\n11. Now That Everything's Been Said\n12. Down Home\n13. Shyin' Away\n14. Fallin' In Love\n15. It's Like Heaven\n16. Had To Phone Ya\n\nCredits:\n\nLiner Notes: Brian Hogg\nVocals: Diane Rovell\nVocals: Marilyn Rovell Wilson\n\nThis is one of those albums that was thoroughly ignored when released in 1972, but over the ensuing decades has gained a cult following in collecting circles, particularly among Beach Boy/Brian Wilson fans where original copies now attract fairly large dollars. \n\nAs children, sisters Barbara, Diane, and Marilyn Rovell began singing as The Rovell Sisters. They won numerous local talent shows, eventually appearing on local GM car commercials. As teenagers crossed paths with Brian Wilson and the Beach Boys. Wilson took at interest in the Rovell sisters and with the addition of their cousin Ginger Blake started working with the group. Billed as The Honeys, they were eventually signed by Capitol Records (coincidently The Beach Boys' label). Over the next couple of years Wilson produced a string of singles for the group, but none broke commercially and by the mid-1960s they'd called it quits.\n\nFollowing the breakup of The Honeys Marilyn married Brian Wilson, but along with sister Diane her musical career was limited to providing occasional backing vocals on Beach Boy projects. The Spring project reportedly evolved out of a vocal harmonizing session in the Wilson household kitchen. Having just finished The Beach Boys' &quot;Carl and the Passions&quot; album, Wilson decided to start working with the two sisters, resulting in the release of a 1971 single:\n\n- 'Now Everything's Been Said' b/w 'Awake' (United Artists catalog number 50848)\n\nThe single did little commercially, but Wilson's participation was apparently enough of a draw for United Artists to finance a follow-on LP - 1972's cleverly titled &quot;Spring&quot;. (Throughout Europe the album was credited to 'American Spring' to avoid confusion with the English progressive band Spring). While Stephen Desper and David Sandler were credited with producing much of the material, Wilson was listed as the executive producer. Wilson also wrote or co-wrote four of the twelve tracks. Moreover the album literally dripped with Wilson/Beach Boy styled production effects (check out the Wilson original 'This Whole World'). Curiously, sporting a folkie feel, the opener 'Tennessee Waltz' was probably the most atypical effort. From there on tracks like Thinkin' bout You Baby'', 'Mama Said' and 'Awake' sported a winning mixture of Beach Boys-styled harmonies (including several tracks with Wilson's own backing vocals), and Phil Spector wall-of-sound styled production effects. That wasn't to understate the Rovells' contributions. The sisters weren't the most technically gifted singers you'd ever heard, but they had voices best described as sweet and innocent and they were gifted harmony singers. At least to my ears much of the set's unique charm lay in their inherent innocence and the set's lack of cutting edge sophistication. Exemplified by tracks like 'Sweet Mountain' (complete with French lyric segment), their cover of Tommy roe's 'Everybody', and 'Good Time' the album actually sounded like a group of friends who were having fun recording material for the sake of having a good time. The only real disappointment was a rote cover of The Carpenters' 'Superstar' (yeah I know Leon Russell and Bonnie Bramlett wrote it). United Artists also tapped the album for an instantly obscure and highly collectable single: \n\n &lt;a href=&quot;\nhttp://dickthespic.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/&lt;/a&gt;","torrent":{"xt":"urn:btih:41f79acf8fb1c9ee360465a855b88127dfe3146a","amp;dn":"American+Spring+-+Spring...Plus+%281972%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41f79acf8fb1c9ee360465a855b88127dfe3146a","infoHashBuffer":{"type":"Buffer","data":[65,247,154,207,143,177,201,238,54,4,101,168,85,184,129,39,223,227,20,106]},"announce":[],"urlList":[]}}