{"title":"Pre-Columbian Landscapes of Creation and Origin","uid":6509041,"size":12111384,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4223b6e39cd6103eb641e433531f683b36c26353&amp;dn=Pre-Columbian+Landscapes+of+Creation+and+Origin&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"_F1_","files":-1,"time":1309552034,"description":"John Staller, &quot;Pre-Columbian Landscapes of Creation and Origin&quot;\nPublisher: Springer | ISBN: 0387769099 | edition 2008 | PDF | 389 pages | 12.9 mb\n\nPre-Columbian Andean and Mesoamerican cultures have inspired a special fascination among historians, anthropologists, archaeologists, as well as the general public. As two of the earliest known and studied civilizations, their origin and creation mythologies hold a special interest. The existing and Pre-Columbian cultures from these regions are particularly known for having a strong connection with the natural landscape, and weaving it into their mythologies. A landscape approach to archaeology in these areas is uniquely useful shedding insight into their cultural beliefs, practices, and values. The ways in which these cultures imbued their landscape with symbolic significance influenced the settlement of the population, the construction of monuments, as well as their rituals and practices.\n\nThis edited volume combines research on Pre-Columbian cultures throughout Mesoamerica and South America, examining their constructed monuments and ritual practices. It explores the foundations of these cultures, through both the creation mythologies of ancient societies as well as the tangible results of those beliefs. It offers insight on specific case studies, combining evidence from the archaeological record with sacred texts and ethnohistoric accounts. The patterns developed throughout this work shed insight on the effect that perceived sacredness can have on the development of culture and society.","torrent":{"xt":"urn:btih:4223b6e39cd6103eb641e433531f683b36c26353","amp;dn":"Pre-Columbian+Landscapes+of+Creation+and+Origin","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4223b6e39cd6103eb641e433531f683b36c26353","infoHashBuffer":{"type":"Buffer","data":[66,35,182,227,156,214,16,62,182,65,228,51,83,31,104,59,54,194,99,83]},"announce":[],"urlList":[]}}