{"title":"Kate Bush - The Dreaming (1982)[EAC-MP3@320KBPS]","uid":4480250,"size":114193711,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:42695d250dbaff014966899fdc2253dde2b76aa2&amp;dn=Kate+Bush+-+The+Dreaming+%281982%29%5BEAC-MP3%40320KBPS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"seanprince","files":19,"time":1225538135,"description":"Kate Bush - The Dreaming (1982)[EAC-MP3@320KBPS]\t\n\n     \nTrack list\n\nKate Bush - The Dreaming\n\n01. Sat In Your Lap 03:29\n02. There Goes A Tenner 03:25\n03. Pull Out The Pin 05:26\n04. Suspended In Gaffa 03:55\n05. Leave It Open 03:20\n06. The Dreaming 04:41\n07. Night Of The Swallow 05:23\n08. All The Love 04:29\n09. Houdini 03:49\n10. Get Out Of My House 05:25\n\nBiography by Bruce Eder\n\nOne of the most successful and popular solo female performers of the past 20 years to come out of England, Kate Bush is also one of the most unusual, with her keening vocals and unusually literate and complex body of songs. As a girl, Catherine Bush studied piano and violin while attending the St. Joseph's Convent Grammar School in Abbey Wood in South London. She also amused herself playing an organ in the barn behind her parents' house. By the time she was a teenager, Bush was writing songs of her own. A family friend, Ricky Hopper, heard her music and brought Bush to the attention of Pink Floyd lead guitarist David Gilmour, who arranged for the 15-year-old Bush to record her first demo. With Gilmour's help, Bush was signed to EMI Records at age 16, though the company made the decision to bring her along slowly. She studied dance, mime, and voice, and continued writing. She also began thinking in terms of which of the 200 or so songs she'd written would be part of her first recording, and by 1977, she was ready to begin her formal career, which she did with an original song, &quot;Wuthering Heights,&quot; based on material from Emily Bronte's novel (and more directly inspired by Bush's seeing the 1970 film directed by Robert Fuest and starring Timothy Dalton and Anna Caulder Marshall).\n\nThe song would set a pattern for much of her future work, which was filled with literary and other external thematic allusions, and sometimes made even fans feel as though her lyrics ideally would come with footnotes -- heady stuff for a teenage rock singer in the late '70s. Her precocity was demonstrated by the approach she took to the song, deliberately affecting what she felt -- in her mid-teens -- was the voice of a ghostly Cathy, whom she regarded as a dangerous, grasping figure, reaching out to her lover even from the grave. &quot;Wuthering Heights&quot; rose to number one on the British charts when it was released in 1978, and Bush became an overnight sensation at the age of 19. Her debut album, The Kick Inside, a collection of material that she had written from 15 onward, some of it displaying extremely provocative and sophisticated sexual references and images, reached number three and sold over a million copies in the U.K.\n\nBush's second album, Lionheart, reached number six but didn't achieve anything like the sales totals or critical acclaim of its predecessor, and in later years Bush regretted the rush involved in planning and recording that album to capitalize on the success of her debut. In England during the spring of 1979, Bush embarked on what proved to be the only concert tour of her career to date, playing a series of shows highlighted by 17 costume changes, lots of dancing, and complex lighting. Bush was also apparently the first rock performer (at least since the days in the early '60s when Sweden's Spotnicks experimented with a more primitive version of the technology) to make use of a wireless voice microphone, which freed her up to move around the stage as few singers before her had been capable of doing. The tour proved both exhausting and financially disastrous, and ever since then Bush has avoided any but the most limited live concert appearances, primarily in support of certain charitable causes. This absence from the concert stage and the extended periods -- often as much as three to five years -- between albums, and the dense, reference-filled nature of her songs and lyrics, have also resulted in Bush becoming one of the more enigmatic pop artists in England since the Beatles; her relatively private personal life has only added to the mystique surrounding her. But her relative aloofness and her unusual sound and approach to pop music also made it more difficult to &quot;explain&quot; or encapsulate her work in a few words to the uninitiated, especially in America, where radio play and television exposure proved much harder to come by during the first few years of her career.\n\nBy the start of the 1980s, Bush was established as one of the most challenging and eccentric artists ever to have achieved success in rock music, with a range of sounds and interests that constantly challenged listeners, encompassing literature, art\n, poetry, cinema, history, and all manner of other subjects. &quot;Babooshka&quot; (1980) became her first Top Five single since &quot;Wuthering Heights,&quot; and her subsequent album, Never for Ever, entered the British charts at number one in September of 1980. During this period, Bush began co-producing her own work, a decisive step toward refining her sound and also establishing her independence from her record company. Although 1982's The Dreaming reached number three, the single &quot;There Goes a Tenner&quot; failed to reach the charts, and most observers felt that Bush had lost her audience. Bush was unfazed by the criticism, and even began taking steps to make herself more independent of her record label by establishing a home studio, this partly in response to EMI's huge studio charges on her previous records -- from the mid-'80s onward, Bush was free to spend her time at her leisure working out her sound, and it seemed to pay off with her next release.\n\nAfter two years' absence, Bush re-emerged in August of 1985 with &quot;Running Up That Hill,&quot; which became her second biggest-selling single. The accompanying album, Hounds of Love, the first record made at her 48-track home studio, debuted on the British charts at the number one position in September of 1985 and remained there for a full month, and soon after &quot;Running Up That Hill&quot; gave Bush her long-awaited American breakthrough, reaching number 30 on Billboard's charts. By this time, in England Bush was ranked alongside of Madonna in terms of her musical impact, &quot;Running Up That Hill&quot; having bumped &quot;Like a Virgin&quot; out of the number one chart position. The changes in her sound and her development as a writer/performer were showcased in the January 1987 best-of collection The Whole Story, for which she also re-recorded the lead vocal for &quot;Wuthering Heights&quot; to bring the song more in line with her sound as it was in her twenties (she later admitted that she would have liked to have done something similar with several of her other early recordings done when she was in her teens). The album also featured her latest single, &quot;Experiment IV,&quot; whose lyrics were built on a science fiction storyline that was echoed in the video, which Bush directed with a cast of familiar movie performers, and which came out like a miniaturized musical version of a Quatermass-like chiller. That same year, Bush won the Best British Female Artist award at the sixth-annual BRIT Awards in London.\n\nIn October of 1989, Bush's first new album in almost four years, The Sensual World, reached the British number two spot, and received an unprecedented promotional push in America, where she signed with Columbia Records for her future releases. Bush's next album, The Red Shoes (1993), inspired by the 1948 film by Michael Powell and Emeric Pressburger, debuted in the American Top 30, the first time one of her albums had ever charted that high -- Bush made a rare personal appearance in New York that December, an autograph signing at Tower Records on the Lower East Side, and the resulting line of admirers stretched almost six blocks, and required her to extend her appearance by several hours (she was still delighted and amazed by the procession five hours into the event). It would be another 12 years before Bush would resume her recording career. Rumors of a new album began circulating in the late '90s. During this time, Bush became a mother and quietly retreated to her countryside home on Berkshire, Reading, England. In 2005, Bush finally released her follow-up to The Red Shoes, the double-disc set Aerial.\n\nReview by MacKenzie Wilson\n\nFour albums into her burgeoning career, Kate Bush's The Dreaming is a theatrical and abstract piece of work, as well as Bush's first effort in the production seat. She throws herself in head first, incorporating various vocal loops, sometimes campy, but always romantic and inquisitive of emotion. She's angry and pensive throughout the entire album, typically poetic while pushing around the notions of a male-dominated world. However, Kate Bush is a daydreamer. Unfortunately, The Dreaming, with all it's intricate mystical beauty, isn't fully embraced compared to her later work. Album opener &quot;Sat in Your Lap&quot; is a frightening slight on individual intellect, with a booming chorus echoing over throbbing percussion and a butchered brass section. &quot;Leave It Open&quot; is goth-like with Bush's dark brooding, which is a suspending scale of vocalic laments, but it's the vivacious and moody &quot;Get Out of My House&quot; that truly brings Bush's many talents for art and music to the forefront. It prances with dripping piano drops and gritty guitar, and the violent rage felt as she screams &quot;Slamming,&quot; sparking a fury similar to what Tori Amos ignited during her inception throughout the 1990s. Not one to be in fear of fear, The Dreaming is one of Kate Bush's underrated achievements in depicting her own visions of love, relationships\n, and role play, not to mention a brilliant predecessor to the charming beauty of 1985's Hounds of Love.","torrent":{"xt":"urn:btih:42695d250dbaff014966899fdc2253dde2b76aa2","amp;dn":"Kate+Bush+-+The+Dreaming+%281982%29%5BEAC-MP3%40320KBPS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"42695d250dbaff014966899fdc2253dde2b76aa2","infoHashBuffer":{"type":"Buffer","data":[66,105,93,37,13,186,255,1,73,102,137,159,220,34,83,221,226,183,106,162]},"announce":[],"urlList":[]}}