{"title":"Antes.Que.El.Diablo.Sepa.Que.Has.Muerto.Spanish.Dual.XviD.AC3.HD","uid":4853750,"size":2147113228,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:427caac0bae0c0bcdd6ee7001d1e4dae68f2ca1d&amp;dn=Antes.Que.El.Diablo.Sepa.Que.Has.Muerto.Spanish.Dual.XviD.AC3.HD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"nahla","files":3,"time":1239977228,"description":"Reparto: Philip Seymour Hoffman, Ethan Hawke, Marisa Tomei, Albert Finney, Rosemary Harris, Aleksa Palladino, Michael Shannon, Amy Ryan\nDirector: Sidney Lumet\nProductor: Michael Cerenzie, William Gilmore, Brian Linse, Paul Parmar\nDuraciÃƒÂ³n: 01:57:00\nEstreno: viernes 23 mayo 2008\nGÃƒÂ©nero: Intriga\nPaÃƒÂ­s: EE.UU.\nDistribuidora: Azeta Cinema\nSinopsis: Charles y Nanette Hanson criaron a sus hijos tradicionalmente. Andy, el mayor, sigue enamorado de su bella esposa, Gina, y gana muy buen sueldo en una empresa de contabilidad. Hank, el pequeÃƒÂ±o, ama a su hija y estÃƒÂ¡ intentando pagarle los estudios en uno de los mejores colegios privados de la ciudad.\n\nPero la realidad es bien diferente: Andy se ha endeudado hasta las cejas para mantener su extravagante estilo de vida y su carÃƒÂ­sima drogadicciÃƒÂ³n, y aunque quiere a su esposa, el matrimonio estÃƒÂ¡ pasando una mala racha. La empresa en la que trabaja estÃƒÂ¡ siendo investigada por hacienda y dentro de poco tendrÃƒÂ¡ que sentarse en el banquillo de los declarantes. Su vida se estÃƒÂ¡ desintegrando por momentos y estÃƒÂ¡ desesperado. Hank tambiÃƒÂ©n tiene problemas econÃƒÂ³micos: se estÃƒÂ¡ retrasando en la manutenciÃƒÂ³n de su hija, bebe demasiado y estÃƒÂ¡ teniendo una aventura con la mujer de su hermano.\n\nAndy concibe un plan perfecto con el que espera solucionar los problemas de ambos, o al menos los econÃƒÂ³micos: Hank atracarÃƒÂ¡ la joyerÃƒÂ­a familiar a primera hora de la maÃƒÂ±ana en cuanto abra la tienda. La anciana dependienta nunca sabrÃƒÂ¡ quiÃƒÂ©n ha dado el golpe. PapÃƒÂ¡ y mamÃƒÂ¡ se llevarÃƒÂ¡n el dinero del seguro, ellos venderÃƒÂ¡n las joyas y todos tan contentos. Hank no se atreve a dar el golpe, asÃƒÂ­ que contrata a un ladronzuelo callejero, Bobby, al que conoce del bar en el que pasa las horas muertas. Bobby atracarÃƒÂ¡ la tienda mientras Hank espera en el coche.\n\nCalidad: HDRip\nAudio: castellano e inglÃƒÂ©s ac3 + subs","torrent":{"xt":"urn:btih:427caac0bae0c0bcdd6ee7001d1e4dae68f2ca1d","amp;dn":"Antes.Que.El.Diablo.Sepa.Que.Has.Muerto.Spanish.Dual.XviD.AC3.HD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"427caac0bae0c0bcdd6ee7001d1e4dae68f2ca1d","infoHashBuffer":{"type":"Buffer","data":[66,124,170,192,186,224,192,188,221,110,231,0,29,30,77,174,104,242,202,29]},"announce":[],"urlList":[]}}