{"title":"De Shrek Trilogie. ned.gespr.NLT-Release","uid":3986681,"size":1608215475,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:42a06f993cfe6fd866d776f1ba3e615b7591d232&amp;dn=De+Shrek+Trilogie.+ned.gespr.NLT-Release&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"linday1","files":12,"time":1200847500,"description":"Shrek 1\n\nVerenigde Staten\nAnimatie / Komedie\n90 minuten\n\ngeregisseerd door Andrew Adamson en Vicky Jenson\nmet de stemmen van Mike Myers, Cameron Diaz en Eddie Murphy\n\nDe slechte heerser van Duloc (de kleine Lord Farquaad) heeft alle sprookjesfiguren uit zijn land verbannen. De figuren, inclusief een praatgrage ezel, vluchten naar het moerasland van de oger Shrek, die erg op z&amp;#039;n privacy gesteld is. Farquaad maakt een deal met Shrek: als hij de mooie prinses Fiona redt uit een kasteel dat bewaakt wordt door een draak, krijgt Shrek z&amp;#039;n land terug.\n\n\nShrek 2\n\n\n\nVerenigde Staten\nAnimatie / Komedie\n105 minuten\n\ngeregisseerd door Andrew Adamson, Kelly Asbury en Conrad Vernon\nmet de stemmen van Mike Myers, Cameron Diaz en Eddie Murphy\n\nNa teruggekeerd te zijn van hun huwelijksreis horen Shrek en Fiona dat haar ouders van het huwelijk gehoord hebben. Ze willen niets liever dan haar ware liefde te ontmoeten in hun koninkrijk Far Far Away. Ze zijn zich echter niet bewust van de veranderingen die hun dochter onlangs ondergaan heeft. En dat hun nieuwe schoonzoon een 350 kilo zware Ogre met een slechte hygiene is en een pratende ezel als vriend heeft.\n\n\n\nShrek 3 \n\n\n\nVerenigde Staten\nAnimatie / Komedie\n92 minuten\n\ngeregisseerd door Raman Hui en Chris Miller\nmet de stemmen van Mike Myers, Eddie Murphy en Cameron Diaz\n\nShrek (Meyers) en Fiona (Diaz) zijn waarnemend koning en koningin. Ze vinden er maar niets aan, dus gaat shrek samen met Donkey (Murphy) en Puss In Boots (Banderas) op zoek naar de ware troonopvolger. Dat blijkt een neef van Koningin Lillian te zijn, Artie, die op kostschool zit en totaal geen interesse heeft in het koningschap. Terwijl Shrek weg is, is Prince Charming bezig met een staatsgreep om Far Far Away over te nemen.\n\n\n\nDeze torrent en nog veel meer torrents kun je ook vinden op het NLT Torrent Forum.\n\n\n\n\n\n\nVeel kijk plezier!!!!","torrent":{"xt":"urn:btih:42a06f993cfe6fd866d776f1ba3e615b7591d232","amp;dn":"De+Shrek+Trilogie.+ned.gespr.NLT-Release","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"42a06f993cfe6fd866d776f1ba3e615b7591d232","infoHashBuffer":{"type":"Buffer","data":[66,160,111,153,60,254,111,216,102,215,118,241,186,62,97,91,117,145,210,50]},"announce":[],"urlList":[]}}