{"title":"Churchill's Secret War by Madhusree Mukerjee [ePub] - Traitor","uid":9615345,"size":911083,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4359269a77b65048c67af987b02e1000334b9d5e&amp;dn=Churchill%27s+Secret+War+by+Madhusree+Mukerjee+%5BePub%5D+-+Traitor&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Xetron","files":1,"time":1392408614,"description":"A dogged enemy of Hitler, resolute ally of the Americans, and inspiring leader through World War II, Winston Churchill is venerated as one of the truly great statesmen of the last century. But while he has been widely extolled for his achievements, parts of Churchill's record have gone woefully unexamined. As journalist Madhusree Mukerjee reveals, at the same time that Churchill brilliantly opposed the barbarism of the Nazis, he governed India with a fierce resolve to crush its freedom movement and a profound contempt for native lives. A series of Churchill's decisions between 1940 and 1944 directly and inevitably led to the deaths of some three million Indians. The streets of eastern Indian cities were lined with corpses, yet instead of sending emergency food shipments Churchill used the wheat and ships at his disposal to build stockpiles for feeding postwar Britain and Europe. Combining meticulous research with a vivid narrative, and riveting accounts of personality and policy clashes within and without the British War Cabinet, Churchill's Secret War places this oft-overlooked tragedy into the larger context of World War II, India's fight for freedom, and Churchill's enduring legacy. Winston Churchill may have found victory in Europe, but, as this groundbreaking historical investigation reveals, his mismanagement-facilitated by dubious advice from scientist and eugenicist Lord Cherwell-devastated India and set the stage for the massive bloodletting that accompanied independence.","torrent":{"xt":"urn:btih:4359269a77b65048c67af987b02e1000334b9d5e","amp;dn":"Churchill%27s+Secret+War+by+Madhusree+Mukerjee+%5BePub%5D+-+Traitor","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4359269a77b65048c67af987b02e1000334b9d5e","infoHashBuffer":{"type":"Buffer","data":[67,89,38,154,119,182,80,72,198,122,249,135,176,46,16,0,51,75,157,94]},"announce":[],"urlList":[]}}