{"title":"Bush - Razorblade Suitcase (1996) ","uid":5793011,"size":413750688,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:45c07e90aca04ba659c0a32952d24ce76fe712bc&amp;dn=Bush+-+Razorblade+Suitcase+%281996%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"fireman63ed","files":-1,"time":1282924171,"description":"Bush - Razorblade Suitcase (1996)\n\nThe album's working title was Ghost Medicine, but was changed for unknown reasons. The title is a line from the lyrics of the song &quot;Synapse&quot;. It has a slightly darker tone than Bush's previous album, Sixteen Stone, which led to comparisons between Razorblade Suitcase and Nirvana's album In Utero, because some believed Bush sounded similar to Nirvana, and Steve Albini recorded both albums. Albini had also recorded the Pixies' breakthrough LP Surfer Rosa, and was co-art directed by Vaughan Oliver and Adrian Philpott. Vaughan Oliver had also done the artwork for Surfer Rosa. Gavin Rossdale  made statements around the time of the release that he only hoped that Bush would be one day as successful as the Pixies were in England.\n\nSixteen Stone was a radio-friendly grunge rock album that sold millions of copies. Razorblade Suitcase, however, was more abrasive than the past album and as a result did not sell as well. However, Razorblade Suitcase reached the number-one spot on the Billboard 200, while Sixteen Stone peaked at the number-four spot.\n\nDespite the album selling fewer copies than Sixteen Stone in the US, it marked a commercial peak for the band in their native Britain - it reached number four on the UK Albums Chart, whilst &quot;Swallowed&quot; and &quot;Greedy Fly&quot; both peaked in the Top 20 of the UK Singles Chart.","torrent":{"xt":"urn:btih:45c07e90aca04ba659c0a32952d24ce76fe712bc","amp;dn":"Bush+-+Razorblade+Suitcase+%281996%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"45c07e90aca04ba659c0a32952d24ce76fe712bc","infoHashBuffer":{"type":"Buffer","data":[69,192,126,144,172,160,75,166,89,192,163,41,82,210,76,231,111,231,18,188]},"announce":[],"urlList":[]}}