{"title":"The Ecotechnic Future (2009) by John Michael Greer","uid":10444538,"size":10316262,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:45c59c5b9a13788dad33b3a79b34f930da37f149&amp;dn=The+Ecotechnic+Future+%282009%29+by+John+Michael+Greer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1403933736,"description":"The Ecotechnic Future - Envisioning a Post-Peak World (2009) by John Michael Greer.pdf\n\nIn response to the coming impact of peak oil, John Michael Greer helps us envision the transition from an industrial society to a sustainable ecotechnic world - not returning to the past, but creating a society that supports relatively advanced technology on a sustainable resource base.\n\nFusing human ecology and history, this book challenges assumptions held by mainstream and alternative thinkers about the evolution of human societies. Human societies, like ecosystems, evolve in complex and unpredictable ways, making it futile to try to impose rigid ideological forms on the patterns of evolutionary change. Instead, social change must explore many pathways over which we have no control. The troubling and exhilarating prospect of an open-ended future, he proposes, requires dissensus - a deliberate acceptance of radical diversity that widens the range of potential approaches to infinity.\n\nWritten in three parts, the book places the present crisis of the industrial world in its historical and ecological context in part one; part two explores the toolkit for Ecotechnic Age, and part three opens a door to the complexity of future visions.\n\nFor anyone concerned about peak oil and the future of the industrial society, this book provides a solid analysis of how we got to where we are, and a practical toolkit to prepare for the future.\n\n288 pages\nPublisher: New Society Publishers (October 1, 2009)\nLanguage: English\nISBN-10: 0865716390\nISBN-13: 978-0865716391","torrent":{"xt":"urn:btih:45c59c5b9a13788dad33b3a79b34f930da37f149","amp;dn":"The+Ecotechnic+Future+%282009%29+by+John+Michael+Greer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"45c59c5b9a13788dad33b3a79b34f930da37f149","infoHashBuffer":{"type":"Buffer","data":[69,197,156,91,154,19,120,141,173,51,179,167,155,52,249,48,218,55,241,73]},"announce":[],"urlList":[]}}