{"title":"The 6ths - Wasps' Nests [1995]  [EAC/FLAC]","uid":10731762,"size":317128548,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:467ff5ae0ba12361d347f5c994f2d2613e444fc9&amp;dn=The+6ths+-+Wasps%27+Nests+%5B1995%5D++%5BEAC%2FFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":-1,"time":1407634078,"description":"\nCreated by Ratio: 152.31dickthespic 6 minutes ago\nMusic : Indie : Lossless\n \n\n\nFLAC / Lossless / Log (100%) / Cue\nLabel/Cat#: London / London #828592\nCountry: USA\nYear: March 28, 1995\nGenre: indie pop rock\nFormat: CD\n\n\n\n\n\n\n\n01. San Diego Zoo (feat. Barbara Manning) (03:21)\n02. Aging Spinsters (feat. Stephin Merritt) (02:19)\n03. All Dressed Up in Dreams (feat. Mary Timony) (02:54)\n04. Falling Out of Love (With You) (feat. Dean Wareham) (02:54)\n05. Winter in July (feat. Ayako Akashiba) (02:32)\n06. Pillow Fight (feat. Mitch Easter) (02:34)\n07. Dream Hat (feat. Mac McCaughan) (02:28)\n08. Movies in My Head (feat. Georgia Hubley) (04:18)\n09.- In the City in the Rain (feat. Lou Barlow) (03:42)\n10. Looking for Love (In the Hall of Mirrors) (feat. Amelia Fletcher) (02:43)\n11. Heaven in a Black Leather Jacket (feat. Robert Scott) (02:46)\n12. Here in My Heart (feat. Anna Domino) (03:30)\n13. Puerto Rico Way (feat. Mark Robinson) (03:28)\n14. You Can't Break a Broken Heart (feat. Jeffrey Underhill) (03:16)\n15. When I'm Out of Town (feat. Chris Knox) (02:33)\n\n\n\n\n\n\nA one-of-a-kind collaborative effort, masterminded by producer/songwriter Stephin Merritt, and sung well by various cult stars of the alternative rock scene. The results are unusually successful, if a bit toward the light and precious side, mixing indie attitude with melodicism and production finesse.\n\nStephin Merritt was pretty busy in the 90s, fronting not only the Magnetic Fields but also Future Bible Heroes, the Gothic Archies, and this thing right here, the guest-vocal side-project The 6ths. It's Merritt doing all the music by himself, which is very synth heavy, and each song utilizes a different 'guest' singer, singing the lyrics/melody that Merritt wrote. I don't know if I quite get the necessity of this particular project, mainly because I think Stephin is a better singer than half of the guests he has on here, and the music and lyrics are no different than a typical mid-90s Magnetic Fields LP, so I don't see why this couldn't have been another MF record. But whatever the name, Merritt's songs are still usually great, and this one is no exception. It has possibly his most sinister lyric ever, (in &quot;Aging Spinsters&quot;) &quot;but when the city's so hot the winos burst into flames/when the Jesus freaks collapse with the weight of their claims&quot; that I love, and musically it's pretty much all synths (which I'm fine with). The only time an electric guitar presence is ever felt is on &quot;Pillow Fight&quot;, which has Mitch Easter playing the solo himself. Generally, the females fare better with Merritt's songs than the guys, I really like Georgia (from Yo La Tengo), Barbara Manning, and Mary Timony (from Helium) singing Stephin melodies, but it also might be they just happened to get better songs than everyone else, and in fact pretty much everyone just gives a solemn, straight-ahead performance. I'm sure this is exactly what he wanted anyway, but did he have to go and mix the vocals so low that they're sometimes buried underneath the synths (I can barely make out what Mark Robinson is singing on his tune)? It's not a huge deal, but I did rate this a little lower than the MF records because I hear just slightly less effort put into some of these songs than I'd expect, like for example &quot;Pillow Fight&quot; or &quot;Falling Out of Love&quot;, both of which use the same exact chord progression for the chorus as well as the verses, with only minor changes in the vocal melody. The same is true of &quot;In the City in the Rain&quot;, which uses the ever-popular I IV V for the entirety, without any unique vocal melody or instrumentation to help it along. It starts off really strong though, and if you love the synthified version of Stephin Merritt this is essential listening.","torrent":{"xt":"urn:btih:467ff5ae0ba12361d347f5c994f2d2613e444fc9","amp;dn":"The+6ths+-+Wasps%27+Nests+%5B1995%5D++%5BEAC%2FFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"467ff5ae0ba12361d347f5c994f2d2613e444fc9","infoHashBuffer":{"type":"Buffer","data":[70,127,245,174,11,161,35,97,211,71,245,201,148,242,210,97,62,68,79,201]},"announce":[],"urlList":[]}}