{"title":"The Compatibility Gene: How Our Bodies Fight Disease, Attract Ot","uid":10552567,"size":2214618,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:46c4c05ac5e17793a70cbe32b079801b2e720723&amp;dn=The+Compatibility+Gene%3A+How+Our+Bodies+Fight+Disease%2C+Attract+Ot&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MucGar","files":-1,"time":1405352448,"description":"The Compatibility Gene: How Our Bodies Fight Disease, Attract Others, and Define Our Selves\n\n\nEnglish | 2013 | ISBN: 0199316414 , 0199393931 | 248 pages | PDF, EPUB, MOBi\n\nThe Compatibility Gene takes readers on a global journey of discovery spanning 60 years, involving scores of scientists, and encompassing the history of transplants and immunology. That journey has revealed astonishing links between who we are as individuals and our never-ceasing struggle to survive disease.\n\nMost of the 25,000 genes we possess are the same for all of us. Compatibility genes are those that vary most from person to person and give each of us a unique molecular signature. These genes determine both the extent to which we are susceptible to a vast range of illnesses and the different ways each of us fights disease. In The Compatibility Gene, distinguished immunologist Daniel Davis draws on new research to suggest a number of even more fascinating-and controversial-conclusions about compatibility genes: that we find others more or less sexy according to their compatibility genes (dating services are starting to match people in this way); that the wiring between some neurons is kept or broken according to the activity of compatibility genes; and that compatibility genes influence the chances of a couple having a successful pregnancy. Profoundly personal, life-forming and life-changing decisions appear to be governed by the actions of a few inherited genes. Most importantly, Davis proposes that because we each respond slightly differently to any particular disease, in the not-too-distant future vaccines and other medications may be tailored to match our compatibility genes, a revolutionary breakthrough in the fight against disease.\n\nIncluding vivid portraits of the scientists who worked tirelessly to unlock the secrets of compatibility genes, as well as patients who survived disease due to lucky genetic inheritances, The Compatibility Gene explains an aspect of human biology that will undoubtedly have profound impacts on medical practice in the 21st Century.","torrent":{"xt":"urn:btih:46c4c05ac5e17793a70cbe32b079801b2e720723","amp;dn":"The+Compatibility+Gene%3A+How+Our+Bodies+Fight+Disease%2C+Attract+Ot","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"46c4c05ac5e17793a70cbe32b079801b2e720723","infoHashBuffer":{"type":"Buffer","data":[70,196,192,90,197,225,119,147,167,12,190,50,176,121,128,27,46,114,7,35]},"announce":[],"urlList":[]}}