{"title":"Perrys.DPs.6.XXX.DVDRiP.x264-PORNOLATiON","uid":8875509,"size":2623273512,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:471a4be186b4802cf4a956e07d3a0b13b13420a7&amp;dn=Perrys.DPs.6.XXX.DVDRiP.x264-PORNOLATiON&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":4,"uploader":"chkm8te","files":1,"time":1378187109,"description":"Perrys.DPs.6.XXX.DVDRiP.x264-PORNOLATiON\n\nCast : Samia Duarte, Anita Bellini, Andrea Parker, Thomas Stone, David, Marc Dupree, Mira Sunset \n\nWhen director David Perry and his well-hung buddies get hold of a hot European model, it's a good bet that she'll soon have all her holes filled with throbbing meat. The French pornographer is known for his obsession with insatiable sluts, the kind that isn't shy about taking cock by the double-dose to get her holes simultaneously stuffed. &quot;Perry's DPs 6,&quot; the latest in David's signature line of dual-penetration perversion, features four stunning women, each of whom possesses an appetite for fucking that requires teamwork. Four filthy threesomes Combine the Glamour of Classic Feminine Beauty with the filthy Thrill of Multiple Pricks, no-holes-Barred Anal Debauchery and messy, sloppy Oral cum shots! Wearing A hot-Pink fishnet bodysuit, All Natural Beauty Spanish Samia Duarte masturbates sensuously, distracting boyfriend Steve Holmes and business partner Thomas Stone. Before long Samia's tight orifices get the attention and brutal stuffing they need. Gorgeous, petite teen Anita Bellini enjoys a sensuous masturbatory session with anal toys and an outrageous double-dicking. Driving down the road, David spots slender blonde beauty Andrea Parker, who invites him to a secluded area for a quick POV-style suck and fuck ... still not sated, They Visit muscular Thomas Stone to Andrea's Complete Fantasy lustful! Finally, Classic Brunette bitch Mira Sunset Services and David Young Markus Dupree until her sphincter is Widely Yawning. The disc includes some revealing behind-the-scenes interviews with the luscious cast. 'Perry's DPs 6' is a nonstop anal rampage crammed with nasty fun. You still can't spell David Perry without DP!\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=b1hfaep2e0ah36vvci40.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=b1hfaep2e0ah36vvci40.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=91be18lpc7zgpwdlgq1v.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=91be18lpc7zgpwdlgq1v.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:471a4be186b4802cf4a956e07d3a0b13b13420a7","amp;dn":"Perrys.DPs.6.XXX.DVDRiP.x264-PORNOLATiON","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"471a4be186b4802cf4a956e07d3a0b13b13420a7","infoHashBuffer":{"type":"Buffer","data":[71,26,75,225,134,180,128,44,244,169,86,224,125,58,11,19,177,52,32,167]},"announce":[],"urlList":[]}}