{"title":"William S. Burroughs - The Jack Kerouac School of Disembodied Po","uid":5916662,"size":1509741896,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:477ccc476586d161419e1c0f61b67f27483939e8&amp;dn=William+S.+Burroughs+-+The+Jack+Kerouac+School+of+Disembodied+Po&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"geogaddi000","files":-1,"time":1288255145,"description":"William S. Burroughs &lt;a href=&quot;\nhttp://www.archive.org/details/naropa&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.archive.org/details/naropa&lt;/a&gt;\n\nWelcome to Naropa Poetics Audio Archives\n\nThe Naropa University Archive Project is preserving and providing access to over 5000 hours of recordings made at Naropa University in Boulder, Colorado. The library was developed under the auspices of the Jack Kerouac School of Disembodied Poetics (the university's Department of Writing and Poetics) founded in 1974 by poets Anne Waldman and Allen Ginsberg. It contains readings, lectures, performances, seminars, panels and workshops conducted at Naropa by many of the leading figures of the U.S.literary avant-garde.\n\nThe collection represents several generations of artists who have contributed to aesthetic and cultural change in the postmodern era. The Naropa University Archive Project seeks to enhance appreciation and understanding of post-World War II American literature and its role in social change, cultural criticism, and the literary arts through widespread dissemination of the actual voices of the poets and writers of this period. Current interest in Oriental religions, environmentalism, political activism, ethnic studies, and women's consciousness is directly indebted to the work of these New American Poets, writers and musicians.\n\nFunding for this project was provided by the National Endowment for the Arts, the National Endowment for the Humanities, Save America's Treasures, the GRAMMY Foundation, the Internet Archive, the Collaborative Digitization Program, and private donors. If this collection is important to you please help us preserve it with your donations.\n\nFor more information visit our web site at www.naropaarchive.org or email us at &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;3c5d4e5f54554a597c525d4e534c5d1259584912&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n\n\nVariable Bitrate MP3 (Hi-Fi)\n\n\n1975-01-01 - William Burroughs Loka interview\n &lt;a href=&quot;\nhttp://www.archive.org/details/naropa_william_burroughs_loka&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.archive.org/details/naropa_william_burroughs_loka&lt;/a&gt;\n\nAn interview with William S. Burroughs for Loka magazine with additional commentary by Allen Ginsberg and Anne Waldman. The interview covers topics such as government, the New Age movement, identity, biology, cloning, war, escapism, and gurus. Keywords: beat generation, political poetry, activist poetry\n\n\n1976-07-20 - William S. Burroughs lecture\n &lt;a href=&quot;\nhttp://www.archive.org/details/naropa_william_s_burroughs2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.archive.org/details/naropa_william_s_burroughs2&lt;/a&gt;\n\nFirst half of a lecture by William S. Burroughs including a tape recorded experiment called &quot;Paranormal Voices,&quot; a cut-up experiment of Brion Gysin, experiments with Sommerville, messages from dreams, The Last Words of Dutch Schultz, and phrases of minimal context. Burroughs also discusses Shakespeare, computers, Homer, Gertrude Stein, James Joyce, T.S. Eliot, and Carl Jung. Lecture ends with a question and answer session. (Continues on 76p019.) Keywords: beat movement, experimental writing, aural poetry, cut-up.\n &lt;a href=&quot;\nhttp://www.archive.org/details/naropa_william_s_burroughs&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.archive.org/details/naropa_william_s_burroughs&lt;/a&gt;\n\nSecond half of a lecture by William S. Burroughs including a tape recorded experiment called &quot;Paranormal Voices,&quot; a cut-up experiment of Brion Gysin, experiments with Sommerville, messages from dreams, The Last Words of Dutch Schultz, and phrases of minimal context. Burroughs also discusses Shakespeare, computers, Homer, Gertrude Stein, James Joyce, T.S. Eliot, and Carl Jung. Lecture ends with a question and answer session. (Continued from 76p018.) Keywords: beat movement, experimental writing, aural poetry, cut-up\n\n\n1976-07-22 - William S. Burroughs class on writing sources\n &lt;a href=&quot;\nhttp://www.archive.org/details/Burroughs_class_on_writing_sources_July_1976_76P020&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.archive.org/details/Burroughs_class_on_writing_sources_July_1976_76P020&lt;/a&gt;\n\nFirst half of a class with William S. Burroughs discussing various sources for writing, including dreams, voices (external and internal), and cut-up, giving examples from his own work. Burroughs emphasizes the importance of egolessness to the writer and presents his sources as a means to that end. In the course of the discussion, Burroughs airs many of his ideas about consciousness. There are questions and answers halfway through the session.\n\nSecond half of a class with William S. Burroughs, continuing with his exploration of egoless sources for writing, focusing on the nature of egolessness, especially its relation to Buddhist notions of egolessness and nonattachment. Notably, Burroughs maintains that &quot;the goal of enlightenment is not necessarily the goal of the writer.&quot; There are some brief digressions on the relation between written, spoken, and nonverbal communication. (Continued from 76p020. Continues on 76p022.) Keywords: Beat Movement, Experimental Writing, Aural Poetry, Consciousness and Literature\n\nEnd of a class with William S. Burroughs, finishing with a question and answer session with Burroughs responding to remarks about women, non-referential images, non-linear thinking, and telepathy.\n\n\n1976-08-07 - Allen Ginsberg, Anne Waldman, Chogyam Trungpa Rinpoche and William S. Burroughs reading\n &lt;a href=&quot;\nhttp://www.archive.org/details/Allen_Ginsberg__Anne_Waldman__Chogyam_Tr_76P122&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.archive.org/details/Allen_Ginsberg__Anne_Waldman__Chogyam_Tr_76P122&lt;/a&gt;\n\nFirst half of a reading by Allen Ginsberg, Anne Waldman, Chogyam Trungpa Rinpoche and William S. Burroughs. Ginsberg reads &quot;Ayer's rock,&quot; &quot;December 1974,&quot; &quot;Hospital window,&quot; &quot;C'mon Jack,&quot; &quot;Don't grow old&quot; and &quot;Father death blues.&quot; Waldman reads &quot;Musical garden,&quot; &quot;Energy crisis,&quot; &quot;Boulder poem&quot; and &quot;Shaman hisses.&quot; David Rome reads Trungpa's &quot;Song of the white banner,&quot; &quot;Letter to Marpa,&quot; &quot;In spring,&quot; spontaneous poems, &quot;1111 Pearl Street&quot; and &quot;Zero is nothing.&quot;\n &lt;a href=&quot;\nhttp://www.archive.org/details/Allen_Ginsberg__Anne_Waldman__Chogyam_Tr_76P123&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.archive.org/details/Allen_Ginsberg__Anne_Waldman__Chogyam_Tr_76P123&lt;/a&gt;\n\nSecond half of a reading by Allen Ginsberg, Anne Waldman, Chogyam Trungpa Rinpoche and William S. Burroughs. Burroughs reads &quot;Take Nirvana&quot; and &quot;Twilight's last gleaming,&quot; with the first appearance of Dr. Benway.\n\n\n1979-08-08 - William S. Burroughs class on creative reading\n &lt;a href=&quot;\nhttp://www.archive.org/details/79P040&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.archive.org/details/79P040&lt;/a&gt;\n\nFirst half of a William S. Burroughs lecture on Joseph Conrad's Lord Jim and Heart of Darkness, F. Scott Fitzgerald's The Great Gatsby and A Short Trip Home, and Stephen King's The Shining. Burroughs also discusses exercises for increasing awareness, books as mental film, codes of conduct, heroes, and the film of Burroughs's novel Naked Lunch. (Continues on 79p040.) Keywords: beat movement, experimental literature, consciousness in literature\n &lt;a href=&quot;\nhttp://www.archive.org/details/naropa_william_s_burroughs_class_on3&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.archive.org/details/naropa_william_s_burroughs_class_on3&lt;/a&gt;\n\nSecond half of a William S. Burrough lecture on Joseph Conrad's Lord Jim and Heart of Darkness, F. Scott Fitzgerald's The Great Gatsby and A Short Trip Home, and Stephen King's The Shining. Burroughs also discusses exercises for increasing awareness, books as mental film, codes of conduct, heroes, and the film of Burroughs's novel Naked Lunch. (Continued from 79p040.) Keywords: beat movement, experimental literature, consciousness in literature\n\n\n1979-08-10 - William S. Burroughs class on creative reading\n &lt;a href=&quot;\nhttp://www.archive.org/details/naropa_william_s_burroughs_class_on4&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.archive.org/details/naropa_william_s_burroughs_class_on4&lt;/a&gt;\n\nWilliam S. Burroughs lectures on creative reading, including a discussion about various authors including Joseph Conrad, Denton Welch, Jane Bowles, Brion Gysin, and Julian Jaynes. Burroughs also addresses subjects such as art heroes, hemispheres of the brain, and the training of assasins. Keywords: beat movement, experimental literature, consciousness in literature\n\n\n1979-08-13 - William S. Burroughs class on creative reading\n\nFirst half of a William S. Burroughs lecture on creative reading. The lecture mentions a wide variety of authors, including Alistair Crowley, Paul Bowles, and many others. The class also discusses science fiction, non-fiction, general semantics, scriptwriting, cloning, rotten ectoplasm, and judgment in cut-ups, as well as Burroughs's novel, The Soft Machine. (Continues on 79p044.) Keywords: beat movement, experimental literature, consciousness in literature, reality mapping\n &lt;a href=&quot;\nhttp://www.archive.org/details/naropa_william_s_burroughs_class_on6&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.archive.org/details/naropa_william_s_burroughs_class_on6&lt;/a&gt;\n\nSecond half of a William S. Burroughs lecture on creative reading. The lecture mentions a wide variety of authors, including Alistair Crowley, Paul Bowles, and many others. The class also discusses science fiction, non-fiction, general semantics, scriptwriting, cloning, rotten ectoplasm, and judgment in cut-ups, as well as Burroughs's novel, The Soft Machine. (Continued from 79p043.) Keywords: beat movement, experimental literature, consciousness in literature, reality mapping\n\n\n1979-08-15 - William S. Burroughs Sr. and Jr. with John Giorno\n &lt;a href=&quot;\nhttp://www.archive.org/details/William_S_Burroughs_Sr_and_William_S_Burroughs_Jr_reading_August_1979_79P103&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.archive.org/details/William_S_Burroughs_Sr_and_William_S_Burroughs_Jr_reading_August_1979_79P103&lt;/a&gt;\n\nA William S. Burroughs, Sr. and William S. Burroughs, Jr. reading. The reading displays a contrast between William S. Burroughs Jr.'s writings and the writings of his father, William S. Burroughs, Sr. William S. Burroughs Jr. reads a series of short poems and plays the harmonica, followed by William S. Burroughs Sr. reading from his then unpublished work, The Gay Gun. (Continues on 79P104)\n\nSecond half of a William S. Burroughs, Sr. and William S. Burroughs, Jr. reading, with John Giorno. William S. Burroughs finishes his reading from The Gay Gun. Buddhist poet Giorno reads two energetic long poems &quot;Eating the sky,&quot; and &quot;Put your ear to stone and open your heart to the sky.&quot; The latter presentation is accompanied by a recording of Giorno reading the piece earlier, with the sound effect of a distorted, repeating echo.\n\n\n1980-08-11 - William S. Burroughs lecture on public discourse\n &lt;a href=&quot;\nhttp://www.archive.org/details/naropa_william_s_burroughs_lecture_on&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.archive.org/details/naropa_william_s_burroughs_lecture_on&lt;/a&gt;\n\nA lecture by William S. Burroughs on public discourse, with an introduction by Allen Ginsberg. Topics included are nuclear weapons, disarmament, the Equal Rights Amendment, aliens, dreams, function of the artist, mind-altering drugs, reincarnation, space travel, television, and economics. Keywords: beat generation, literature and the state, technology and literature, literature and society, protest literature\n\n\n1982-07-23 - William S. Burroughs workshop, Jack Kerouac Conference\n &lt;a href=&quot;\nhttp://www.archive.org/details/naropa_william_s_burroughs_workshop&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.archive.org/details/naropa_william_s_burroughs_workshop&lt;/a&gt;\n\nFirst half of a workshop with William S. Burroughs comparing his works to those of Jack Kerouac, discussing their writing techniques. Burroughs provides biographical information on where the two met and their relationship. He also discusses what it means to be a writer and how many people are not writers even though they claim to be and have published work. Burroughs responds to questions about his relationship with Kerouac, dreams, and his own literary influences. This workshop took place during the 1982 Jack Kerouac Conference at the Naropa Institute.(Continues on 82p267B.) Keywords: beat movement, history of beat movement, 20th century literature\n &lt;a href=&quot;\nhttp://www.archive.org/details/On_the_road_Jack_Kerouac_Conference_Burroughs_workshop_July_1982_82P267B&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.archive.org/details/On_the_road_Jack_Kerouac_Conference_Burroughs_workshop_July_1982_82P267B&lt;/a&gt;\n\nSecond half of a workshop with William S. Burroughs comparing his works to those of Jack Kerouac and discussing their writing techniques. Burroughs provides biographical information on meeting Kerouac and their ensuing relationship. He also discusses what it means to be a writer, and how many people are not writers even though they claim to be and have published work. Burroughs responds to questions about his relationship with Kerouac, dreams, and his own literary influences.\n\n\n1984-07-04 - Allen Ginsberg and William Burroughs class\n &lt;a href=&quot;\nhttp://www.archive.org/details/Allen_Ginsberg_and_William_Burroughs_cla_84P024&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.archive.org/details/Allen_Ginsberg_and_William_Burroughs_cla_84P024&lt;/a&gt;\n\nAllen Ginsberg class with William Burroughs. Ginsberg begins by reading from Burroughs's work, including his book Nova Express. Burroughs arrives and discusses writing techniques, including the idea that &quot;Life is a cut up.&quot; He also talks about why he became a writer, Laurie Anderson, rolling drunks, biological warfare, weapons and retreats. The class learns some exercises for observing details while walking down the street.\n\n\n1985-07-28 - William S. Burroughs reading\n &lt;a href=&quot;\nhttp://www.archive.org/details/naropa_william_s_burroughs3&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.archive.org/details/naropa_william_s_burroughs3&lt;/a&gt;\n\nWilliam S. Burroughs reads from &quot;The Place of Dead Roads&quot; and &quot;The Cat Inside.&quot; Keywords: beat movement, experimental writing\n\n\n1986-06-25 - Burroughs, William S.; Ginsberg, Allen; Waldman, Anne - class on the technology and ethic of wishing\n &lt;a href=&quot;\nhttp://www.archive.org/details/naropa_william_s_burroughs_class_on7&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.archive.org/details/naropa_william_s_burroughs_class_on7&lt;/a&gt;\n\nFirst half of a class by William S. Burroughs on the technology and the ethics of wishing. The discussion includes rules for wishing, the dogma of science, L. Ron Hubbard, The Big Lie, and sympathetic magic. The class also includes a question and answer session covering subjects such as memory, Henry Miller, dreams in writing, and defining the soul. (Continues on 86p002.) Keywords: beat movement, magic and poetry, mysticism and literature, science and literature, consciousness and literature\n &lt;a href=&quot;\nhttp://www.archive.org/details/naropa_william_s_burroughs_class_on8&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.archive.org/details/naropa_william_s_burroughs_class_on8&lt;/a&gt;\n\nSecond half of a class by William S. Burroughs on the technology and the ethics of wishing. This half contains additional commentary by Anne Waldman and Allen Ginsberg. Included is a question and answer session that covers the space shuttle Challenger explosion, lucid dreaming, yoga, feminine energy, DNA, the Dalai Lama, and music. Waldman also discusses the ego, rituals, science and why questions, death, birth, mortality, and the bodhisattva. (Continued from 86p001.) Keywords: beat movement, magic and poetry, mysticism and literature, science and literature, consciousness and literature\n\n\n1989-07-22 - William Burroughs reading, Art now- A day of contemporary art\n &lt;a href=&quot;\nhttp://www.archive.org/details/Burroughs_reading_contemporary_art_July_1989_89P103&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.archive.org/details/Burroughs_reading_contemporary_art_July_1989_89P103&lt;/a&gt;\n\nA William S. Burroughs reading compiled from a number of works. Burroughs covers topics from miracles and magic to the Titanic, narcotics, the supernatural and hospitals.","torrent":{"xt":"urn:btih:477ccc476586d161419e1c0f61b67f27483939e8","amp;dn":"William+S.+Burroughs+-+The+Jack+Kerouac+School+of+Disembodied+Po","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"477ccc476586d161419e1c0f61b67f27483939e8","infoHashBuffer":{"type":"Buffer","data":[71,124,204,71,101,134,209,97,65,158,28,15,97,182,127,39,72,57,57,232]},"announce":[],"urlList":[]}}