{"title":"The.Musketeers.S01E07.Xvid-AJAXEN.avi","uid":9733107,"size":473677910,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:48cbf687f0b0f2e99c0bc937afb01cf845c4a355&amp;dn=The.Musketeers.S01E07.Xvid-AJAXEN.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ajaxen94","files":-1,"time":1394409055,"description":"The Musketeers...Season 1...Episode 7...A Rebellious Woman\n\n&quot;The Musketeers&quot; is set on the streets of seventeenth century Paris, where law and order is an idea more than a reality. In addition to being King Louis XIII's personal bodyguards, Athos, Aramis and Porthos stand resolutely for social justice, honor, valor, love - and for the thrill of it. \n\nThe King relies on the advice of the Cardinal, his shrewd wife Queen Anne and also Captain Treville, the brave and respected commander of the Musketeers who keeps an eye on the soldiers to ensure they stay out of trouble. The series bursts with escapism, adventure and romance and is set to thrill audiences with riveting stories every week.\n\nD'Artagnan, a skilled fighter from rural Gascony, meets the three Musketeers while on a mission to right the wrong of his father's death. Although he meets the men in unfortunate circumstances, he finds kindred spirits in the other soldiers. Athos, who has rejected his noble roots to become a Musketeer, quickly befriends D'Artagnan, but has a past which is shrouded in mystery, and is prone to getting in trouble.\n\nPorthos is a larger-than-life character, who has come from humble beginnings to become a soldier in the most elite regiment in the land, finding a family in the other Musketeers. Never short of admirers, Aramis has an effortless charm which leads him in and out of love. Despite this, he is a shrewd pragmatist who is ferocious in battle and commands a key place in the brotherhood.\n\nConstance Bonacieux leads a dull but comfortable life married to a cloth merchant, but her life is turned upside down when D'Artagnan tumbles into her world, and she becomes involved with the Musketeers.\n\nCardinal Richelieu, while striving to achieve his vision of a thoroughly modern France, is a shadowy character who will stop at nothing to achieve his objectives. Milady (Maimie McCoy) is the Cardinal's secret weapon, the most mysterious and beautiful of villains whose motives are often concealed.\n\nLuke Pasqualino...........as D'Artagnan\nSantiago Cabrera.........as Aramis\nTom Burke..................as Athos\nHoward Charles...........as Porthos\nPeter Capaldi..............as Cardinal Richelieu\nTamla Kari..................as Constance Bonacieux\nMaimie McCoy.............as Milady de Winter\nHugo Speer................as Captain Treville\nRyan Gage..................as King Louis XIII\nAlexandra Dowling.......as Queen Anne\n\naspect ratio...624x352\nframe rate...25\nbit rate...1000\naudio mp3 stereo...128.. 48khz\ncodec...Xvid avi\nConverter...Format Factory","torrent":{"xt":"urn:btih:48cbf687f0b0f2e99c0bc937afb01cf845c4a355","amp;dn":"The.Musketeers.S01E07.Xvid-AJAXEN.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48cbf687f0b0f2e99c0bc937afb01cf845c4a355","infoHashBuffer":{"type":"Buffer","data":[72,203,246,135,240,176,242,233,156,11,201,55,175,176,28,248,69,196,163,85]},"announce":[],"urlList":[]}}