{"title":"Juno(2007)DVDRip.AC3(ENG)-DROCK","uid":6504178,"size":730759168,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:49029b75e9d0a9ff83f89d2685d39c804451d74c&amp;dn=Juno%282007%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"drock232","files":-1,"time":1309364991,"description":"When a teenage girl is faced with an unexpected pregnancy, she enlists the aid of her best friend in finding the unborn child a suitable home in this coming-of-age comedy drama from Thank You for Smoking director Jason Reitman. Juno (Ellen Page) may seem wise beyond her years, but after sleeping with classmate Bleeker (Michael Cera), the pregnant teen quickly realizes how little she really knows about life. Thankfully, Juno has been blessed with parents (J.K. Simmons and Allison Janney) who trust their daughter's judgment, and a best friend named Leah (Olivia Thirlby), who's always willing to help out in a pinch. With a little help from Leah, Juno soon comes into contact with Mark (Jason Bateman) and Vanessa (Jennifer Garner) -- an affluent suburban couple who have been unable to conceive a child of their own. Mark and Vanessa seem like they would make great parents, and are eager to adopt Juno's unborn child. Now, as adolescent Juno is faced with a series of very adult decisions, she will draw on the support of her family and friends in order to discover who she truly is, and discover that one bad choice can have a lifetime of consequences.\n\nRipped with Autogk.\n\nLength: 1 Hour 36 Minutes\n\nFile Type: AVI","torrent":{"xt":"urn:btih:49029b75e9d0a9ff83f89d2685d39c804451d74c","amp;dn":"Juno%282007%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"49029b75e9d0a9ff83f89d2685d39c804451d74c","infoHashBuffer":{"type":"Buffer","data":[73,2,155,117,233,208,169,255,131,248,157,38,133,211,156,128,68,81,215,76]},"announce":[],"urlList":[]}}