{"title":"O-Parts Hunter (666 Satan) Complete Manga Series","uid":10500597,"size":907414405,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:491e2a7488ade427f1b9f33b8c8cefb642f48d74&amp;dn=O-Parts+Hunter+%28666+Satan%29+Complete+Manga+Series&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ShadowWolf87","files":-1,"time":1404690581,"description":"(Re-Uploaded With New Artwork)\n\nThe Complete Series of O-Parts Hunter (666 Satan) for your enjoyment... as well as for the sake of posterity.\n\nA lot of sites have been removing this series lately or going down entirely, so I figured I'd put this here as a means of keeping the series alive for those curious. Still recommend a purchase though. :)\n\nTo be up-front, this is mostly a fan translation uploaded and compiled from before the manga was licensed or fully released in North America, so bear with some chapters as they're a tad rough. Also included to HOPEFULLY make up for it are some pretty cool pieces of art and colorized pages.\n\nSYNOPSIS: In the not too distant future, mankind fights over relics from an ancient civilization called O-Parts, each of which contain incredible powers. Some people with special abilities are able to use the O-Parts to their full potential, and are known as O.P.T.s (or O-Parts Tacticians). Naturally, O-Parts can be used for both good and evil purposes.\n\nJio is a young boy with a tragic past who only trusts one thing in the world: money. Little does he suspect that he is actually a very powerful O.P.T.s, and inside him sleeps a demon of incredible ferocity. He meets up with a girl named Ruby who, like her famous father before her, wants to become a treasure hunter. Though Jio doesn't believe in friendship, he agrees to be Ruby's bodyguard, and together they go on a dangerous quest to discover as many O-Parts as they can. \n\nCredit goes mostly to the folks here: http://bakabt.me/140375-666-satan-o-parts-hunter.html for compiling the chapters in image form. I just re-packed them into .cbr format and added the missing Gaiden chapter as well as added some more art/pages I had handy.\n\nHere's hoping you enjoy!","torrent":{"xt":"urn:btih:491e2a7488ade427f1b9f33b8c8cefb642f48d74","amp;dn":"O-Parts+Hunter+%28666+Satan%29+Complete+Manga+Series","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"491e2a7488ade427f1b9f33b8c8cefb642f48d74","infoHashBuffer":{"type":"Buffer","data":[73,30,42,116,136,173,228,39,241,185,243,59,140,140,239,182,66,244,141,116]},"announce":[],"urlList":[]}}