{"title":"Petroleum Radiation Processing","uid":14972919,"size":28510538,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:492a538c83fd0963f232eec49a5dc5f8eaa0cad9&amp;dn=Petroleum+Radiation+Processing&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1466212258,"description":"Petroleum Radiation Processing - Yuriy Zaikin, Raissa Zaikina (CRC, 2014).pdf\r\n\r\nISBN 978-1-4665-9311-4\r\n\r\nRadiation-thermal cracking of oil feedstock has the potential to offer a solution to many of the challenges the oil industry is facing. Radiation-induced chain cracking reactions in hydrocarbons at lowered temperatures initiated the development of improved technological approaches, combining the advantages of radiation-thermal cracking and low-temperature feedstock processing. However, researchers still face obstacles in the practical application of theory and experimental data, and the literature presents contradictions that need to be sorted out for further development of this technology.\r\n\r\nPetroleum Radiation Processing fills an information gap, providing systematic descriptions of the fundamentals of radiation-induced cracking reactions in hydrocarbons. It analyzes the basic experiments that have brought about the rapid development of radiation technology for petroleum radiation processing during the last decades. The book provides a detailed introduction to radiation methods based on radiation-thermal and low-temperature cracking of hydrocarbons, emphasizing high-viscous oil feedstocks that are difficult to process by conventional methods—such as heavy and high-paraffinic crude oil, fuel oil, and bitumen. It helps readers understand the mechanisms and kinetics of low-temperature radiation cracking.\r\n\r\nThe book addresses the application of promising radiation methods for solving critical environmental issues, such as oil desulfurization and regeneration of used lubricants and other used oil products. Examining experimental data as well as theoretical and technical approaches, it summarizes research progress in the field of petroleum radiation processing, providing a useful reference on the theory and technology of hydrocarbon radiation processing for chemical technologists, researchers, and students","torrent":{"xt":"urn:btih:492a538c83fd0963f232eec49a5dc5f8eaa0cad9","amp;dn":"Petroleum+Radiation+Processing","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"492a538c83fd0963f232eec49a5dc5f8eaa0cad9","infoHashBuffer":{"type":"Buffer","data":[73,42,83,140,131,253,9,99,242,50,238,196,154,93,197,248,234,160,202,217]},"announce":[],"urlList":[]}}