{"title":"I-Doser Premium v1.2.6","uid":13224692,"size":45021207,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:49bae57ae271a7fc54cc1dbac034c85c2435c595&amp;dn=I-Doser+Premium+v1.2.6&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Androider","files":1,"time":1452836789,"description":"Used by over 10 million people worldwide, I-Doser products are the only sequences that have over an 80% success rate in peer review studies. Covered by Kotaku, LA Weekly, Vice, OWNI, Wired, CNN, Fox News, NBC, Spike TV, ABC, Bay 9 News and many many more. \r\n\r\nThis is the original and only official source of I-Doser brand simulated experiences. Don't be fooled by the cheap imitations out there! We are the REAL DEAL!\r\n\r\nI-Doser.com is the Industry Leader in Binaural Brainwave Technology. This is the app that is helping millions of people around the world achieve powerful simulated experiences! With close to 100 brainwave doses available in app and for purchase, this is te largest mobile collection anywhere. \r\n\r\nIntegrated ambient soundscapes custom tailored to each and every simulation. Works across all your Android-based mobile and tablet devices, universal, in glorious HD! Slipstream doses and mix and match to find your power combination. Real-time tuning. Fine tune your experience in real-time, on the fly, for the best results possible! \r\n\r\nIntegrated guide and method to guarantee success! Remember, I-Doser can be an extremely powerful on-the-go mobile brainwave modification tool based on proven and effective sequencing. Please use high quality headphones during your simulated experience.\r\n\r\nWhat's New:\r\n\r\nNEW VERSION OF THE BEST-SELLING MOOD SIMULATOR IS HERE!\r\nWe added close to 30 new doses bringing the entire count to nearly 100 available! The app is now 400% smaller because all of your doses can be stored in the cloud! Quickly see what doses you need to complete your collection. Gotta dose 'em all! We have opened the mystery box for free. (Hint, it's Genesis) You can disable them from the Info Screen. Make sure you update!\r\n\r\nMore info:\r\n \nhttps://play.google.com/store/apps/details?id=com.yudiz.idoser","torrent":{"xt":"urn:btih:49bae57ae271a7fc54cc1dbac034c85c2435c595","amp;dn":"I-Doser+Premium+v1.2.6","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"49bae57ae271a7fc54cc1dbac034c85c2435c595","infoHashBuffer":{"type":"Buffer","data":[73,186,229,122,226,113,167,252,84,204,29,186,192,52,200,92,36,53,197,149]},"announce":[],"urlList":[]}}