{"title":"Somerset Holmes","uid":5070842,"size":82381693,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:49bd74e067c1311bbef6e97ed3db95f35f7ae0c3&amp;dn=Somerset+Holmes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"brodahisou","files":-1,"time":1251395896,"description":"An attractive young redhead is run down on a remote country road by a hit and run driver. She wakes up bruised and battered in a muddy ditch, her purse missing, with no memory of who she is or how she got there. She staggers off and comes across the home office of an elderly physician. Before she can be treated, though, he keels over in front of her with a knife in his back, whispering &quot;nickles&quot; with his dying breath. She dresses quickly and flees, soon finding herself in possession of a mysterious key and pursued by a horde of violent individuals, some of who appear to work for the government. She sets out to unravel the mystery of her identity, her past, and why so many people seem to be out to get her.\n\nSuspense filled action in the vein of North by Northwest or The Man Who Knew Too Much written by Bruce Jones (Incredible Hulk) and co-plotter/editor April Campbell and art by Brent Anderson (Astro City).\n\nAll six issues featured the back-up feature, Cliff Hanger, written by Jones and illustrated by Al Williamson. A homage to the old Saturday afternoon movie serials, complete with square-jawed hero Cliff, a beautiful damsel in distress, jungle thrills, diamonds, Nazis, and nail-biting cliffhangers. \n\nThe first four issues of the miniseries were published by Pacific Comics, one of the first independent comics publisher to take advantage of the then-new direct sales market. Their company was short-lived, though, and when they folded, the remaining two issues were published by Eclipse Comics.\n\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:49bd74e067c1311bbef6e97ed3db95f35f7ae0c3","amp;dn":"Somerset+Holmes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"49bd74e067c1311bbef6e97ed3db95f35f7ae0c3","infoHashBuffer":{"type":"Buffer","data":[73,189,116,224,103,193,49,27,190,246,233,126,211,219,149,243,95,122,224,195]},"announce":[],"urlList":[]}}