{"title":"Jonathan Glover - Humanity. A Moral History of the Twentieth Cen","uid":9967862,"size":9073157,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:49f5d8bd832fc359df0e5e381fb175ed0bea7f01&amp;dn=Jonathan+Glover+-+Humanity.+A+Moral+History+of+the+Twentieth+Cen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anette14","files":-1,"time":1397597530,"description":"Description\nProduct Details\nBook Title: Humanity: A Moral History of the Twentieth Century\t\nBook Author: Jonathan Glover\nSeries: Yale Nota Bene\nPaperback: 480 pages\nPublisher: Yale University Press; 1ST edition (September 1, 2001)\nLanguage: English\nISBN-10: 0300087152\nISBN-13: 978-0300087154\n\nBook Description\nPublication Date: September 1, 2001 | ISBN-10: 0300087152 | ISBN-13: 978-0300087154 | Edition: 1ST\nThis important book confronts the brutal history of the twentieth century to unravel the psychological mystery of why so many atrocities occurred--the Holocaust, Hiroshima, the Gulag, Cambodia, Yugoslavia, Rwanda, and others--and how we can prevent their recurrence. Jonathan Glover finds disturbing similarities in the psychology of those involved with atrocities, yet offers hope that the development of a political and personal moral imagination can empower us to resist all acts of cruelty.\n\nEditorial Reviews\nReview\nIn Humanity, English ethicist Jonathan Glover begins with the now commonplace observation that the last 100 years were perhaps the most brutal in all history. But the problem wasn't that human nature suddenly took a sharp turn for the worse: &quot;It is a myth that barbarism is unique to the twentieth century: the whole of human history includes wars, massacres, and every kind of torture and cruelty,&quot; he writes. Technology has made a huge difference, but psychology has remained the same--and this is what Glover seeks to examine, through discussions of Nietzsche, the My Lai atrocity in Vietnam, Hiroshima, tribal genocide in Rwanda, Stalinism, Nazism, and so on.\nThere is much history here, but Humanity is fundamentally a book of philosophy. In his first chapter, for instance, Glover announces his goal &quot;to replace the thin, mechanical psychology of the Enlightenment with something more complex, something closer to reality.&quot; But he also seeks &quot;to defend the Enlightenment hope of a world that is more peaceful and more humane, the hope that by understanding more about ourselves we can do something to create a world with less misery.&quot; The result is an odd combination of darkness and light--darkness because the subject matter of the 20th century's moral failings is so bleak, light because of Glover's earnest optimism, which insists that &quot;keeping the past alive may help to prevent atrocities.&quot; He cites Stalin's bracing comment, made while signing death warrants: &quot;Who's going to remember all this riff-raff in ten or twenty years' time? No one.&quot; At one level, Humanity is a book of remembrance. But it's more than that: it's also an attempt to understand what it is in the human mind that makes moral disaster always loom--and a prayer that this aspect of our psychology might be better controlled. --John J. Miller --This text refers to an out of print or unavailable edition of this title.\n\nFrom Booklist\nAn ethics academic in Britain, Glover discourses on the dismantlement of absolute morality concepts synonymous with Friedrich Nietzsche, and explicitly put into effect by the twentieth century's terrible tyrants. To describe the release Lenin, Stalin, Hitler, and Pol Pot granted themselves from ordinary morality's prohibitions against killing, Glover quotes their ideological justifications of creating a perfect human society. Having opened this book with Nietzsche's pronouncements that man creates his morals, Glover's linking of mass murder with that philosopher is direct, and, if not an original way of comprehending the sufferings inflicted by dictators, it is worthwhile revisiting for those vexed by the apparent meaninglessness of enormous crimes. Indeed, Glover is a direct writer, not given to the opacity that clouds many a discussion of ethics. For instance, he narrates specific atrocities, and describes the psychological &quot;traps&quot; the triggermen find themselves in as their rationales for their actions. The &quot;trap&quot; metaphor extends in Glover's view to events such as World War I, and whatever dispute diplomatic historians will make with that, ethicists will find profit in Glover's not totally bleak survey. Gilbert Taylor\nCopyright Â© American Library Association. All rights reserved --This text refers to an out of print or unavailable edition of this title.\n\nReviews\n&quot;An impressive and accessible analysis of 20th-century brutality.&quot;--Kirkus Reviews\n\n&quot;Humanity is a . . . contribution to the immense labor of understanding some of the worst experiences humankind has ever had.&quot; -- George Scialabba, Boston Globe\n\n&quot;There is much that is excellent in Humanity, especially Glover's lucid summary of the monstrosities of Stalinism--indispensable.&quot; -- Shashi Tharoor, Los Angeles Times\n\n&quot;This is an extraordinary book: brilliant, haunting and uniquely important.&quot; -- Steven Pinker, New York Times Book Review\n\nFrom the Inside Flap\nThis is an extraordinary book, incisive and far-reaching, that both confronts unpleasant historical facts and offers some hopeful suggestions about what concerned human beings can do about them.&quot;-Martha Nussbaum.\nThe twentieth century was the most brutal in human history, featuring a litany of shameful events that includes the Holocaust, Hiroshima, the Stalinist era, Cambodia, Yugoslavia, and Rwanda. This important book looks at the politics of our times and the roots of human nature to discover why so many atrocities were perpetuated and how we can create a social environment to prevent their recurrence.Jonathan Glover finds similarities in the psychology of those who perpetuate, collaborate in, and are complicit with atrocities, uncovering some disturbing common elements-tribal hatred, blind adherence to ideology, diminished personal responsibility-as well as characteristics unique to each situation. Acknowledging that human nature has a dark and destructive side, he proposes that we encourage the development of a political and personal moral imagination that will compel us to refrain from and protest all acts of cruelty. --This text refers to an out of print or unavailable edition of this title.\n\nAbout the Author\nJonathan Glover is director of the Centre of Medical Law and Ethics at King's College, London.\n","torrent":{"xt":"urn:btih:49f5d8bd832fc359df0e5e381fb175ed0bea7f01","amp;dn":"Jonathan+Glover+-+Humanity.+A+Moral+History+of+the+Twentieth+Cen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"49f5d8bd832fc359df0e5e381fb175ed0bea7f01","infoHashBuffer":{"type":"Buffer","data":[73,245,216,189,131,47,195,89,223,14,94,56,31,177,117,237,11,234,127,1]},"announce":[],"urlList":[]}}