{"title":"Mike Anderson - 8 Minutes (2008)  Mini Documentary on Animal Abu","uid":6407416,"size":244084782,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4a0f7f01e3f91a5475170661707dc3f9ebff7474&amp;dn=Mike+Anderson+-+8+Minutes+%282008%29++Mini+Documentary+on+Animal+Abu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":2,"time":1305856987,"description":"Mike Anderson - 8 Minutes (2008)  Mini Documentary on Animal Abuses and Animal Compassion\n\nThis is a short, sixteen minutes total, documentary which shows animal treatment within the food processing industries. The first section of the DVD rip explains how animals exhibit qualities of intelligence and have emotional ability in addition to social abilities that rival humans in certain contexts. The filmmakers asserts that to treat living beings who posses such qualities in a brutal fashion is ethically wrong. \n\nThe stance of the film is on ending animal abuses and against humans eating animals as food. While not explained in detail- the other films from Mike Anderson go into the matter in depth- the filmmaker asserts that animal meat within ones diet is a major cause of health issue and disease for humans. \n\nThe audio is a bit scratchy, yet audible and can be understood. The DVD itself has the same issue; it is not due to the size nor quality of the AVI file. This program has many graphic scenes of animal slaughter, please be forewarned. \n\nOne note: There is a scene that shows a bunch of alive and fluffy, yellow chicks being tossed into a giant metal funnel and sliding toward its open center. What is not explained (I am not sure why the omission) is that the funnel is a giant grinder. The otherwise tame scene is given context, once you have that knowledge. The reason is that the baby chicks are male and can't lay eggs and it is too costly to feed them since they grow too slowly. They get ground up and used a livestock feed.\n\nURL of Film: &lt;a href=&quot;\nhttp://www.ravediet.com/8minutes.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.ravediet.com/8minutes.html&lt;/a&gt;\n\nOfficial Right Up:\n++++++++++++\n8 Minutes is a short, but extremely powerful production which everyone needs to see. The total length of the film is just 16 minutes. The first eight minutes describe how surprisingly intelligent, warm and caring animals are. The second eight minutes shows how some of these same animals end up on our plates - when the film visits a slaughterhouse.\n \nThe film is an attempt to bridge the big disconnect between what's on the dinner plate and how it got there. Although 8 Minutes is graphic and violent, everyone should watch it, particularly those with a meat-eating habit. We would also recommend it be shown to children, with parent supervision. Although we would suggest it be shown to children 10 or older, the parent is the best judge to determine at what age this should be seen.\n \nHere are a few comments we have received from viewers:\n\n\nProfound...Poignant...A challenge to watch.\nA beautiful presentation of a difficult subject matter.\nThe juxtaposition of video is brilliant - and damning.\nA bright spotlight on the dark side of our eating habits.\nEveryone in the world needs to spend just a few minutes of their lives to see this.\nThe haunting images will never leave me.\n\n \n\nWe believe 8 Minutes will be the most powerful and moving eight minutes of film you will ever see. And you will be a better person because of it.\n++++++++++++\n\nA message from this uploader: If you care for animals, pleas be sure to also care about the many issues and abuse instances of humanity too. Some want to favor animal rights strongly, yet neglect their fellow man. \n\nThat seems obvious to some, yet we must know that people count as much as animals. If you support human rights then too please know that to support positive conduct towards all living and feeling creatures is a correct extension of position. \n\nHumanity is ultimately good. Must of the vile deeds we do as people are out of misinformation and ignorance. To be rightly informed is the major step toward improving our conduct.\n\nI am not promoting the view of this documentary as wrong nor as correct. View it yourself and choose, based on this and other input for or against, what position you will hold. \n\nFull Screen Format, English, No Subtitles\n\nFilmmaker's Website: &lt;a href=&quot;\nhttp://www.ravediet.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.ravediet.com/&lt;/a&gt;\n","torrent":{"xt":"urn:btih:4a0f7f01e3f91a5475170661707dc3f9ebff7474","amp;dn":"Mike+Anderson+-+8+Minutes+%282008%29++Mini+Documentary+on+Animal+Abu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a0f7f01e3f91a5475170661707dc3f9ebff7474","infoHashBuffer":{"type":"Buffer","data":[74,15,127,1,227,249,26,84,117,23,6,97,112,125,195,249,235,255,116,116]},"announce":[],"urlList":[]}}