{"title":"Green Day - Dookie [24 bit FLAC] vinyl","uid":8110586,"size":865175879,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:4a4212ab544129ba39acf044b7b8c5b091c9b6b8&amp;dn=Green+Day+-+Dookie+%5B24+bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"24.96","files":-1,"time":1360177938,"description":"Green Day couldn't have had a blockbuster without Nirvana, but Dookie wound up being nearly as revolutionary as Nevermind, sending a wave of imitators up the charts and setting the tone for the mainstream rock of the mid-'90s. Like Nevermind, this was accidental success, the sound of a promising underground group suddenly hitting its stride just as they got their first professional, big-budget, big-label production. Really, that's where the similarities end, since if Nirvana were indebted to the weirdness of indie rock, Green Day were straight-ahead punk revivalists through and through. They were products of the underground pop scene kept alive by such protagonists as All, yet what they really loved was the original punk, particularly such British punkers as the Jam and Buzzcocks. On their first couple records, they showed promise, but with Dookie, they delivered a record that found Billie Joe Armstrong bursting into full flower as a songwriter, spitting out melodic ravers that could have comfortable sat alongside Singles Going Steady, but infused with an ironic self-loathing popularized by Nirvana, whose clean sound on Nevermind is also emulated here. Where Nirvana had weight, Green Day are deliberately adolescent here, treating nearly everything as joke and having as much fun as snotty punkers should. They demonstrate a bit of depth with &quot;When I Come Around,&quot; but that just varies the pace slightly, since the key to this is their flippant, infectious attitude - something they maintain throughout the record, making Dookie a stellar piece of modern punk that many tried to emulate but nobody bettered.","torrent":{"xt":"urn:btih:4a4212ab544129ba39acf044b7b8c5b091c9b6b8","amp;dn":"Green+Day+-+Dookie+%5B24+bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4a4212ab544129ba39acf044b7b8c5b091c9b6b8","infoHashBuffer":{"type":"Buffer","data":[74,66,18,171,84,65,41,186,57,172,240,68,183,184,197,176,145,201,182,184]},"announce":[],"urlList":[]}}