{"title":"Warcraft.Orcs.And.Humans-RAZOR1911","uid":4847098,"size":5548315,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:4b3e5ff86a1789341006bba916df55ee8e859d55&amp;dn=Warcraft.Orcs.And.Humans-RAZOR1911&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"summonedtitan","files":-1,"time":1239727748,"description":"Warcraft: Orcs &amp; Humans is the real-time fantasy strategy game from Blizzard Entertainment that quickly became a best seller. Warcraft has not only become a classic, winning many awards, but it has set new standards for multiplayer games. Set in the mythic kingdom of Azeroth, players are given the task of maintaining a thriving economy while building a war machine with which to destroy the enemy.\n\nBy playing either the Humans or the Orcs in this saga, two separate story lines evolve with 12 scenarios per side telling the tale of the battle for Azeroth. From swords to sorcery, all the elements of classic fantasy are here to explore: rich forests, dark dungeons and bubbling swamps await the stalwart troops amassed to fight for dominance. Command many unique armies and creatures including Knights, Archers, Clerics, Warlocks, Daemons, Elementals, and the Dead.\n\nThe multiplayer aspects of the game bring Warcraft to a new level of excitement.Challenge another player on over 20 custom maps and determine who among you is the supreme warlord. Head to head play is supported over modem, serial link, and IPX networks, and works cross-platform with both the IBM-PC and Macintosh versions.","torrent":{"xt":"urn:btih:4b3e5ff86a1789341006bba916df55ee8e859d55","amp;dn":"Warcraft.Orcs.And.Humans-RAZOR1911","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b3e5ff86a1789341006bba916df55ee8e859d55","infoHashBuffer":{"type":"Buffer","data":[75,62,95,248,106,23,137,52,16,6,187,169,22,223,85,238,142,133,157,85]},"announce":[],"urlList":[]}}