{"title":"Mediating Modernism - Architectural Cultures in Britain (Art Ebo","uid":9982454,"size":9694673,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4be7a33a4f0c6f675a53bad4e1d6f614a284c067&amp;dn=Mediating+Modernism+-+Architectural+Cultures+in+Britain+%28Art+Ebo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STBGD","files":-1,"time":1397754263,"description":"2006 | ISBN: 041540178X | 216 pages | PDF | 9,1 MB\n\nMediating Modernism has developed from research in to British architectural culture and modernism. It focuses on the crucial role played by the architectural media in creating architectural discourse, and its consequent effects. British architecture of the 20th century has by and large not been subjected to have radically re-thought the construct of modernism, but not in relation to Britain. That there is an interest in Britain is evident, however, with several new books published dealing with the Smithsons, Lubetkin, Price, Archigram and Brutalism.\nAndrew Higgot discusses not the building of architecture itself, but the publications, language and images which in the acto of &quot;describing,&quot; &quot;interpreting&quot; or &quot;illustrating&quot; it, in fact create the architecuter by articulating it and framing it. His book is therefore not primarily about buildings but about narratives -the transmission of ideas that bave created shifts in architectural discourse, ideas embodied in a series of influentialbooks and ideas which have been expressed in significant architectural journals. Architectural books and journals have created the architectural culture of the 20th century and nowhere is this more true than in Britain.","torrent":{"xt":"urn:btih:4be7a33a4f0c6f675a53bad4e1d6f614a284c067","amp;dn":"Mediating+Modernism+-+Architectural+Cultures+in+Britain+%28Art+Ebo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4be7a33a4f0c6f675a53bad4e1d6f614a284c067","infoHashBuffer":{"type":"Buffer","data":[75,231,163,58,79,12,111,103,90,83,186,212,225,214,246,20,162,132,192,103]},"announce":[],"urlList":[]}}