{"title":"J. Geils, Duke Robillard, Gerry Beau","uid":7905785,"size":128121490,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4d0e9004ad44cf6168655a8a9b0a990263474b00&amp;dn=J.+Geils%2C+Duke+Robillard%2C+Gerry+Beau&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jazznbluz","files":-1,"time":1355091433,"description":"This unassuming and delightful little album visits a time when jazz and blues were still directly entwined, drawing on the ghosts of guitarists like Charlie Christian, Eddie Durham, Bill Jennings, Tiny Grimes, Barney Kessel, and Kenny Burrell, guitarists who used the blues to enrich the jazz pieces they played on, a kind of ensemble contribution that is all too frequently missing on the contemporary blues scene. Duke Robillard, Jay Geils, and Gerry Beaudoin are all gifted guitar players, each with his own career, but as a trio working three-part harmony lines around each other, they bring a stately ensemble grace to the tracks on New Guitar Summit (the trio also appears under that name when they do live shows). This is not a speaker-shattering blues-rock outing, and although everything here is informed by the blues, it is front and center a jazz album. Wonderful old chestnuts like &quot;Perdido,&quot; the melody line of which was written by Juan Tizol, Duke Ellington's longtime valve trombonist, are given respectful, lightly swinging arrangements, and the three independent guitar lines work in easy harmonies with each other. When the solos come, they feel like perfect little waves breaking against a beach, wave after wave, one after another. Working with a rhythm section of John Turner on bass and Gordon Grottenthaler on drums, the three guitarists bring an interesting new perspective to Billie Holiday's &quot;'Tain't Nobody's Bizness if I Do,&quot; which includes a tentative yet poignant vocal by Beaudoin, who also wrote two of the best pieces here, the gypsy blues &quot;Azzure Mineur&quot; and the album's defining track, the perfectly swinging &quot;Just Among Friends.&quot; Robillard takes a vocal turn on saxophonist Eddie &quot;Cleanhead&quot; Vinson's &quot;Backdoor Blues,&quot; but this is primarily an instrumental CD, with wonderfully nuanced guitar lines taking center stage. Charming, calm, and frequently beautiful, New Guitar Summit won't stir the beer-and-a-shot crowd, but it is a welcome exploration of a place and a time when jazz and blues were not yet estranged.","torrent":{"xt":"urn:btih:4d0e9004ad44cf6168655a8a9b0a990263474b00","amp;dn":"J.+Geils%2C+Duke+Robillard%2C+Gerry+Beau","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d0e9004ad44cf6168655a8a9b0a990263474b00","infoHashBuffer":{"type":"Buffer","data":[77,14,144,4,173,68,207,97,104,101,90,138,155,10,153,2,99,71,75,0]},"announce":[],"urlList":[]}}