{"title":"Supreme Booty (Evil Angel) XXX DVDRip NEW (2013)","uid":9388536,"size":2326002560,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:4d852e9e4301168c8b70bcf4f3ff005a2784c0fa&amp;dn=Supreme+Booty+%28Evil+Angel%29+XXX+DVDRip+NEW+%282013%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xuluhulu","files":1,"time":1387842335,"description":"When casting girls for his intense POV + gonzo scenes, insatiable director Mike Adriano puts one requirement at the top of his list: A big, beautiful ass. Mike's &quot;Supreme Booty&quot; stars four incredible specimens of gluteal superiority in nonstop tease, fucking and raunchy backdoor action. Everything Mike's discerning fans could want from an Adriano movie is here - sloppy blow jobs; nasty rimming; face sitting; ass-to-mouth cocksucking; sphincter stretching with Mike's signature speculum; and delicious assfuckery of the thickest, most squeezable buns in the business ! First is gorgeous blonde bimbette Britney Amber. She doesn't have a lot of anal experience, but she treats the director's thick prick to some slobbery, gagging deep-throat attention, and soon he's ramming his fat pole up Britney's mighty ass. Next, stunning Cuban bombshell Luna Star squats over Mike's face, grinding her perfect rump on his probing tongue. He pumps his pole inside Luna's silky cunt and spurts a messy load into her mouth. Adorable, 18-year-old Latina Audrey Aguilera gives mike her video anal cherry! The jelly-assed, baby-faced youngster shows off her plump, all-natural boobs; she lets Mike tongue-fuck her tender anus and plunder her inexperienced rectum. Finally, stunning high school student Jillian Brookes is fresh in the adult biz. Mike slathers her sturdy rump with lube and shoves his raging boner into her teen pussy, which oozes creamy juice as she's fucked. In the hierarchy of derrieres, thick curves and hungry holes are the criteria, and Mike Adriano's &quot;Supreme Booty&quot; is the hottest sport in the land.\n\nCOVERS:\n &lt;a href=&quot;\nhttp://www.imgnip.com/viewer.php?file=85383560052600639863.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imgnip.com/viewer.php?file=85383560052600639863.jpg&lt;/a&gt;\n\n\nTHUMBSNAIL SCREENS:\n &lt;a href=&quot;\nhttp://www.imgnip.com/viewer.php?file=07225464687106907543.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imgnip.com/viewer.php?file=07225464687106907543.jpg&lt;/a&gt;\n\n\nCAST:\n\nAudrey Aguilera, Britney Amber, Jillian Brookes, Luna Sta\n\n\nSEED &amp; ENJOY!!!","torrent":{"xt":"urn:btih:4d852e9e4301168c8b70bcf4f3ff005a2784c0fa","amp;dn":"Supreme+Booty+%28Evil+Angel%29+XXX+DVDRip+NEW+%282013%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d852e9e4301168c8b70bcf4f3ff005a2784c0fa","infoHashBuffer":{"type":"Buffer","data":[77,133,46,158,67,1,22,140,139,112,188,244,243,255,0,90,39,132,192,250]},"announce":[],"urlList":[]}}