{"title":"Dietrich Bonhoeffer - 2 books (pdf)","uid":9299699,"size":6271755,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4e18bffd1b77cd67be03397567ec000e7043bd75&amp;dn=Dietrich+Bonhoeffer+-+2+books+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pharmakate","files":-1,"time":1386221677,"description":"Two new scans -- these books haven't appeared in any of the prior Bonhoeffer uploads on tpb.\n\nSearchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\nDietrich Bonhoeffer:\n\n--Life Together (Harper &amp; Row, 1954). 122 pages.\n\ndescription:\n\nAfter his martyrdom at the hands of the Gestapo in 1945, Dietrich Bonhoeffer continued his witness in the hearts of Christians around the world. His Letters and Papers from Prison became a prized testimony to Christian faith and courage, read by thousands. Now in Life Together we have Pastor Bonhoeffer's experience of Christian community. This story of a unique fellowship in an underground seminary during the Nazi years reads like one of Paul's letters. It gives practical advice on how life together in Christ can be sustained in families and groups. The role of personal prayer, worship in common, everyday work, and Christian service is treated in simple, almost biblical, words. Life Together is bread for all who are hungry for the real life of Christian fellowship.\n\n\n--Creation and Fall / Temptation: Two Biblical Studies (Macmillan, 1959). 128 pages.\n\nIn this enlightening study, renowned twentieth-century theologian Dietrich Bonhoeffer offers a careful textual analysis of the story of creation, approaching the biblical tale with the eye of a philosopher and the soul of a true Christian.\n\n&quot;Creation and Fall&quot; is Bonhoeffer's lucid, brilliant analysis of the first three chapters of Genesis. Here he discusses the seeming scientific naivete behind the creation story, God's love and goodness, and humanity's creation, its free will, and its blessedness. Bonhoeffer also tackles difficult questions that are raised in the first book of the of the Bible, questions about the seemingly redundant second story of creation, about God's own beginning, about the source of the light that was created on the first day. The author then expounds on Adam and Eve's fall from grace: How could they, creatures made in God's image, have thought to oppose God so foully? Where did the first evil come from? How did humanity lose its right to live in paradise?\n\nIn &quot;Temptation,&quot; Bonhoeffer questions how temptation appeared in the midst of Eden's innocence, and he explores the very nature of evil. Bonhoeffer explains that Jesus Christ helps us to understand and conquer physical and spiritual temptation through His grace and goodness.\n\n---\n\nMore Bonhoeffer here:\n &lt;a href=&quot;\nhttps://thepiratebay.se/torrent/8860400&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.se/torrent/8860400&lt;/a&gt;\n &lt;a href=&quot;\nhttps://thepiratebay.se/torrent/8498208&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.se/torrent/8498208&lt;/a&gt;\n &lt;a href=&quot;\nhttps://thepiratebay.se/torrent/7881582&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.se/torrent/7881582&lt;/a&gt;","torrent":{"xt":"urn:btih:4e18bffd1b77cd67be03397567ec000e7043bd75","amp;dn":"Dietrich+Bonhoeffer+-+2+books+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e18bffd1b77cd67be03397567ec000e7043bd75","infoHashBuffer":{"type":"Buffer","data":[78,24,191,253,27,119,205,103,190,3,57,117,103,236,0,14,112,67,189,117]},"announce":[],"urlList":[]}}