{"title":"Blow(2001)DVDRip.AC3(ENG)-DROCK","uid":6148083,"size":735136277,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4e7f0c01604f9ac5a27cfa882f23172b340fa34f&amp;dn=Blow%282001%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"drock232","files":-1,"time":1296767321,"description":"Following the life of cocaine-trafficking pioneer George Jung in a way that recalls Martin Scorsese's Casino, Blow recounts the man's days from his 1950s childhood in Boston to his downfall in the 1980s. George (played by Johnny Depp) begins his life as the son of Fred (Ray Liotta), an earnest breadwinner, and Ermine (Rachel Griffiths), who frequently walks out on them in pursuit of a more fulfilling life. When George moves west to California in the late '60s, accompanied by best pal Tuna (Ethan Suplee), he becomes an entrepreneur in the marijuana business, which soon spreads to the East Coast as well, with girlfriend Barbara (Franka Potente) smuggling the product during her stewardess shifts. George is arrested in 1972 -- at which time Barbara dies of cancer -- but George finds a new ally in Diego (Jordi Molla), who proposes the idea that he become the American conduit for Colombian kingpin Pablo Escobar (Cliff Curtis). George flourishes in the heyday of the disco era, and falls for Mirtha (Penelope Cruz), a self-serving bombshell who eventually has a daughter with him. Trouble escalates as the FBI threatens to bring George and his crew down, while he desperately tries to be a stable parent to his young offspring. Blow also features Paul Reubens and Max Perlich in featured roles. \n\nRipped with Handbrake.","torrent":{"xt":"urn:btih:4e7f0c01604f9ac5a27cfa882f23172b340fa34f","amp;dn":"Blow%282001%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e7f0c01604f9ac5a27cfa882f23172b340fa34f","infoHashBuffer":{"type":"Buffer","data":[78,127,12,1,96,79,154,197,162,124,250,136,47,35,23,43,52,15,163,79]},"announce":[],"urlList":[]}}