{"title":"Wolves of Beyond","uid":10608373,"size":5522511,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4f4db9a9553cab0b58f97926953f11b445a0c971&amp;dn=Wolves+of+Beyond&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"wolven9","files":13,"time":1406008062,"description":"A wolf mother has given birth, but the warm bundle snuffling next to her brings only anguish. The pup, otherwise healthy, has a twisted leg, and the mother knows what the harsh code of the pack demands. Her pup will be taken from her and abandoned on a desolate hill. The pack cannot have weakness - the wolf mother knows that her pup is condemned to die.\nBut alone in the wilderness, the pup, Faolan, does not perish. This his story - a story of survival, of courage, and of love triumphant. This is Faolan's story, the wolf pup who rose up to change forevever the Wolves of the Beyond.\n\nShadow Wolf: The wolf pup Faolan was born with a twisted paw, a slight defect that caused his wolf clan to abandon him in the forest to die. But Faolan, with the help of the grizzly bear who raised him as her own, survived.\n\nNow he's made it back to his clan and as a gnaw wolf, the lowest ranking pack member. And the hardships are just beginning. Another gnaw wolf, Heep, is jealous of Faolan and sets him up for failure. As if these humiliations are not enough, Faolon is framed for the murder of a wolf pup. \n\nWatch Wolf: A wolf's eye view of the legends of Ga'Hoole in this stirring third installment of the Wolves of Beyond series by bestselling author Kathryn Lasky.\n\nBorn with a twisted paw, Faolan was abandoned as a wolf pup and left to die. But not only did he survive and make it back to the wolf clan, he proved himself to be one of the most worthy wolves of all.\n\nBut just as Faolan is about to take his place as one of the revered Wolves of the Watch, a fellow watch wolf goes missing. Faolan is sent to track her down and makes a horrifying discovery - she has been kidnapped by bears. A war is coming between the wolves and the bears, and only Faolan can stop it.","torrent":{"xt":"urn:btih:4f4db9a9553cab0b58f97926953f11b445a0c971","amp;dn":"Wolves+of+Beyond","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f4db9a9553cab0b58f97926953f11b445a0c971","infoHashBuffer":{"type":"Buffer","data":[79,77,185,169,85,60,171,11,88,249,121,38,149,63,17,180,69,160,201,113]},"announce":[],"urlList":[]}}