{"title":"[Clips4sale] Cory's Super Heroine Adventures - Molly Jane","uid":13487350,"size":758488597,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:4feddf8f9f78627be39e522dc1b432f23126fff9&amp;dn=%5BClips4sale%5D+Cory%27s+Super+Heroine+Adventures+-+Molly+Jane+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"enterdrone","files":1,"time":1455092385,"description":"screen\r\n \nhttp://desihawas.com/img-56bae450cfa8e.html\r\n\r\n\r\n723Mib - 20:17 -.mp4 - 1280x720\r\n\r\nAdded: 10/8/14\r\n\r\nScene One: Caught Stealing\r\n\r\nCory unknowingly has hired a young Wunder Woman to babysit her . Her husband is upstairs taking a shower when Wunder Woman stalks through the house looking for money to steal. She needs money to buy a serum and become Wunder Woman for the first time. The husband catches her stealing. I'll do anything, just don't tell anybody. Wunder Woman pleads Anything? the husband says letting his towel drop to the floor.\r\n\r\nHe makes the proud Wunder Woman lick his balls like her job depends on it and when he's good and stiff he makes her suck him. Putting his hand on the back of her head he drives her down onto his cock. He makes her strip to her spangled underwear and suck his cock again.\r\n\r\nHe brings her to the bed, as he grabs her feet she lets out a laugh. Your feet are ticklish he says fingers running over her toes. Wunder Woman can't help herself and rolls around the bed laughing. With Wunder Woman on her back he takes her feet and makes her give him a foot job. Her underwear snaps off as the husband licks her pussy and 69's the perfect body of Wunder Woman.\r\n\r\nScene Two: Anything to keep my job\r\n\r\nWunder Woman sucks his cock until it's rock hard and dripping wet. Her body quivering with excitement as she gets on top of the husband and slides his cock inside her. She rides him letting herself go, tits bouncing.\r\n\r\nHe fucks her on the bed, tickling her feet and making her moan and laugh. As he fucks her from behind Wunder Woman gets a call from her boss Cory. She asks what's all the noise about. Wunder Woman replies I'm doing a yoga video with loud slaps against her ass in the background. She hangs up the phone and the husband says You said you'll do anything\r\n\r\nThat's my butt! Wunder Woman yells the hard cock pushing inside her.\r\n\r\nScene Three: Anything for this job?\r\n\r\nHe pushes his thick cock inside her tight ass, making Wunder Woman wince with pain. You want this job? Willing to take a cock in your ass? he asks, making her yell YES, YES He fucks her ass hard all over the bed, making her cum relentlessly.\r\n\r\nHe forces her to beg him for his cum on her face as he fucks her ass. Please cum on my face She says with a grimace over and over. Her body destroyed with orgasms the husband jerks his huge load on the young Wunder Woman's face covering her in cum. Anything so people don't know her superheroine shame.\r\n\r\n***Contains Anal, ATM, cum swallow***","torrent":{"xt":"urn:btih:4feddf8f9f78627be39e522dc1b432f23126fff9","amp;dn":"%5BClips4sale%5D+Cory%27s+Super+Heroine+Adventures+-+Molly+Jane+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4feddf8f9f78627be39e522dc1b432f23126fff9","infoHashBuffer":{"type":"Buffer","data":[79,237,223,143,159,120,98,123,227,158,82,45,193,180,50,242,49,38,255,249]},"announce":[],"urlList":[]}}