{"title":"Munro Leaf and Robert Lawson - The Story of Ferdinand (pdf)","uid":8664823,"size":1800335,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4ff2f7244bbfc58cd2d4271b2b429687cb04594f&amp;dn=Munro+Leaf+and+Robert+Lawson+-+The+Story+of+Ferdinand+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pharmakate","files":-1,"time":1373391313,"description":"Munro Leaf and Robert Lawson - The Story of Ferdinand. 34 pages.\n\nGood quality handmade pdf.\n\nTrilingual version: the text is in English, Urdu and Arabic.\n\n\ndescription:\n\nTranslated into more than sixty languages, this classic tale of a peaceable bull has been a favorite of readers across the world for generations. \n\nReview\n\nWhat else can be said about the fabulous Ferdinand? Published more than 50 years ago (and one of the bestselling children's books of all time), this simple story of peace and contentment has withstood the test of many generations. Ferdinand is a little bull who much prefers sitting quietly under a cork tree-- just smelling the flowers--to jumping around, snorting, and butting heads with other bulls. This cow is no coward--he simply has his pacifist priorities clear. As Ferdinand grows big and strong, his temperament remains mellow, until the day he meets with the wrong end of a bee. In a show of bovine irony, the one day Ferdinand is most definitely not sitting quietly under the cork tree (due to a frightful sting), is the selfsame day that five men come to choose the &quot;biggest, fastest, roughest bull&quot; for the bullfights in Madrid.\n\nFerdinand's day in the arena gives readers not only an education in the historical tradition of bullfighting, but also a lesson in nonviolent tranquility. Robert Lawson's black-and-white drawings are evocative and detailed, with especially sweet renditions of Ferdinand, the serene bull hero. The Story of Ferdinand closes with one of the happiest endings in the history of happy endings--readers of all ages will drift off to a peaceful sleep, dreaming of sweet-smelling flowers and contented cows.\n\nAbout the Author\n\nMunro Leaf wrote a number of books for children, including The Story of Ferdinand and Wee Gillis, both illustrated by Robert Lawson. Because of his work's international appeal, Mr. Leaf and his wife were invited on three twenty-six-country tours under the auspices of the U.S. State Department, giving talks to children and to local educators and librarians. Mr. Leaf died in 1976.\n\nRobert Lawson is the only person ever to receive both the Newbery and Caldecott Awards, for They Were Strong and Good and Rabbit Hill, respectively. Mr. Lawson died in 1957.","torrent":{"xt":"urn:btih:4ff2f7244bbfc58cd2d4271b2b429687cb04594f","amp;dn":"Munro+Leaf+and+Robert+Lawson+-+The+Story+of+Ferdinand+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ff2f7244bbfc58cd2d4271b2b429687cb04594f","infoHashBuffer":{"type":"Buffer","data":[79,242,247,36,75,191,197,140,210,212,39,27,43,66,150,135,203,4,89,79]},"announce":[],"urlList":[]}}