{"title":"Dragon's Crown PS3 JPN","uid":8761586,"size":1916016092,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:50629fc01f840e256a959b78e636a66a351a0181&amp;dn=Dragon%27s+Crown+PS3+JPN&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"AN0NYMOUS142857","files":12,"time":1375252728,"description":"Dragon's Crown\n\nRelease date 23/7/2013\n\nBrandish your blade, dust off your grimoire, and rally your online adventuring party.\nDragon s Crown thrusts you into a fantastical medieval world packed with labyrinthine dungeons to explore, vile monstrosities to smite, and nearly endless online adventure. Your mission is to dive into the dank underworld, uncovering treasure and strengthening your mettle as you unlock the secret behind the ancient dragon threatening the world.\n\nSafe on the surface of the earth, humans believe that they dwell alone. Dragons, monsters and magic are simply fantasies to mankind   but what undiscovered secrets may lie right below our feet? Deep underground, a sprawling labyrinth holds treasure   and danger   beyond your wildest belief. Now, the portals to the subterranean world of magic have opened to you, inviting you on a perilous and glorious mission to uncover the dark secrets guarded by a deadly dragon. Descend into the labyrinth and arm yourself for massive-scale battles and magical encounters in the Dragon's dungeons.\n\nThe mysterious Dragon's Crown holds infinite power that's coveted by many. As a fierce warrior, you must journey through the winding pathways of the underground world to ensure that this power doesn't fall into the wrong hands. Embark on quests that take you across varying dungeon worlds, where you'll battle tremendous dragons and other powerful bosses in exhilarating combat. Hunt for hidden treasure, items and weapons that will propel you on your quest. Decide to team up with a legion of friends or take the road alone   whatever you choose, prepare for nonstop action and intense, role-playing immersion on your hunt for the Dragon's Crown.\n\nKey Features:\n\nDescend into a labyrinth underground world on a quest to unlock the secrets behind a mighty dragon that threatens the land\nHunt for hidden treasure, items and weapons that will maximize your power and aid you on your mission\nEmbark on a variety of different, daring quests throughout endless dungeon worlds in addicting, long-lasting gameplay\nBattle deadly dragons and other fearsome foes in massive boss battles\nCustomize and raise your character to experience the world in exciting new ways\nJoin forces with your friends and conquer monsters together\nFor 1 to 4 players\nProduct Description\nFrom George Kamitani and Vanillaware, the mind and design team behind Odin Sphere and Muramasa: The Demon Blade, Dragon's Crown is a multiplayer action RPG with breathtaking visual style, a design built around cooperative play and epic boss fights, and the ability to discover a new adventure in every play session. With Dragon's Crown, developer Vanillaware deftly marries stunning hand-drawn and animated art work with deep, action-packed hardcore gameplay.","torrent":{"xt":"urn:btih:50629fc01f840e256a959b78e636a66a351a0181","amp;dn":"Dragon%27s+Crown+PS3+JPN","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"50629fc01f840e256a959b78e636a66a351a0181","infoHashBuffer":{"type":"Buffer","data":[80,98,159,192,31,132,14,37,106,149,155,120,230,54,166,106,53,26,1,129]},"announce":[],"urlList":[]}}