{"title":"30 Years Of National Geographic Specials-(WTC-SWE)","uid":4586740,"size":1568331476,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5070e1f86ee265c5e64b43c4c2df7e7ee7006a57&amp;dn=30+Years+Of+National+Geographic+Specials-%28WTC-SWE%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"WTC-SWE","files":-1,"time":1229653446,"description":"NATIONAL \nGEOGRAPHIC:\n-----------\n\n\n                      30 YEARS OF NATIONAL GEOGRAPHIC SPECIALS\n                     ------------------------------------------\n\nEmbark on a spectacular journey through three decades of discovery and adventure in these highlights from the best of the National Geographic Specials!Climb into the danger zone with the first Americans to conquer Everest.\n\nPlunge into alien depths with legendary underwater explorer Jacques-Yves Cousteau.And head into the field with National Geographic's award-winning filmmakers to rough it alongside renowned researchers like Dian Fossey, Jane Goodall and others in this dazzling, one-of-kind chronicle of our world and all that's in it!\n\nMystery, danger, splendor, adventure. Since 1964, National Geographic has been broadcasting television specials that created and, many would argue, still maintain the standard for all nature programming since. Vigilantly focusing on what came before human beings, this special is a grand slam of 30 years (1964-1994) of painstaking exploration and documentation. Its narrative sounds almost biblical: &quot;In the beginning...&quot; there was molten lava. The footage is, as you would expect, dazzling but it is the agile editing and well-crafted storytelling here that makes this video into a poignant success.\n\nMoving from the creation of earth to its inhabitants, the narrative segues to the single law of survival. In the Living Sands of Namib (1978), a spider escapes a predator by cartwheeling down a dune. There are clips of Costa Rican lizards sprinting on water, a woodpecker outsmarting a corn snake, and an Indian tiger begrudgingly retrieving his deer-carcass supper from a thieving crocodile. Procreation is, undoubtedly, the more lighthearted side of survival. Three black beetles are in pursuit of a female running in the sand with a musical score so perfectly selected, it is as if the they are engaged in a well-choreographed dance. The synchronized swimming of mating squids in Jewels of the Caribbean (1994) is more graceful than Twyla Thwarp.\n\nAfter an introduction to the habitat and behavior of so many creatures, the video turns the spotlight on the tool user, fire tamer, language maker: humankind. Americans on Everest (1964), Dr. Leakey and the Dawn of Man (1966), The World of Jacques Yves Cousteau (1966), In the Shadow of Vesuvius (1987), Australia's Twilight of the Dreamtime (1988), and Jane Goodall: My Life with the Chimpanzees (1990) are classic examples of National Geographic at its best. There are also fascinating clips from early Geographic projects, including the 1917 Katmai expedition.\n\nWell beyond serving as a self-congratulatory slap on the back for work well done, this special has an important message: the animals and natural phenoms we fear the most are those we know the least about. Contrary to popular belief, humans are the largest single threat to all life on earth. By bringing fragile ecosystems into our living rooms, National Geographic hopes to instill conservation ethics in each viewer.\n\n\n\n\nTitle: 30 Years Of National Geographic Specials\nYear:  1995\nFile Size: 1,45 GB  \nFormat:AVI\nVideo Length: 01:33:00\nVideo Codec: XviD\nVideo Resolution: 592x448\nVIdeo Bitrate: 2195 kbit/s\nFPS:  29.970000\nAudio Bitrate: 192 kbit/s\nAudio Codec: (AC3)\nChannels:  2\nSubtitles:(N/A)\n  \n \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0112256/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0112256/&lt;/a&gt;\n\n\n\nENJOY:\n\n\n\n\n\nYOUR CHOICE\n\nWTC-SWE\n\n\n\n\n(Please seed so others can enjoy)\n\n\n\n\n\n***** HIGHLY RECOMMENDED DOWNLOAD*****(A must have for all documentary collectors)","torrent":{"xt":"urn:btih:5070e1f86ee265c5e64b43c4c2df7e7ee7006a57","amp;dn":"30+Years+Of+National+Geographic+Specials-%28WTC-SWE%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5070e1f86ee265c5e64b43c4c2df7e7ee7006a57","infoHashBuffer":{"type":"Buffer","data":[80,112,225,248,110,226,101,197,230,75,67,196,194,223,126,126,231,0,106,87]},"announce":[],"urlList":[]}}