{"title":"Spencer Davis, Traffic - Here We Go Round The Mulberry Bush (196","uid":6305272,"size":391558195,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:508cb067c5b09a4bf8daf2593e9ad881859ee1a4&amp;dn=Spencer+Davis%2C+Traffic+-+Here+We+Go+Round+The+Mulberry+Bush+%28196&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"zibbik","files":16,"time":1302303967,"description":"Spencer Davis Group, Traffic - Here We Go Round The Mulberry Bush Sound Track (1968)\nRock, Pop, Psychedelia | Original 1968 United Artists pressing / ULP 1186 (mono)\nVinyl rip @ 24/96\n\n\nTrack listing:\n\nA1. Here We Go Round The Mulberry Bush - Traffic\nA2. Taking Out Time - Spencer Davis Group\nA3. Every Little Thing - Spencer Davis Group\nA4. Virginals Dream - Spencer Davis Group\nA5. Utterly Simple - Traffic\nA6. It's Been A Long Time - Andy Ellison\nB1. Looking Back - Spencer Davis Group\nB2. Picture Of Her - Spencer Davis Group\nB3. Just Like Me - Spencer Davis Group\nB4. Waltz For Caroline - Spencer Davis Group\nB5. Possession - Spencer Davis Group\nB6. Am I What I Was Or Was I What I Am - Traffic\n\n\nAlthough not a proper Spencer Davis Group album, eight of the fourteen songs on the soundtrack to this British teen-sex comedy, based on an early novel by official Beatles biographer Hunter Davies, were by the group (most done just after the departure of Stevie Winwood). There were also three tunes from Traffic, and a superb orchestral-psychedelic oddity from Andy Ellison (lead singer of John's Children). Heard in isolation from the movie, the album tends to highlight just how important Winwood was to the Spencer Davis Group, whose numbers, though pleasant and listenable, are average stereotypical late-'60s London pop. &quot;Waltz for Caroline,&quot; which does feature Winwood, is an organ-dominated instrumental that is identical to the cut titled &quot;Waltz for Lumumba&quot; on other SDG releases; &quot;Picture of Her&quot; is a ringer for the kind of songs Jack Bruce and Peter Brown wrote for Cream. Better are Traffic's more soulful contributions, especially the itle track. \n\n","torrent":{"xt":"urn:btih:508cb067c5b09a4bf8daf2593e9ad881859ee1a4","amp;dn":"Spencer+Davis%2C+Traffic+-+Here+We+Go+Round+The+Mulberry+Bush+%28196","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"508cb067c5b09a4bf8daf2593e9ad881859ee1a4","infoHashBuffer":{"type":"Buffer","data":[80,140,176,103,197,176,154,75,248,218,242,89,62,154,216,129,133,158,225,164]},"announce":[],"urlList":[]}}