{"title":"Jack Davenport - Beaufighter Leader - Kristen Alexander.epub","uid":10507252,"size":1325210,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:50f2885a6fa7ae2d66bda6d1c867a5353b8881a8&amp;dn=Jack+Davenport+-+Beaufighter+Leader+-+Kristen+Alexander.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"PusInBoots","files":1,"time":1404793246,"description":"We all need heroes to look up to and to emulate.' - Sir Arvi Parbo ACB lending sound research with enlightening anecdotes, Jack Davenport, Beaufighter Leader charts Jack's development from his Depression childhood, to the green pilot who had difficulties locating the target on his first Bomber Command operations, through to the superb pilot who led successful strikes against German shipping and the cool and resourceful planner of Coastal Command operations in the latter months of the war. Jack Davenport, Beaufighter Leader recounts the life of an Australian hero. Jack saved the lives of his crew from a near-fatal spin and rescued a pilot from a blazing aircraft; he flew close to well-armed enemy vessels to drop his torpedoes; and led large formations in the narrow confines of the Norwegian fjords to successfully attack enemy shipping. But there is more to heroism than just courage and brave deeds; Jack's career also encompassed the heroism of conviction, duty, responsibility and dedication to service. Kristen Alexander has written the definitive biography of Clive Caldwell, Australia's most successful fighter pilot of World War II. In Jack Davenport, Beaufighter Leader Kristen Alexander presents the life of another courageous and inspiring Australian WWII pilot.","torrent":{"xt":"urn:btih:50f2885a6fa7ae2d66bda6d1c867a5353b8881a8","amp;dn":"Jack+Davenport+-+Beaufighter+Leader+-+Kristen+Alexander.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"50f2885a6fa7ae2d66bda6d1c867a5353b8881a8","infoHashBuffer":{"type":"Buffer","data":[80,242,136,90,111,167,174,45,102,189,166,209,200,103,165,53,59,136,129,168]},"announce":[],"urlList":[]}}