{"title":"Eastern Armenian Comprehensive Self-Study Language Course by Ave","uid":9523443,"size":59159055,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:51b814c19eba33e1c1e6f835f50f06cdfdd41991&amp;dn=Eastern+Armenian+Comprehensive+Self-Study+Language+Course+by+Ave&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1390689882,"description":"The course is in textbook form and is intended for speakers and communicators of English who wish to learn the modern spoken form of the Eastern Armenian language. It is suitable for any English speaking language students, adult learners and Diaspora Armenians ranging from the beginner to intermediate level. This course adopts an entirely new approach to learning Armenian which has been developed over many years through teaching the Armenian language to a wide range of students including foreign diplomats, businessmen and Diaspora Armenians. The textbook utilizes the form Armenian / Armenian transliteration / English translation in its structure and as such is the only one of its kind. The course is structured into 28 lessons each with its own theme or topic which teaches communication and understanding of needs, information, thoughts and feelings of everyday life. Each lesson comprises a combination of reading, writing and speaking activities and includes explanations for correct pronunciation of the Armenian alphabet as well as detailed grammar notes. This compilation of all facets of the Eastern Armenian language enables comprehensive learning and allows a student of any level to make total use of the textbook.","torrent":{"xt":"urn:btih:51b814c19eba33e1c1e6f835f50f06cdfdd41991","amp;dn":"Eastern+Armenian+Comprehensive+Self-Study+Language+Course+by+Ave","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"51b814c19eba33e1c1e6f835f50f06cdfdd41991","infoHashBuffer":{"type":"Buffer","data":[81,184,20,193,158,186,51,225,193,230,248,53,245,15,6,205,253,212,25,145]},"announce":[],"urlList":[]}}