{"title":"Bigger, Stronger, Faster (2008).WS.PDTV.XviD.Ekolb","uid":5375219,"size":732799455,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:522ab0adc6456251ed9cba47b5bd9b63b923b61d&amp;dn=Bigger%2C+Stronger%2C+Faster+%282008%29.WS.PDTV.XviD.Ekolb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Ekolb","files":3,"time":1266553440,"description":"Bigger, Stronger, Faster (2008)\n\nAmerica defines itself in the superlative: it is the biggest, strongest, fastest country in the world. It rewards speed, size and above all else: winning - at sport, at business and at war. Metaphorically it is are a nation on steroids. Is it any wonder that so many of it's heroes are on performance enhancing drugs?\n\nThe documentary examines the steroid use of the director Christopher Bell and his two brothers, Mark and Mike Bell,who all grew up idolizing Arnold Schwarzenegger, Hulk Hogan, and Sylvester Stallone, and also features professional athletes, medical experts, fitness center members, and US Congressmen talking about the issue of anabolic steroids.\n\nBeyond the basic issue of anabolic steroid use, Bigger, Stronger, Faster* examines the lack of consistency in how America views drugs, cheating, and the lengths people go to achieve success. The film looks beyond the steroid issue to such topics as Tiger Woods' laser eye correction to 20/15 vision, professional musicians use of anxiety reducing drugs, or athletes' dependence on cortisone shots, which are a legal steroid. It takes a skeptical view of the health risks of steroids and is critical of the legal health supplement industry.\n\nBigger, Stronger, Faster* is a 2008 documentary film directed by Christopher Bell about the use of anabolic steroids as performance-enhancing drugs in the United States and how this practice relates to the American Dream. The film had its world premiere on January 19, 2008 at the 2008 Sundance Film Festival. The film was shown at the Tribeca Film Festival in April 2008, and opened in limited release in the United States on May 30, 2008.On December 14, 2008, Mike Bell, brother of director Chris Bell, who was prominently featured in the film, died at 37.\n\nChristian Boeving who appeared in the film admitting steroid use, was later fired by his sponsor, Muscletech. Christian was later interviewed on a small cable television show 'The Gregory Mantell Show', where he talked about the repercussions.\n\nFormat            : AVI\nLength            : 699 MiB for 1h 25mn 53s 987ms\n\nCodec             : XviD\nSource            : PDTV\nLanguage          : Englush US\nSubtitles         : None\nGenre             : Documentary\n\nVideo #0          : MPEG-4 Visual at 986 Kbps\nAspect            : 608 x 336 (1.810) at 29.970 fps\n\nAudio #0          : MPEG Audio at 137 Kbps\nInfos             : 2 channels, 48.0 KHz\n\nEkolb","torrent":{"xt":"urn:btih:522ab0adc6456251ed9cba47b5bd9b63b923b61d","amp;dn":"Bigger%2C+Stronger%2C+Faster+%282008%29.WS.PDTV.XviD.Ekolb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"522ab0adc6456251ed9cba47b5bd9b63b923b61d","infoHashBuffer":{"type":"Buffer","data":[82,42,176,173,198,69,98,81,237,156,186,71,181,189,155,99,185,35,182,29]},"announce":[],"urlList":[]}}