{"title":"TTC - History of the United States (2nd Edition)","uid":3501044,"size":1709604173,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:529d0bbdebe67108c03a72785d84b0f73ff7f5f0&amp;dn=TTC+-+History+of+the+United+States+%282nd+Edition%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"BhangWalla","files":554,"time":1152121399,"description":"The Teaching Company\n--------------------\nHistory of the United States, 2nd Edition\n(84 lectures, 30 minutes/lecture)\n\nTaught by Patrick N. Allitt, Gary W. Gallagher, Allen C. Guelzo\t \n\n42 Audio CDs\n\nQuality 80 kbps 32kHz MP3\n\nCourse Lecture Titles\n---------------------\nLiving Bravely\nSpain, France, and the Netherlands\nGentlemen in the Wilderness\nRadicals in the Wilderness\nTraders in the Wilderness\nAn Economy of Slaves\nPrinters, Painters, and Preachers\nThe Great Awakening\nThe Great War for Empire\nThe Rejection of Empire\nThe American Revolution?Politics and People\nThe American Revolution?Howe&amp;#039;s War\nThe American Revolution?Washington&amp;#039;s War\nCreating the Constitution\nHamilton&amp;#039;s Republic\nRepublicans and Federalists\nAdams and Liberty\nThe Jeffersonian Reaction\nTerritory and Treason\nThe Agrarian Republic\nThe Disastrous War of 1812\nThe &quot;American System&quot;\nA Nation Announcing Itself\nNational Republican Follies\nThe Second Great Awakening \nDark Satanic Mills\nThe Military Chieftain\nThe Politics of Distrust\nThe Monster Bank\nWhigs and Democrats\nAmerican Romanticism\nThe Age of Reform\nSouthern Society and the Defense of Slavery\nWhose Manifest Destiny?\nThe Mexican War\nThe Great Compromise\nSectional Tensions Escalate\nDrifting Toward Disaster\nThe Coming of War\nThe First Year of Fighting\nShifting Tides of Battle\nDiplomatic Clashes and Sustaining the War\nBehind the Lines?Politics and Economies\nAfrican Americans in Wartime\nThe Union Drive to Victory\nPresidential Reconstruction\nCongress Takes Command\nReconstruction Ends\nIndustrialization\nTranscontinental Railroads\nThe Last Indian Wars\nFarming the Great Plains\nAfrican Americans after Reconstruction\nMen and Women\nReligion in Victorian America\nThe Populists\nThe New Immigration\nCity Life\nLabor and Capital\nTheodore Roosevelt and Progressivism\nMass Production\nWorld War I?The Road to Intervention\nWorld War I?Versailles and Wilson&amp;#039;s Gambit \nThe 1920s\nThe Wall Street Crash and the Great Depression\nThe New Deal\nWorld War II?The Road to Pearl Harbor\nWorld War II?The European Theater\nWorld War II?The Pacific Theater\nThe Cold War\nThe Korean War and McCarthyism\nThe Affluent Society\nThe Civil Rights Movement\nThe New Frontier and the Great Society\nThe Rise of Mass Media\nThe Vietnam War\nThe Women&amp;#039;s Movement\nNixon and Watergate\nEnvironmentalism\nReligion in Twentieth-Century America\nCarter and the Reagan Revolution\nThe New World Order\nClinton&amp;#039;s America and the Millennium\nReflections\n\t\t\t\t\t\n\nThis is the story of a country in which immigrants of the late 19th and early 20th centuries huddled in cramped tenement apartments lit by hazardous kerosene lamps. And a country that, little more than a half-century later, a renowned economist described as &quot;The Affluent Society.&quot; \n\nThis is the chronicle of a nation that enslaved an entire race of people to perform its labor. And of a nation that fought a Civil War that freed its slaves, and outlawed segregation and discrimination. \n\nThis is history shaped by Revolutionary War and Vietnam, Thomas Jefferson and William Jefferson Clinton, Puritanism and Feminism, Booker T. Washington and Martin Luther King, Jamestown and Disneyland, Harpers Ferry and Henry Ford, oil wells and Orson Welles. \n\nThis is a review of the extraordinary blend of people, ideas, inventions, and events that comprise The History of the United States. In this seven-part, 84-lecture series, three noted historians and lecturers?two of whom teach other popular Teaching Company courses?present the nation&amp;#039;s past through their areas of special interest. \n\nThree Outstanding Instructors in This Sweeping Series \n\nThis sweeping presentation is provided by three award-winning professors: \nDr. Allen C. Guelzo is Henry R. Luce Professor of the Civil War Era and Professor of History at Gettysburg College, and former Dean of Templeton Honors College at Eastern University, examines the beginnings of European settlement through the Great Compromise of 1850. His teaching awards include the Dean&amp;#039;s Award for Distinguished Graduate Teaching from the University of Pennsylvania. His most recent book, Abraham Lincoln: Redeemer President (1999), won the Lincoln Prize and the Book Prize of the Abraham Lincoln Institute of the Mid-Atlantic. \nDr. Gary W. Gallagher is the John L. Nau III Professor in the History of the American Civil War at the University of Virginia and a top Civil War expert. Dr. Gallagher presents the pre-Civil War period through Reconstruction. His teaching, which includes personal guided tours of major battlefields, has consistently won high praise from students, and he is a frequent lecturer and author. He also teaches the Great Course The American Civil War. \nDr. Patrick N. Allitt, Professor of History at Emory University, discusses 19th-century industrialization through the early 21st century. In 2000 he was appointed to the National Endowment for the Humanities/Arthur Blank Professorship of Teaching in the Humanities, and recently received the Emory Center for Teaching and Curriculum&amp;#039;s Excellence in Teaching Award. He also teaches The Great Courses Victorian Britain and American Religious History. \n\nWith their guidance you will follow, as they unfold over time, factors that have enabled the United States to become the largest, wealthiest, and most powerful democratic republic in history. \n\nThese include its sense of confidence, national destiny, and exceptionalism; religiosity and belief in virtue; abundance of natural resources and entrepreneurial talent; ability to accept a diverse array of immigrants; and, as important as anything else, success in making democracy a reality rather than a theory. \nWhat You Will Learn: A Voyage of Discovery \n\nIn the opening lecture, Professor Guelzo describes this course as &quot;a voyage of discovery. Not a voyage to another continent or another hemisphere or even a trip to another planet, but to something which may be even stranger, and that is the history of the United States.&quot; \n\nYou will explore a past America often different from what you were taught or have imagined. \n\nYou will understand historical fact versus fiction when it comes to figures as diverse as: \n\nJacques Cartier. As early as 1534, he was &quot;surprised to sight Indians, along what he thought was an unexplored Atlantic coastline, waving furs on sticks as an invitation for the Europeans to come down to the beach and trade.&quot; \n\nJames Monroe and Robert Livingston. They made the Louisiana Purchase, the greatest real estate deal in history, without approval from then President Thomas Jefferson (they had no time to tell him). Jefferson, in turn, had no constitutional authority to make the treaty of cession that finalized the purchase. He sent the document to the Senate with the comment, &quot;The less we say about Constitutional difficulties the better.&quot; \n\nCarrie Nation. The fiery temperance advocate hired a publicity manager to arrange media coverage before she invaded and smashed up a saloon. She even sold autographed copies of the axes she used. \n\nIsaac Singer. This sewing machine magnate pioneered such now universal business techniques as installment-plan payments and nationwide advertising. \n\nYou will learn which novel was the most influential in U.S. history (hint: its female author once met Abraham Lincoln); why the west side became the best place to live in many older U.S. cities (prevailing winds blew smoke and fumes away from you); and what The Wizard of Oz is really about (the election of 1896). \nReading History &quot;Forward&quot; \n\nAn additional benefit of this course is that, as they present U.S. history, Professors Guelzo, Gallagher, and Allitt also provide a mini-course on teaching and learning history in general. \n\nThey convey a variety of highly useful lessons on how to think about history, place it in a proper perspective, and understand it accurately. These include an emphasis on the social and political context in which vital decisions were made and events took place, and an ability to take both the short-term and long-term views of issues. \n\nIn his lectures on the Civil War and Reconstruction, Professor Gallagher warns that the fact that we know how history turned out, that we &quot;read history backward,&quot; often distorts our understanding. Repeatedly, he reminds you to &quot;read forward, not backward,&quot; to try to understand how people of the past experienced events as they unfolded. \nSuccesses Too Often Taken for Granted \n\nProfessor Allitt reflects on the aspects of U.S. history that make it unique and noteworthy, and which indicate the degree to which the nation has lived up to its ideals. He notes that America may fall short of its own high standards, &quot;but compared to the other actual nations of the world, America was far more impressive for its successes than for its failings.&quot; \n\nSome of these successes, Professor Allitt adds, are so obvious that we often fail to recognize them. The poverty that exists in the U.S. is of a relative kind; it would not be recognized as poverty in most of the rest of the world. In addition, the U.S. has achieved an exceptional degree of political stability and internal civil peace for a very long time. &quot;We&amp;#039;re so familiar with it that it&amp;#039;s easy to forget how rare it is,&quot; Professor Allitt notes. \n\nThis is one of the many vital and often overlooked aspects of U.S. history that this course will help you to appreciate. Throughout the nation&amp;#039;s existence, even during the Civil War, democracy has always worked. Elections have always taken place, the losers have always accepted that they have lost and left office, and the military has never tried to overthrow the civilian government. \n\nPerhaps this is a legacy of the most popular and revered American ever, George Washington. \n\nAt the end of the Revolutionary War, some of Washington&amp;#039;s officers suggested that the Continental Army should take over the country and make him the first King of America. Washington flatly rejected the offer, resigned his commission, and rode off to his home in Mount Vernon. \n\nThe notion that anyone could refuse power in this manner shocked Britain&amp;#039;s King George III. &quot;If this is true,&quot; the king said, &quot;then he is the greatest man of the age.&quot; \n\nand you WILL HELP SEED this...\n\n- BhangWalla -\t\t\n\n","torrent":{"xt":"urn:btih:529d0bbdebe67108c03a72785d84b0f73ff7f5f0","amp;dn":"TTC+-+History+of+the+United+States+%282nd+Edition%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"529d0bbdebe67108c03a72785d84b0f73ff7f5f0","infoHashBuffer":{"type":"Buffer","data":[82,157,11,189,235,230,113,8,192,58,114,120,93,132,176,247,63,247,245,240]},"announce":[],"urlList":[]}}