{"title":"Angelcorpse - Discography [Metal] (1996 - 2007) (mp3)","uid":13162232,"size":413485796,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5374f56c6df0a1e8e515eaf62844efb581bffda3&amp;dn=Angelcorpse+-+Discography+%5BMetal%5D+%281996+-+2007%29+%28mp3%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TetsElPilsen","files":88,"time":1452165579,"description":"Angelcorpse - Discography [Metal] (1996 - 2007) (mp3)\r\n\r\nAngelcorpse was a blackened death metal band born on the ashes of Pete Helmkamp's previous band, Order from Chaos, originally from Kansas City, Missouri, and relocated to Tampa, Florida. They formed in 1995, with a line-up of Helmkamp, guitarist Gene Palubicki, and drummer John Longstreth, and recorded a demo, Goats to Azazael, which led to a contract with Osmose Productions.[1] The band's debut album, Hammer of Gods, was released in 1996, after which rhythm guitarist Bill Taylor joined, playing on second album Exterminate (1998).[1] Drummer Tony Laureano joined shortly after its release but Taylor left.[1] The band's third album, The Inexorable, was released in the fall of 1999, after which Taylor rejoined. While on tour with Immortal, Satyricon, and Krisiun, in support of The Inexorable, the band had an accident in their tour van, in which Helmkamp was injured. On the same tour, Helmkamp's girlfriend was stabbed, and he decided to leave the band. The rest of the band continued for a while but decided to split up.\r\n\r\nIn 2006, the band reformed and recorded a new album. Helmkamp said of the reunion: &quot;It just seems like the planets realigned. It's not like we didn't get along or that there were any bridges to mend.&quot;\r\n\r\nTheir lyrical themes are generally concerned with warfare. The band has been involved in a number of American and European tours involving other metal acts such as Immortal, Krisiun, Cianide, and Watain. An East Coast USA tour was completed in May 2007 . In 2008 the band embarked on a larger European tour with Revenge and Arkhon Infaustus throughout Europe, this tour included a performance at the United Metal Maniacs Open Air Festival in Bitterfeld Germany. Upon returning to the US, live dates on the West Coast with Cemetery Urn, Sanguis Imperum, Gospel of the Horns, and Ares Kingdom were completed. On April 7, 2009, the members announced disbandment, citing &quot;musical differences&quot; as the reason.\r\n\r\nHelmkamp claimed that the band was fuelled by &quot;the constant struggle, strife, camaraderie, and unified will that forged the iron, blood, and blasphemy of our music and lyrics&quot;.\r\n\r\n\r\nYear: 1996 - 2007\r\nCountry: United States\r\nGenre: Blackened Death Metal\r\nCodec: Mp3\r\nBitrate: Various\r\nSize: 394 MB\r\n\r\n\r\nDiscography:\r\nANGELCORPSE - 1996 - Goats To Azazael (Demo)\r\nANGELCORPSE - 1996 - Hammer Of Gods\r\nANGELCORPSE - 1997 - Nuclear Hell (Single)\r\nANGELCORPSE - 1997 - Wolflust (Single)\r\nANGELCORPSE - 1998 - Exterminate\r\nANGELCORPSE - 1999 - The Inexorable\r\nANGELCORPSE - 1999 &amp; MARTIRE (AUSTRALIA)- Winds Of Desecration- Hellstorm- Chaosrape (Split)\r\nANGELCORPSE - 2001 - iron, blood &amp; blasphemy (Compilation)\r\nANGELCORPSE - 2002 - Death Dragons Of The Apocalypse (Live)\r\nANGELCORPSE - 2007 - Of Lucifer And Lightning","torrent":{"xt":"urn:btih:5374f56c6df0a1e8e515eaf62844efb581bffda3","amp;dn":"Angelcorpse+-+Discography+%5BMetal%5D+%281996+-+2007%29+%28mp3%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5374f56c6df0a1e8e515eaf62844efb581bffda3","infoHashBuffer":{"type":"Buffer","data":[83,116,245,108,109,240,161,232,229,21,234,246,40,68,239,181,129,191,253,163]},"announce":[],"urlList":[]}}