{"title":"Kriya in Rishi in PART 1 (basic) Course","uid":4356852,"size":213338,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:537df07a91a51f3d564bfb252458d296c89a1984&amp;dn=Kriya+in+Rishi+in+PART+1+%28basic%29+Course&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"welovesrisri","files":1,"time":1219449739,"description":"What is The Art of Living Foundation?\nThe Art of Living Foundation is a global, nonprofit organization with chapters in 146 countries. As a Non-Governmental\nOrganization (NGO) of the United Nations, we participate in a variety of activities relating to health and education. We also\nconduct humanitarian and disaster relief programs in partnership with the International Association of Human Values.\nWhat Is The Art of Living Course?\nThe course is a self-development workshop offering techniques and practical knowledge to release stress and restore\npeace of mind. Whether happy and successful, or struggling with poor health, depression or anxiety, participants come\naway feeling lighter and empowered. The course brings immediate improvement in energy, sleep patterns, peace of mind,\nand an overall feeling of well-being. Continuing with short, easy practices at home nourishes all levels of the body, mind,\nand spirit everyday.\nThe masterpiece of the course is Sudarshan Kriya. This unique practice is remarkably effective at dissolving accumulated\nstress and negative emotions while triggering a natural healing response. Sudarshan Kriya works quickly and does not\nrequire physical exertion or mental control. Unlike meditation where the benefits depend on the mind becoming quiet,\nSudarshan Kriya works regardless of thoughts or emotions. For those who meditate, the practice creates a calmness of\nmind that sets the stage for deep meditation to occur afterward.\nWhat is the source of this knowledge?\nBreathing practices were developed over thousands of years by the many architects of Yoga who studied how the breath\ncould cleanse, energize, and heal the system, and expand consciousness. Sudarshan Kriya is a unique and vital\nenhancement of this knowledge for the modern age where unprecedented stress has taken a heavy toll. The Art of Living\nCourse and practices were developed by His Holiness Sri Sri Ravi Shankar.\nExpansion of Life - Going Beyond Stress Reduction\nSociety has focused on external comforts at the expense of the mind and inner development. We live longer, but not\nbetter. A mature mind senses there is something more to life. When stress is removed and the mind becomes calm and\ncentered in the present moment, a clarity of one's inner being emerges.\nThe abundant enthusiasm, profound joy and unconditional love that children exhibit fades unnecessarily because stress\naccumulates. Stress causes the mind to dwell on the past or future reducing our awareness of the present, and the\ngenuineness of our interactions. Without that influence we can open to an awareness of our own being, which is the\nsource of all joy and love. Taking a few minutes to cleanse on the inside everyday can transform the quality of life.","torrent":{"xt":"urn:btih:537df07a91a51f3d564bfb252458d296c89a1984","amp;dn":"Kriya+in+Rishi+in+PART+1+%28basic%29+Course","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"537df07a91a51f3d564bfb252458d296c89a1984","infoHashBuffer":{"type":"Buffer","data":[83,125,240,122,145,165,31,61,86,75,251,37,36,88,210,150,200,154,25,132]},"announce":[],"urlList":[]}}