{"title":"The Bible Complete Season 1 BDRip","uid":8392435,"size":4964007494,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:538cee3b519ced3796054a6fbaa6fbd7cb37d377&amp;dn=The+Bible+Complete+Season+1+BDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Corinthen","files":-1,"time":1366475406,"description":"1)  In the Beginning \nNoah endures God's wrath; Abraham reaches the Promised Land but still must prove his faith in God; Moses leads the Israelites out of Egypt, and his faith in God is rewarded when the Red Sea parts to allow the Israelites to escape Pharaoh's chariots; Moses delivers his final message from God-the Ten Commandments.\n\n2)  Exodus \nGod speaks to Moses through the burning bush; Moses returns to Egypt; ten Plagues of Egypt; Moses leads the Israelites in The Exodus; Moses parts the Red Sea; Moses receives the Ten Commandments at Mt. Sinai; Joshua becomes the leader of the Israelites; the Israelites camp outside of Jericho; Joshua sends spies into Jericho.\n\n3)  Homeland \nJoshua invades and conquers Jericho; Delilah betrays Samson, a hero of the Israelites who battled against Philistines.\n\n4)  Kingdom \nSamuel anoints Saul as king, a move that could throw the nation into civil war; Saul is consumed with jealousy over the crown when David defeats Goliath; King David ushers a golden age for Israel, but is soon seduced by power and lust for Bathsheba; God forgives David, and Solomon builds God's temple in Jerusalem.\n\n5)  Survival \nZedekiah, Nebuchadnezzar, the Jews are enslaved in Babylon; Daniel is thrown into the lions' den, but when his faith endures and God spares him, the Jews are allowed to return to Jerusalem.\n\n6)  Hope \nDuring the time Roman occupation, the Angel Gabriel tells Mary she will bear a child; Joseph takes Mary to Bethlehem for the census, where Jesus is born; the Holy family escapes Herod's order to kill Bethlehem's male babies; Judea comes under the ruthless rule of Pilate; John baptizes Jesus, who is now ready to take on his mission - and his revolution; Jesus and Peter meet.\n\n7)  Mission \nJesus feeds the crowds in Galilee and brings a dead man, Lazarus, back to life; Jesus enters Jerusalem riding on a donkey - a declaration that he is the Messiah; Jesus turns on the money-changers in the Temple.\n\n8)  Betrayal \nCaiphas coaxes Judas into betraying Jesus; Jesus throws the disciples into turmoil at the Last Supper; Jesus is arrested and condemned to death as the disciples scatter.\n\n9)  Passion \nThe crucifixion and the Resurrection of Jesus through Ascension, Pentecost and Revelation. During this last episode, Peter denies Jesus and Judas hangs himself; the crowd clamours for Jesus' death; Jesus is crucified, but when Mary Magdalene goes to his tomb, a figure walks towards her - he is back; Jesus commissions the disciples to &quot;go and preach to all creation,&quot; but their godly mission meets with hatred and even death.\n\n10)  Courage \nPaul has a vision and experiences a miraculous change of faith on a journey to Damascus; Martyrdom of the Disciples, John survival and exile to Patmos, John receives a revelation - Jesus is coming back, and all who keep the faith will be rewarded.","torrent":{"xt":"urn:btih:538cee3b519ced3796054a6fbaa6fbd7cb37d377","amp;dn":"The+Bible+Complete+Season+1+BDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"538cee3b519ced3796054a6fbaa6fbd7cb37d377","infoHashBuffer":{"type":"Buffer","data":[83,140,238,59,81,156,237,55,150,5,74,111,186,166,251,215,203,55,211,119]},"announce":[],"urlList":[]}}