{"title":"Jennifer Daydreamer - Oliver, Anna &amp; Eva","uid":8398071,"size":97098106,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:53a8f438013c09e760093ba5412d22381f69027b&amp;dn=Jennifer+Daydreamer+-+Oliver%2C+Anna+%26amp%3B+Eva&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LeonardTSpock","files":-1,"time":1366622163,"description":"'Oliver' &amp; 'Anna &amp; Eva'\n\nTop Shelf Productions, 2003 &amp; 2004, 60 &amp; 84 pages\n\nWritten and Illustrated by Jennifer Daydreamer\n\nMini-comic fan favorite, Jennifer Daydreamer, cracks her world open a bit more for this exciting new series of stand-alone books from Top Shelf. Her complete fantasy universe, called Encephalon, is akin to a dreamier Wizard of Oz or a hallucinatory Harry Potter. Daydreamer has spent nearly three years studying symbols, fairy tales, schizophrenia and the various natures of reality in preparation for this new series. \n\nIn this first volume, Oliver, there are three intertwined stories set in Jennifer's unique quirky landscape that feature the psychic Circus Zazel, bratty angels, thoughts that walk around, and the title character Oliver, a small pre-pubescent boy in a devil costume. Jennifer's drawings are dense, lush and almost vibrate off the page. Don't miss this exciting full-scale debut by this wholly unique artist.\n\nDeveloping a steady cult following, this unique fantasy series is one fans won't want to miss. Each book is a self-contained story, with a continuing cast of characters, set in the melancholic world of Encephalon. In Jennifer Daydreamer's latest volume, Anna and Eva, we meet Ben, a lonely, rebellious boy, longing to run away and join the circus, and the Pettibone family, where Anna longs to talk to her dead sister, Eva. \n\nDaydreamer's comics aren't just mere stories. Bewitching many readers with her layers of symbol and meaning, fans will delight in the underlying meditation on the nature of psychic phenomena.","torrent":{"xt":"urn:btih:53a8f438013c09e760093ba5412d22381f69027b","amp;dn":"Jennifer+Daydreamer+-+Oliver%2C+Anna+%26amp%3B+Eva","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53a8f438013c09e760093ba5412d22381f69027b","infoHashBuffer":{"type":"Buffer","data":[83,168,244,56,1,60,9,231,96,9,59,165,65,45,34,56,31,105,2,123]},"announce":[],"urlList":[]}}