{"title":"Business, Economics and Enterprises: Teaching School Subjects 11","uid":4725242,"size":1920218,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:541599dd7bfac347af20ff52bb5b1dc3a64a808b&amp;dn=Business%2C+Economics+and+Enterprises%3A+Teaching+School+Subjects+11&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"VasiaZozulia","files":1,"time":1234717860,"description":"Business, Economics and Enterprise is for teachers of business education and economics in the years of their early professional development, including those on PGCE courses, those in their induction year, and those in years 2 and 3 of their teaching career. The book will also be suitable for subject leaders with mentor responsibilities and Advanced Skills teachers undertaking specialist inset and teaching support.\n\nThe book covers the training standards for NQTs and the Induction Standards. But it goes beyond this by fully exploring issues to do with subject knowledge in learning to teach, broadly accepting that an essential element of a secondary teacher's identity is tied up with the subject taught. A distinguishing feature of the book is that it starts by recognizing that new teachers often feel disempowered in relation to the subject expertise that they bring into teaching.\n\nBusiness, Economics and Enterprise provides stimulating assistance to subject specialists by helping them find ways of thinking about their specialism, how to teach with it and how to engage with what pupils learn through it.","torrent":{"xt":"urn:btih:541599dd7bfac347af20ff52bb5b1dc3a64a808b","amp;dn":"Business%2C+Economics+and+Enterprises%3A+Teaching+School+Subjects+11","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"541599dd7bfac347af20ff52bb5b1dc3a64a808b","infoHashBuffer":{"type":"Buffer","data":[84,21,153,221,123,250,195,71,175,32,255,82,187,91,29,195,166,74,128,139]},"announce":[],"urlList":[]}}