{"title":"Democracy Now - 13 oct 2011","uid":6742008,"size":457672259,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:55037123e52adf5fbba7d7960b54473e64208de4&amp;dn=Democracy+Now+-+13+oct+2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1318542840,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Oct 13, 2011\n\n- 4 Arrested as Workers March on Wall Street; Protesters Ordered to Clear Square for Cleaning\n- Occupy San Francisco Protesters Shut Down Wells Fargo Building, 11 Arrested\n- Study: U.S. Exaggerating Claims of Targeting Taliban Leaders\n- U.S. Seizes on Alleged Plot in Push for New Iran Sanctions\n- Experts Question Validity of Iran Allegations\n- Syrian-U.S. Citizen Accused of Spying on Anti-Assad Protesters\n- Gaddafi Son Reportedly Captured; NTC Accused of Prisoner Abuse\n- &quot;Underwear Bomber&quot; Pleads Guilty to Failed 2009 Attack\n- Burma Begins Freeing Political Prisoners\n- Congress Approves Long-Stalled Trade Deals\n- 8 Killed in California Shooting\n- Disabled Navy Vet Challenges Same-Sex Marriage Ban\n- Groups Sue to Block South Carolina Anti-Immigrant Law; Hispanics Stage Alabama Walkout\n- Harrisburg, PA Files for Bankruptcy\n- Amnesty Urges Canada to Arrest Bush for Torture\n\n\nSpecial reports\n\n- &quot;News for All the People&quot;: Juan GonzÃƒÂ¡lez &amp; Joseph Torres on the Epic Story of Race &amp; the U.S. Media\n\nAfter seven years of research, the groundbreaking new book, &quot;News for All the People: The Epic Story of Race and the American Media,&quot; examines how the media has played a pivotal role in perpetuating racist views in the United States. It recalls lives of the unsung pioneering black, Latino, Native American and Asian-American journalists who challenged the worst racial aspects of the white-owned media. It also tells the untold story of how the fight over who controls the internet is just the latest chapter in a centuries-old debate on the role of the media - and the technologies used to deliver it - in a democracy. Today, in a Democracy Now! exclusive, we speak with the book's authors, Democracy Now! co-host and award-winning journalist Juan GonzÃƒÂ¡lez, and Joseph Torres of the media reform organization Free Press. &quot;One of the things that we've uncovered is that this fundamental debate that is constantly occurring is: does our nation need a centralized system of news and information, or does it need a decentralized, autonomous system? And which serves democracy best?&quot; GonzÃƒÂ¡lez says. &quot;It turns out that in those periods of time when the government has opted for a decentralized or autonomous system, democracy has had a better opportunity to flourish, racial minorities have been able to be heard more often and to establish their own press. In those periods of the nation's history when policies have fostered centralized news and information, that's when dissident voices, racial minorities, marginalized groups in society are excluded from the media system.&quot; On the role of civil rights groups in the digital age, Torres notes that &quot;the internet is an open platform. [Internet service providers] up to now have not been able to interfere with your web traffic. You can access any website you want without being slowed down. What they want to do is ... have a play for play system, where if you have a website at Democracy Now!, Democracy Now! would have to pay more to make sure the public can see your site at the fastest speeds, otherwise you're going to be slowed down. For people of color, it is critical because the low barrier of entries, the internet, that we keep the internet open - a free platform - because we don't have the economic wealth to be able to pay ISPs and make sure our sites are loaded faster.&quot;\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:55037123e52adf5fbba7d7960b54473e64208de4","amp;dn":"Democracy+Now+-+13+oct+2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"55037123e52adf5fbba7d7960b54473e64208de4","infoHashBuffer":{"type":"Buffer","data":[85,3,113,35,229,42,223,95,187,167,215,150,11,84,71,62,100,32,141,228]},"announce":[],"urlList":[]}}