{"title":"VobSub Pack + Vobsub fix ","uid":7328760,"size":2548838,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5691e8ace350ae929e624800f997bb5778f1a62d&amp;dn=VobSub+Pack+%2B+Vobsub+fix+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"slurpy97","files":4,"time":1338842191,"description":"DirectVobSub (formerly known as VSFilter) is a software add-on for Microsoft Windows (a DirectShow filter) that is able to read external subtitle files and superimposes them on a playing video file.[1][2][3]\n\nDirectVobSub/VSFilter were formerly part of a whole application known as VobSub which was also able to extract subtitles from DVD Video and create text-based subtitles, without ripping the DVD to a file first. The last version of VobSub was version 2.23, after which the development of VobSub ceased. VSFilter was a part of the guliverkli project on SourceForge web site. The guliverkli project also includes the ability to extract subtitles from a DVD via the vobsub ripper program.[4][5][6] However, development of guliverkli ceased in 2005 with version 2.37. In 2007, it became a part of the Guliverkli2 project, now known as DirectVobSub, starting with version 2.38.[7][8][9][10][11]\n\nDirectVobSub is also capable of extracting subtitles from a DVD without ripping it to a file first. Note that you can download &quot;vobsub ripper&quot; for the same effect. Note also the guliverkli project has a related project VSrip.\n\n\nThe fix is used, if you cant open SubResync and SubMux and thats because you have installed ie8 on your computer.\n\n\nI know that it is free stuff at the net, but here you can get it faster. \n\n\nYou can use this program to convert .sub to .srt fil for use on AppleTv\n\n\n\nGreetings Realuploads.\n\n","torrent":{"xt":"urn:btih:5691e8ace350ae929e624800f997bb5778f1a62d","amp;dn":"VobSub+Pack+%2B+Vobsub+fix+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5691e8ace350ae929e624800f997bb5778f1a62d","infoHashBuffer":{"type":"Buffer","data":[86,145,232,172,227,80,174,146,158,98,72,0,249,151,187,87,120,241,166,45]},"announce":[],"urlList":[]}}