{"title":"A voce roca - Racconti di un olocausto [Wmv - Ita Wma] [TNTvilla","uid":5204467,"size":65475064,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:57d03326c08e4b0049fa94d6302b4beb1e6f8ec0&amp;dn=A+voce+roca+-+Racconti+di+un+olocausto+%5BWmv+-+Ita+Wma%5D+%5BTNTvilla&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"darayava","files":1,"time":1260308596,"description":"A VOCE ROCA\n\nRegia e drammaturgia: Carla Vicenzoni - Claudio Messini. \n\t\nRacconti di un olocausto: spettacolo teatrale realizzato in occasione della  giornata della memoria , 27 gennaio 2006. \nStorie di vita liberamente tratte da  Sotto il cielo d'Europa  di F. Fessi. \n\nRealizzato dall'ISIS  Carlo Anti  di Vllafranca di Verona e la compagnia teatrale  I gotturni .\n\nDachau, Mauthausen Auschwitz, Chelmno, Ravensbruck, Fossoli furono nomi uguali agli altri sulle carte e sulle guide turistiche. In realtÃƒÂ , come accadde per migliaia di cittÃƒÂ , villaggi e regioni dell'Europa nazista e fascista dal I933 al I945, essi nascosero un orribile segreto: campi di lavoro forzato, di tortura e di morte nei quali scomparvero milioni di esseri umani e tra essi bambini e ragazzi. Oppositori del nazismo o del fascismo di ogni nazionalitÃƒÂ , zingari o ebrei giovani che furono prigionieri dei lager e dei ghetti, seppero a volte piÃƒÂ¹ degli adulti combattere e resistere fino all' ultimo. Molti di loro sono scomparsi dalla faccia della terra senza lasciare traccia e nemmeno il nome; di altri ci resta un frammento di storia o una fotografia sbiadita. Pochi sono i sopravvissuti. Inseguendo le vicende e la breve esistenza di otto di loro questa sezione vuole ricostruire la vita quotidiana di alcuni dei maggiori luoghi di internamento o di annientamento che le dittature nazista e fascista istituirono in Europa contro i civili a tutela della Ã‚Â«razza pura e padronaÃ‚Â» che si proponeva di eliminare tutti i diversi. Bambini e bambine, ragazzi e ragazze che lottano, di cui colpisce sempre la vitalitÃƒÂ  e il desiderio di futuro, ma che fin da subito subirono una violenza senza eguale: la distruzione della loro giovinezza.\n\nNei lager e nei ghetti dopo soltanto alcune ore di prigionia per chiunque veniva meno la possibilitÃƒÂ  di riconoscersi come essere umano: spogliati di tutto, rasati, privati di ogni effetto personale, unico legame rimasto con il passato, gli internati erano sottoposti ad attese snervanti cariche di incertezza, a insulti, percosse e a una serie di trattamenti piÃƒÂ¹ o meno logoranti ,la ricerca spasmodica del cibo sempre insufficiente, le latrine comuni, la sporcizia... Chi reagiva ai maltrattamenti o cercava di prestare aiuto a un compagno veniva picchiato selvaggiamente. Fin da subito i prigionieri si rendevano conto della loro totale impotenza a fronte di una completa dipendenza da un potere assoluto che incombeva minaccioso sul loro fisico e sulla loro anima. Il primo atto di violenza subito, il primo colpo ricevuto facevano crollare anche negli uomini e nelle donne piÃƒÂ¹ forti l' idea della invulnerabilitÃƒÂ  del proprio corpo e la speranza di trovare aiuto nel momento del bisogno. I figli venivano separati dalle madri e dai padri, i ragazzi e le ragazze dai fratelli, dalle sorelle e dagli amici. Tutto era possibile e tutto poteva accadere inaspettato e senza motivo. La morte era a pochi passi e a ogni istante faceva sentire il suo gelido alito sui corpi martoriati dei prigionieri. A noi che oggi ne ripercorriamo la storia i protagonisti di questa sezione non sembrano bambini o ragazzi, piuttosto uomini e donne immersi in un oceano di sofferenza e di dolore. Non giocano non sanno piÃƒÂ¹ come fare a divertirsi, hanno dimenticato ogni curiositÃƒÂ  e ogni slancio tipici della primavera della vita. Pensano il piÃƒÂ¹ delle volte a sopravvivere e a resistere e  sanno che mai potranno trovare un farmaco o un chirurgo capace di estirpare dal loro cuore il male che hanno subito e visto.\n\n\n::: - Scheda tecnica - :::\n\n\n[ Info sul file ]\n\nNome: A voce roca.wmv\nData: 6/12/2009 16:02:42\nDimensione: 65,475,064 bytes (62.442 MB)\n\n[ Info generiche ]\n\nDurata: 00:36:23 (2182.62 s)\nTipo di contenitore: ASF/WMV\nData creazione: 16/10/2007 16:00:59 UTC\nEncrypted: No\nStreams totali: 2\nTipo stream n. 1: Audio Media (0x161 (DivX audio v2 (WMA v2)))\nTipo stream n. 2: Video Media (WMV2)\nAudio streams: 1\n\n[ Dati rilevanti ]\n\nRisoluzione: MOLTO ALTA (640 x 480)\nLarghezza: multipla di 32 (BENE)\nAltezza: multipla di 32 (BENE)\n\n[ Traccia video ]\n\nFourCC: WMV2\nRisoluzione: 640 x 480\nFramerate: 30.000030 fps\nBitrate: 213.851 kbps\n\n[ Traccia audio ]\n\nAudio tag: 0x161 (DivX audio v2 (WMA v2))\nBitrate: 42.735 kbps\nCanali: 2\nFrequenza: 32000 Hz\n\n[ Profile compliancy ]\n\nProfilo da testare: MTK PAL 6000\nRisoluzione: Ok\nFramerate: Ok\n\nRapporto generato da  Visit this link:(18-11-2007) in data Ã‚Â 6 dic 2009, h 16:03:29\n\n\nVisit http://www.tntvillage.scambioetico.org/","torrent":{"xt":"urn:btih:57d03326c08e4b0049fa94d6302b4beb1e6f8ec0","amp;dn":"A+voce+roca+-+Racconti+di+un+olocausto+%5BWmv+-+Ita+Wma%5D+%5BTNTvilla","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"57d03326c08e4b0049fa94d6302b4beb1e6f8ec0","infoHashBuffer":{"type":"Buffer","data":[87,208,51,38,192,142,75,0,73,250,148,214,48,43,75,235,30,111,142,192]},"announce":[],"urlList":[]}}