{"title":"Samsung PC Studio Pro 3.2.2 HF6","uid":6498043,"size":67203259,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5b2cabd14e564ba110d577a38b39701e6086ca06&amp;dn=Samsung+PC+Studio+Pro+3.2.2+HF6&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dougbrowne","files":1,"time":1309149778,"description":"Allows you to manage your Samsung mobile phone data. \n\nSamsung PC Studio application was designed to be a professional tool that you can use to manage you personal data and multimedia files by connecting a Samsung Mobile Phone. \n\nNote \nÃ‚Â· To use PC Studio multimedia functions such as MMS Composer, Microsoft DirectX version 9.0 or higher is required \n\nHere are some key features of &quot;Samsung PC Studio&quot;: \n\nÃ‚Â· PC Studio Launcher \nÃ‚Â· Provides the shortcut icons to start the PC Studio applications. \nÃ‚Â· Connection Manager (Manage connections) \nÃ‚Â· Allows you to select the connection type for PC to Phone connection. \nÃ‚Â· Phone Editor (Manage contacts and more) \nÃ‚Â· Allows you to retrieve personal information saved in the Phone, such as Phonebook and Organizer and to add new data or delete and edit the saved data. \nÃ‚Â· Message Manager (Manage messages) \nÃ‚Â· Allows you to retrieve message data saved in the Phone, such as SMS and MMS data, and to send SMS and MMS data via the connected Phone. \nÃ‚Â· PC Sync (Synchronize) \nÃ‚Â· Allows you to synchronize personal information data saved in the Phone and the data saved in the PC's personal information management program. The PC personal information management programs supported by PC Sync are Microsoft Outlook and Outlook Express. \nÃ‚Â· Phone Explorer (Manage files) \nÃ‚Â· Allows you to browse multimedia files saved in the Phone in the Windows Browser and to download files or to upload PC files to the Phone. \nÃ‚Â· Networking Wizard (Manage Internet Connections) \nÃ‚Â· Allows you to access the Internet using the connected Phone as a modem device. \nÃ‚Â· MMS Composer(Compose multimedia messages) \nÃ‚Â· Allows you to make and edit multimedia messages using such content as photos, moving pictures, sounds and text. The multimedia messages produced using MMS Composer can be saved to or sent via the connected Phone. \nÃ‚Â· Multimedia Manager(Manage multimedia files) \nÃ‚Â· Multimedia Manager can modify various media files imported from your mobile phone, PC, or CD and create a new one at your will. In addition to a simple file management function, Multimedia Manager has a powerful play function so that you don't need to start a separate tool. \nÃ‚Â· Multimedia Player (Play multimedia files) \nÃ‚Â· Allows you to replay multimedia files compatible with the Phone, such as multimedia messages, moving pictures, and sounds. \nÃ‚Â· Phone Editor is a PC Studio application for easy management of such data as Phonebook, organizer and the WAP Settings of a Samsung Electronics Phone. \nÃ‚Â· The Message Manager application is provided for easy management of Samsung Electronics Phone message data, such as SMS and MMS. \nÃ‚Â· The PC Sync application allows you to synchronize personal information data between a Samsung Electronics Phone and the personal information management software of a PC. \nÃ‚Â· Phone Explorer allows you to transmit various multimedia files from a Samsung Electronics Phone to a PC or to transmit multimedia files from PC to Phone. \nÃ‚Â· Samsung PC Studio's Networking Wizard provides a Dial-up Connection function via a wizard program for Internet access. The connected Phone is used as a modem device for this purpose. \nÃ‚Â· Multimedia Manager is a multimedia file management tool provided by Samsung PC Studio, a software program connecting a Samsung mobile phone to a PC. \nÃ‚Â· Multimedia Manager has a separate player to help you enjoy images, music, and movie files. \nÃ‚Â· MMS Composer allows you to create or edit multimedia messages directly on the PC or to send a created multimedia message via the connected Phone. \n\n\n","torrent":{"xt":"urn:btih:5b2cabd14e564ba110d577a38b39701e6086ca06","amp;dn":"Samsung+PC+Studio+Pro+3.2.2+HF6","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b2cabd14e564ba110d577a38b39701e6086ca06","infoHashBuffer":{"type":"Buffer","data":[91,44,171,209,78,86,75,161,16,213,119,163,139,57,112,30,96,134,202,6]},"announce":[],"urlList":[]}}