{"title":"En el Valle de Elah DVDRIP-AC3 Spanish","uid":4698867,"size":1233602560,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5b604d7e07368ebe3ade256db054c2248b3cff7c&amp;dn=En+el+Valle+de+Elah+DVDRIP-AC3+Spanish&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"manogy","files":1,"time":1233651963,"description":"Durante su primer fin de semana de regreso, tras haber servido en Iraq, Mike Deerfield (Jonathan Tucker) desaparece y es declarado ausente sin permiso. Cuando Hank Deerfield (Tommy Lee Jones), un policÃƒÂ­a militar retirado, y su mujer Joan (Susan Sarandon) reciben la llamada telefÃƒÂ³nica comunicÃƒÂ¡ndoles la inquietante noticia, Hank sale en busca de su hijo. Emily Sanders (Charlize Theron), inspectora de policÃƒÂ­a de la zona en la que se vio a Mike por ÃƒÂºltima vez, ayuda de mala gana a Hank en la bÃƒÂºsqueda de su hijo. Aumentan las pruebas sobre el caso que parece tratarse, cada vez mÃƒÂ¡s, de un crimen y no de una desapariciÃƒÂ³n. Sanders no tardarÃƒÂ¡ en verse enfrentada a los altos mandos militares mientras intenta, a duras penas, mantener el control de la investigaciÃƒÂ³n con Hank. Pero cuando la verdad sobre el tiempo que Mike pasÃƒÂ³ en Iraq comienza finalmente a salir a la luz, todo el universo de Hank se ve cuestionado y ÃƒÂ©l se ve forzado a replantearse sus creencias para resolver la misteriosa desapariciÃƒÂ³n de su hijo.","torrent":{"xt":"urn:btih:5b604d7e07368ebe3ade256db054c2248b3cff7c","amp;dn":"En+el+Valle+de+Elah+DVDRIP-AC3+Spanish","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b604d7e07368ebe3ade256db054c2248b3cff7c","infoHashBuffer":{"type":"Buffer","data":[91,96,77,126,7,54,142,190,58,222,37,109,176,84,194,36,139,60,255,124]},"announce":[],"urlList":[]}}