{"title":"Sonny Clark - 1957 - Sonny's Crib (vinyl 24-96) FLAC","uid":8383991,"size":960101105,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5b70875eb1461c167e8d3f6741b2e1ff547403aa&amp;dn=Sonny+Clark+-+1957+-+Sonny%27s+Crib+%28vinyl+24-96%29+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"eika256","files":-1,"time":1366234743,"description":"Sonny Clark - 1957 - Sonny's Crib (vinyl 24-96)\n\nRecorded in 1957, Sonny's Crib features a front line of Curtis Fuller, Donald Byrd, and John Coltrane with Sonny Clark on piano, Art Taylor on drums, and Paul Chambers on bass. Truly still a bebop recording, done a full year before the landmark Cool Struttin' session, nonetheless the set produced some awesome readings of classic tunes, like the opener, &quot;With a Song in My Heart,&quot; with one of the knottiest Byrd solos ever. As Chambers and Taylor up the rhythmic ante and Clark comps with enormous chords in the background, the entire line solos, but it is Byrd's that is stunning in its complexity -- though Coltrane could play bebop as well as anybody. The most notable tracks on the session are the classic readings of Kurt Weill's &quot;Speak Low&quot; and &quot;News for Lulu,&quot; the latter of which has been adopted by John Zorn as his theme. On the former, Clark's rearrangement, with Coltrane leading the front line, is truly revelatory. Using a Latin rhythm in cut time, Clark sets up a long, 22-note melody line that moves right into Trane's solo. He moves the key around and harmonically shifts gears as Clark follows and stays in the pocket for him while Trane uses the middle register for legato pyrotechnics. Fuller's next and covers over the blues inherent in the tune with pure swing, before Byrd brings it back into the fold with a gorgeous counterpoint of the melody. Clark taps his way into extended harmonics on the sixths and sharpens the accents as he trounces the original key and plays double trills to get back. The latter is a smokin' Latin take on the hard bop blues, with a staggered melodic line and a large tonal palette that gives the horn players room to explore the timbral possibilities of Clark's colors -- which are revealed in the loosest, skittering skein of bluesy phrasing this side of Horace Silver in his solo. In all, Sonny's Crib is a phenomenal recording, one that opened the door to hard bop becoming the norm in the late '50s, and one that drew deft, imaginative performances from all its players. (AllMusic)\n\nTracks list:\nA - With A Song In My Heart\nB1 - Speak Low\nB2 - Come Rain Or Come Shine\nC - Sonny's Crib\nD - News For Lulu\n\nPersonnel:\nSonny Clark - piano\nDonald Byrd - trumpet\nCurtis Fuller - trombone\nJohn Coltrane - tenor saxophone\nPaul Chambers - bass\nArt Taylor - drums\n\nproduced by Alfred Lion\nrecorded by Rudy Van Gelder, Hackensack, NJ, September 1, 1957\n\nvinyl LP transfer at 24-bit 96khz\ntransfer info:\nNitty Gritty Record Master\nMusic Hall MMF 9.1\nsticky hand stylus cleaning\nGoldring 1042\nBellari VP-130 phono preamp, with vintage Telefunken 12AX7 smooth plates\nMytek Stereo192 ADC (analog to digital converter)\nTT Weights center weight, Blue Jean LC-1 interconnects\nsoftware used: Soundforge 10.0, ClickRepair 3.6.1 (in manual mode), Trader's Little Helper 2.7.0\n\nNice rip, I wish I could say it's mine but it's not.\n\nEnjoy and share! ","torrent":{"xt":"urn:btih:5b70875eb1461c167e8d3f6741b2e1ff547403aa","amp;dn":"Sonny+Clark+-+1957+-+Sonny%27s+Crib+%28vinyl+24-96%29+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b70875eb1461c167e8d3f6741b2e1ff547403aa","infoHashBuffer":{"type":"Buffer","data":[91,112,135,94,177,70,28,22,126,141,63,103,65,178,225,255,84,116,3,170]},"announce":[],"urlList":[]}}