{"title":"Claustrophobia: The Downward Struggle Alpha 1.0.3","uid":11220725,"size":42174904,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5bbcd45c3962f64d904f5a605a14f729334a55c2&amp;dn=Claustrophobia%3A+The+Downward+Struggle+Alpha+1.0.3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Lamasu","files":-1,"time":1413382326,"description":"&quot;Grab your weapon of choice, polish your Rogue senses, and get ready to be thrown into the dark and oppressing dungeons of Claustrophobia! Experience deep character development, fast-paced tactical combat, and mountains of epic loot. Here begins a roguelike quest for glory, slaughter, and anything shiny!\nClaustrophobia: The Downward Struggle is a Tactical RPG Roguelike, most heavily inspired by the combination of procedural gear and enemy generation found in games such as Diablo and Torchlight, with traditional Roguelike features found in games such as NetHack and Dungeon Crawl Stone Soup. Gameplay revolves around a classless, stat and gear-based progression system, procedural dungeon exploration, and unforgiving tactical combat.&quot;\n\nv1.0.3 changelog:\nHighlights:\n- Added the Ability to throw potions.\n- Added Wide Doorways fitted with double doors.\n- Redesigned all XP and Level Scaling (recommended to start a new game due to inconsistencies).\nGameplay:\n- Added the Ability to throw potions.\n- Added Wide Doorways fitted with double doors.\nUI:\n- Added the Option to load your last Character's appearance when creating a new Character.\n- Altered the colouring of the minimap for easier visability.\n- Leaderboard entries made before major balance changes now have an outdated tag, and will be overridden by all new entries.\n- Added a warning message that will display When attempting to load a save file that is no longer compatible with the current build.\nEnemies:\n- Elite, Champion, and Hellish enemies now have buffs to their base damage.\n- Elite, Champion, and Hellish enemies no longer have buffs to their Hit Rating.\n- Elite, Champion, and Hellish enemies awarded XP reduced.\n- Enemies with the Beserker mod's damage modifer and Dexterity reduced.\n- Squish's Base stats increased.\n- Rat-at-tack's base Damage and Modifier reduced.\n- Constitution scaling of enemies increased to 3 Constitution per level, up from 2.\nSkills:\n- Execution's base damage increased to 120% Weapon Damage, 30% Strength. In addition, Damage gained from the target's lost health increased to 120%.\nItems:\n- All potions now have effects when used on an enemy.\nStats:\n- Redesigned all XP and Level Scaling (recommended to start a new game due to inconsistencies). This change also effects leaderboard scoring.\n- Critical Damage gained from Strength reduced to 1 point every 2 Strength, down from 1 every 1 Strength.\n- Critical Chance and Critical Damage now apply diminishing returns rather than having a hard capped value.\nBug fixes:\n- Fixed Interaction inconsistancies with the Dungeon Exit.\n- Fixed a bug causing the Armour gain from Strength to be incorrect.\n- Invisible Enemies no longer show up on the minimap.\n- Invisible Enemies no longer count during any condition checks for nearby enemies.\n- Various Tooltip typos corrected.\n\nIf you like the game, support the developer, buy it!    &lt;a href=&quot;\nhttp://store.steampowered.com/app/269590/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://store.steampowered.com/app/269590/&lt;/a&gt;\n\nAs of now (15.10.2014), you can get it in this bundle:   &lt;a href=&quot;\nhttp://www.bundlestars.com/all-bundles/immortal-bundle/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.bundlestars.com/all-bundles/immortal-bundle/&lt;/a&gt;\n\nRead some guides:    &lt;a href=&quot;\nhttp://claustrophobiagame.wikia.com/wiki/Main_Page&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://claustrophobiagame.wikia.com/wiki/Main_Page&lt;/a&gt;","torrent":{"xt":"urn:btih:5bbcd45c3962f64d904f5a605a14f729334a55c2","amp;dn":"Claustrophobia%3A+The+Downward+Struggle+Alpha+1.0.3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5bbcd45c3962f64d904f5a605a14f729334a55c2","infoHashBuffer":{"type":"Buffer","data":[91,188,212,92,57,98,246,77,144,79,90,96,90,20,247,41,51,74,85,194]},"announce":[],"urlList":[]}}