{"title":"Aerosmith - Just Push Play (2001) [CD Rip] 320 vtwin88cube","uid":6185209,"size":124234319,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5cb962d258365c23994dc78a7e0806dc09f459ab&amp;dn=Aerosmith+-+Just+Push+Play+%282001%29+%5BCD+Rip%5D+320+vtwin88cube&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"vtwin88cube","files":-1,"time":1298096296,"description":"\n\nAerosmith\nJust Push Play (2001)\n\n\nAerosmith was one of the most popular hard rock bands of the '70s, setting the style and sound of hard rock and heavy metal for the next two decades with their raunchy, bluesy swagger. The Boston-based quintet found the middle ground between the menace of the Rolling Stones and the campy, sleazy flamboyance of the New York Dolls, developing a lean, dirty riff-oriented boogie that was loose and swinging and as hard as a diamond. \n\nChannels:\t\t2 (Stereo)\nSample Rate:\t\t44.1 KHz\nSample Size:\t\t16 bit\nBit Rate:\t\t320 kbps\n\nAudio Quality:\t\tVery High (Lossy)\nEncoder:\t\tLAME 3.98r\nEncoder Settings:\tConstant Bit Rate 320 kbps (Insane)\nContains:\t\tAlbum Art, ID Tag [ID3v2.3 (ANSI) &amp; ID3v1.1]\nM3U Playlist:\t\tYes\n\nFormat:\t\t\tMp3\nGenre:\t\t\tRock\nSource:\t\t\tRetail CD\n\n\nGive Aerosmith credit for not only realizing something was wrong after Nine Lives relatively flat-lined, but deciding to do something about it. Ditching the outside producers who initially liberated but eventually straitjacketed them, Steve Tyler and Joe Perry seized control of the boards, working with the assistance of Mark Hudson and Marti Frederiksen. (Forever the Stones fanatics, Tyler and Perry dubbed this crew the Boneyard Boys, just like how Mick-n-Keef are the Glimmer Twins.) So, this isn't really a full-fledged band affair and Hudson and Frederiksen's fingerprints are all over the place, but that doesn't matter since the end result is tighter, savvier, and better than anything since Pump. It's still far from perfect, however, since it suffers from a surfeit of memorable material, and the group members' steadfast refusal to act their age results in a couple of embarrassing slips into stodginess (the &quot;f*ckin' A&quot; chorus on the title track, a song improbably titled &quot;Trip Hoppin',&quot; or the ludicrous &quot;Avant Garden&quot;). These mean that the record doesn't come close to matching the twin comebacks of Permanent Vacation and Pump, but it's a sleek, classicist hard rock record that sounds good -- better than Aerosmith has sounded in nearly a decade, as a matter of fact, particularly when the group gets a hook as tuneful as that of &quot;Jaded.&quot; Aerosmith sounds good enough on Just Push Play that it almost makes you forgive the Heavy Metal refugee on the front cover, a sexy robot illustration that looks far more out of date than the music sounds. \n\n01.Beyond Beautiful\n02.Just Push Play\n03.Jaded\n04.Fly Away From Here\n05.Trip Hoppin'\n06.Sunshine\n07.Under My Skin\n08.Luv Lies\n09.Outta Your Head\n10.Drop Dead Gorgeous\n11.Light Inside\n12.Avant Garden\n\n\n\nCheers!\n","torrent":{"xt":"urn:btih:5cb962d258365c23994dc78a7e0806dc09f459ab","amp;dn":"Aerosmith+-+Just+Push+Play+%282001%29+%5BCD+Rip%5D+320+vtwin88cube","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5cb962d258365c23994dc78a7e0806dc09f459ab","infoHashBuffer":{"type":"Buffer","data":[92,185,98,210,88,54,92,35,153,77,199,138,126,8,6,220,9,244,89,171]},"announce":[],"urlList":[]}}