{"title":"In The Bedroom...DVDrip.(vice)","uid":4955127,"size":466835026,"categoryP":"video","categoryS":"handheld","magnet":"?xt=urn:btih:5ceeb75cfadb8f8178fa841499308737db34dd96&amp;dn=In+The+Bedroom...DVDrip.%28vice%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"vicerock","files":-1,"time":1245073680,"description":"IN THE BEDROOM DVDrip...PSP...IPOD..MP4\n\nThe film is set in Mid-Coast Maine. The story concerns a young man, Frank Fowler (Stahl), who is in love with an older woman with children, Natalie Strout (Tomei). Fowler is applying to graduate school for architecture but contemplating staying in town, working in the fishing industry to be near Natalie. Natalie's ex-husband, Richard Strout (Mapother) is violent and abusive.\n\nMidway through the movie Richard kills Fowler during a confrontation at Natalie's house, following a domestic dispute. Richard is set free on bail which causes Fowler's parents, Dr. Matt Fowler (Wilkinson) and Ruth Fowler (Spacek), a choir conductress, to become increasingly angry at seeing Richard running around town. Their anger increases when they learn that the lack of a direct witness to their son's shooting allows their son's killer to avoid murder charges since the district attorney may have difficulty proving that Richard killed their son intentionally, as opposed to accidental manslaughter in a struggle (as the defense would likely argue). Later, Dr. Fowler, believing that the court system cannot bring justice for his son, hatches and executes a plan with a friend to abduct and kill Richard. The title refers to the rear compartment of a lobster trap known as the &quot;bedroom&quot; and the fact that it can only hold up to two lobsters before they begin to turn on each\nother.\n\nPLEASE...SEED...AND...ENJOY...THANKS","torrent":{"xt":"urn:btih:5ceeb75cfadb8f8178fa841499308737db34dd96","amp;dn":"In+The+Bedroom...DVDrip.%28vice%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ceeb75cfadb8f8178fa841499308737db34dd96","infoHashBuffer":{"type":"Buffer","data":[92,238,183,92,250,219,143,129,120,250,132,20,153,48,135,55,219,52,221,150]},"announce":[],"urlList":[]}}