{"title":"FRANK PERETTI - 2 - Pearcing The Darkness.exe","uid":3671797,"size":89090718,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:5e7af4f7d0baccd8ee60645bcd23f72eaae27a34&amp;dn=FRANK+PERETTI+-+2+-+Pearcing+The+Darkness.exe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"USsoldier","files":1,"time":1177392386,"description":"FRANK PERETTI IS A CHRISTIAN AUTHOR OF MANY BOOKS. THIS AUDIO BOOK IS THE SECOND BOOK IN A SERIES OF 2. I LOVE THEM... PLEASE SEED &amp; ENJOY.\n\nPS - THIS DOWNLOAD IS VIRUS FREE. I PUT THE AUDIO FILES INTO A SELF-EXTRACTING FILE USING WINRAR. JUST DOUBLE CLICK AND IT WILL EXTRACT IN THE SAME FILE. - GOD BLESS!!!\n\nABOUT THE BOOK - \n\nIt follows the journey of Sally Beth Roe, a self-described &quot;leftover hippie&quot;, as she tries to escape her past and slowly overcomes her constant struggle to discern the Truth. Also told is the story of another small town, similar to that of This Present Darkness and called Bacon&amp;#039;s Corner, and a resident named Tom Harris. His kids are ripped from his home by Child Services, his job at the local Christian school is compromised, and the religious freedoms of every believer in the world are threatened in a lawsuit that could create a freedom-destroying precedent. Seeming to have no connection with other events at first, a young police officer, Ben Cole, is convinced what is being brushed off as a suicide is actually a murder, and ends up losing his job over the issue... which brings him to the side of the embattled Christian school. Caught in the crossfire is a little girl who&amp;#039;s been forced into a curriculum of &quot;meditation techniques&quot; and &quot;inner spiritual guides&quot; that control her moods, attitudes, and actions, the little Amber Brandon, and her mother Lucy who realizes this lawsuit and the people who are &quot;helping&quot; her may be much, much more than she bargained for. Before the paths that Sally Roe and Tom Harris [and the others] are on collide, the Ashton Clarion editor and his wife, Marshall and Kate Hogan (from This Present Darkness), make a return appearance as veteran fighters in this war against the powers of darkness that threaten freedom of religion everywhere. As the story unfolds, the lawsuit and its participants are soon locked in a struggle of ethics versus non-ethics, absolutes versus relativism, right versus wrong, and those with interest in this battle are shown to be even in the highest places of government.","torrent":{"xt":"urn:btih:5e7af4f7d0baccd8ee60645bcd23f72eaae27a34","amp;dn":"FRANK+PERETTI+-+2+-+Pearcing+The+Darkness.exe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e7af4f7d0baccd8ee60645bcd23f72eaae27a34","infoHashBuffer":{"type":"Buffer","data":[94,122,244,247,208,186,204,216,238,96,100,91,205,35,247,46,170,226,122,52]},"announce":[],"urlList":[]}}