{"title":"Password Manager SafeInCloud™ v8.4.2 Patched (CTRC)","uid":13191417,"size":6235076,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:5e8136bda0ff0c8a59e221eb6d4b1d84ab0b574c&amp;dn=Password+Manager+SafeInCloud%26trade%3B+v8.4.2+Patched+%28CTRC%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Lion.King","files":2,"time":1452441964,"description":"[center][img]http://i.imgur.com/DWUlPNO.png[/img][img]http://i.imgur.com/n90EHfY.png[/img]\r\n\r\n[b]Requirements:[/b] 4.1+\r\n[b]Overview:[/b] Protect your data with unique and secure passwords! Forget the headache of remembering PINs and passwords! START USING A PASSWORD MANAGER TODAY!\r\nSafeInCloud is a complete PASSWORD MANAGEMENT SOLUTION: Free Desktop Application + Mobile Application for Phones and Tablets.\r\n\r\n[b]KEY FEATURES[/b]\r\n◆ Material Design\r\n◆ Dark Theme\r\n◆ Strong Encryption (AES)\r\n◆ Cloud Synchronization (Google Drive, Dropbox, OneDrive)\r\n◆ Finger Scanner and Multi-window (Samsung devices)\r\n◆ Password Strength Analysis\r\n◆ Password Generator\r\n◆ Browser Integration\r\n◆ Cross Platform\r\n◆ Free Desktop App\r\n◆ Automatic Data Import\r\n\r\n[b]MATERIAL DESIGN[/b]\r\nSafeInCloud was completely redesigned to match new Material Design user interface language by Google. Try it yourself and enjoy an easy-to-use yet powerful user interface. In addition to the standard Light theme SafeInCloud also has a Dark theme option to help you saving a significant amount of battery life.\r\n\r\n[b]STRONG ENCRYPTION[/b]\r\nYour data is always encrypted on a device and in a cloud with a strong 256-bit Advanced Encryption Standard (AES). This algorithm is used by the U.S. Government for protection of a top secret information. AES is also widely adopted worldwide and became the de facto encryption standard.\r\n\r\n[b]CLOUD SYNCHRONIZATION[/b]\r\nYour database is automatically synchronized with your own cloud account (Google Drive, Dropbox, or OneDrive). Thus you can easily restore your entire database from a cloud to a new phone or computer (in case of a loss or an upgrade). Your phone, tablet and computer are also automatically synchronized between each other via a cloud.\r\n\r\n[b]FINGER SCANNER AND MULTI-WINDOW[/b]\r\nYou can unlock SafeInCloud with a fingerprint on Samsung devices with the finger scanner. SafeInCloud can also run in the multi-window mode, side by side with another app, e.g. a browser. So, you can drag-n-drop a login and a password to a web page with a finger or S Pen.\r\n\r\n[b]PASSWORD STRENGTH ANALYSIS[/b]\r\nSafeInCloud analyses your password strengths and shows a strength indicator next to each password. The strength indicator displays an estimated crack time for a password. All cards with weak passwords are marked with a red sign.\r\n\r\n[b]PASSWORD GENERATOR[/b]\r\nThe password generator helps you generating random and secure passwords. There is also an option to generate memorable, but still strong passwords.\r\n\r\n[b]BROWSER INTEGRATION[/b]\r\nThe Desktop application integrates with a browser. This allows you to paste passwords directly into web pages. You don't need to manually copy and paste passwords from SafeInCloud into a browser. The mobile application contains a built-in browser with a similar password auto-fill functionality.\r\n\r\n[b]CROSS PLATFORM[/b]\r\nSafeInCloud is available on the following platforms: OS X (Mac), iOS (iPhone and iPad), Windows (7 and 8), and Android.\r\n\r\n[b]FREE DESKTOP APP[/b]\r\nDownload a free Desktop application for Windows or Mac OS from http://www.safe-in-cloud.com to be able access your database on your computer. The Desktop application also makes data entry and editing fast and easy using a hardware keyboard.\r\n\r\n[b]AUTOMATIC DATA IMPORT[/b]\r\nThe Desktop application can automatically import your data from another password manager. You don't need to manually reenter all your passwords.\r\n\r\n[b]WHAT'S NEW[/b]\r\n\r\n◆ Android Wear app\r\n◆ Bug fixes\r\n\r\n\r\n[center][img]http://extraimago.com/images/2015/11/08/oPEExeG.png[/img][/center][/center]","torrent":{"xt":"urn:btih:5e8136bda0ff0c8a59e221eb6d4b1d84ab0b574c","amp;dn":"Password+Manager+SafeInCloud%26trade%3B+v8.4.2+Patched+%28CTRC%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e8136bda0ff0c8a59e221eb6d4b1d84ab0b574c","infoHashBuffer":{"type":"Buffer","data":[94,129,54,189,160,255,12,138,89,226,33,235,109,75,29,132,171,11,87,76]},"announce":[],"urlList":[]}}