{"title":"Art Blakey &amp; The Jazz Messengers - Keystone 3 (2003 Hybrid S","uid":6871283,"size":331615117,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5edbaaa9897651892e33412a0f739db0313135e4&amp;dn=Art+Blakey+%26amp%3B+The+Jazz+Messengers+-+Keystone+3+%282003+Hybrid+S&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"tiddler222","files":10,"time":1323279236,"description":"\n\nRecorded January 1982.\n\nReview by Michael G. Nastos (AMG):\nThis third live recording at San Francisco's Keystone Korner in the late '70s and early '80s of drummer Art Blakey's Jazz Messengers is significant for many reasons. It marks the final ushering out of the famous band that was fronted at times by David Schnitter, Curtis Fuller, Bobby Watson, and Valery Ponomarev, with Bill Pierce then the lone holdout. It is the first recording to include alto saxophonist Branford Marsalis (who specialized on tenor and soprano sax,) and teams him with brother Wynton Marsalis and Pierce on a formidable, compact front line. Memphis continues to be represented as Donald Brown takes over for James Williams, and New Orleans bass wizard Charles Fambrough remains. The result is an ultra-melodic band of Messengers who instrumentally sing together, swing hard, and are completely commanded by an energetic and powerful rhythm machine in Blakey, at the time in his early sixties. The show starts with a rousing version of &quot;In Walked Bud,&quot; with the front line instrumentally singing this famous melody, Wynton growling on his solo, and Branford lyrically sounding like Charlie Parker. &quot;In a Sentimental Mood&quot; is a feature for Pierce without the brothers, as Brown's chiming comping piano buoys the measured tenor sax. The next three pieces are remainders of the previous bands. &quot;Fuller Love,&quot; the Bobby Watson tribute to Curtis Fuller, is a 6/8 modal line full of energy, as biting and precise harmonic bass and horns stab with Blakey's driving rhythms all signify the best hard bop offers in modern times. &quot;Waterfall&quot; is the magnum opus of the set, as the horns ascend and descend dynamically in perfect in and out changes, Wynton's solo double-timed to bop pace the highlight. &quot;A La Mode&quot; is the famous composition of Fuller's played to exacting specs in hushed tones with Brown perfectly shadowing the horns, while Blakey dominates and commands the troops in building tension, then halting them at will. Of the many live recordings with different Jazz Messengers lineups, this ranks among their best, and is a springboard for what the Marsalis brothers would offer as artists in their own right. With Blakey, this combination was special.\n\nWynton Marsalis - Trumpet\nBranford Marsalis - Alto\nBill Pierce - Tenor\nDonald Brown - Piano\nCharles Fambrough - Bass\nArt Blakey - Drums\n\n01. In Walked Bud    \n02. In A Sentimental Mood   \n03. Fuller Love   \n04. Waterfalls    \n05. A La Mode\n\n ","torrent":{"xt":"urn:btih:5edbaaa9897651892e33412a0f739db0313135e4","amp;dn":"Art+Blakey+%26amp%3B+The+Jazz+Messengers+-+Keystone+3+%282003+Hybrid+S","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5edbaaa9897651892e33412a0f739db0313135e4","infoHashBuffer":{"type":"Buffer","data":[94,219,170,169,137,118,81,137,46,51,65,42,15,115,157,176,49,49,53,228]},"announce":[],"urlList":[]}}