{"title":"Fraps 3.2.7 Retail-[HB]","uid":6148596,"size":2805173,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5fc9ad59f60c188e16c98f421f33082d0647d06b&amp;dn=Fraps+3.2.7+Retail-%5BHB%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"[HB]","files":-1,"time":1296788717,"description":"+-----------------------+\n|Fraps 3.2.7 Retail-[HB]|\n+-----------------------+\n\nFraps - a program designed to count the number of FPS (frames per second) in the applications running in OpenGL and Direct3D. The utility is able to take screenshots and record video with the image on the screen. This is a universal Windows application that can work with all games using DirectX technology or OpenGL. Manage the program can not exit the game, with the help of hot keys. Above all, in advance, make sure that the keyboard shortcuts Fraps does not coincide with the keys used in the game. With Fraps can capture the best moments not only in the form of single frames, but in motion with sound. Users can see the statistics of the parameter frames per second, recorded it in a file, or display the counter in one corner of the screen. Your screen captures are automatically named and timestamped.\n\n+-----------+\n|Basic Fraps|\n+-----------+\n\n- Testirovanie performance - displays the number of frames per second (FPS), can measure the performance between the two points during the game;\n\n- A tool for capturing images - allows you to capture a single frame in 3D applications (by pressing a hot key), which are automatically stored in the selected folder;\n\n- Capture video in real time - enables you to record video at resolutions up to 1152x864 and 100 frames per second. \n\n+---------------------+\n|3.2.7 - 19th Jan 2011|\n+---------------------+\n\n- Fixed large pause between split AVI segments\n\n- Fixed stuttering when using loop recording on Vista/Win7\n\n- Other minor bug fixes\n","torrent":{"xt":"urn:btih:5fc9ad59f60c188e16c98f421f33082d0647d06b","amp;dn":"Fraps+3.2.7+Retail-%5BHB%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5fc9ad59f60c188e16c98f421f33082d0647d06b","infoHashBuffer":{"type":"Buffer","data":[95,201,173,89,246,12,24,142,22,201,143,66,31,51,8,45,6,71,208,107]},"announce":[],"urlList":[]}}