{"title":"Total Recorder Editor 10.9.8(with serial)","uid":4262645,"size":10855425,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:61251a11340e55c17c3ce1b61df41390f5c22a1a&amp;dn=+Total+Recorder+Editor+10.9.8%28with+serial%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"aoloffline","files":1,"time":1214542856,"description":"# Record any sound\nTotal Recorder Editor can record any sound passing through any line of your sound card. For example, you can record sound being played back by an external program, sound from a microphone, an external LP, cassette, CD/DVD player, AM/FM/Satellite radio, etc.\n\n# Built-in sound editor\nA built-in sound editor allows you to cut, trim, and merge your recordings. Editing can be performed using a visual representation of the sound and using clipboard operations. Supports all major audio formats.\n\n# Built-in CD ripper and CD Burner\nYou can also use the build-in CD ripper to copy all or some of your music tracks from your personal CD collection.\nVersion 8.2 adds a burner, you can now burn your own audio CDs that can be played back on PC&amp;Home CD player from your recordings. \n\nWith Total Recorder Editor you can:\n\tOpen, create, and save audio files in any of the supported formats (can also save any portion of a loaded file to disk as a new file);\n\tDisplay audio data waveform (Zoom Full, Zoom In, Zoom Out, Zoom Vertical);\n\tPlay audio files or any portion of the files (Play, Pause, Stop);\n\tRecord audio from a microphone or any other available input device and save directly to WAV, MP3, WMA, OGG, etc. files;\n\tEdit audio files visually (Cut, Copy, Delete Selection, Delete Silence, Paste, Paste From File, Mix, Mix From File);\n\tApply various effects (Amplify, Compressor, Delay, Equalize, Fade In and Fade Out, Flanger, Invert, Normalize, Phaser, Reverb, Reverse, Silence, Shrink, Stretch, Vibrato, etc.);\n\tBurn audio CDs from MP3, WMA, WAV, and OGG. The audio CD burner feature is very powerful, yet easy to use.\n\tApply different filters to any selected portion of audio files;\n\tPerform two-way conversions among CD, WAV, MP3, WMA, OGG, and much more!\nWhy choose Total Recorder Editor?\nI. \tSo easy to use that only a few clicks are enough to record and editor sound;\nII. \tThe editor auto-detects your CPU. Audio editing will be done at the best speed;\nIII. \tSupport all popular audio formats;\nIV. \tCD Burner are built-in;\nV. \tOutput format settings are all adjustable.\n\nSystem Requirements\nOS Supported: \tWindows 98/ME/NT4/2000/2003/XP and Windows Vista\n# Hardware: \tIntel Pentium II 350MHz or above, or any Athlon\n# 64 MB RAM or above ","torrent":{"xt":"urn:btih:61251a11340e55c17c3ce1b61df41390f5c22a1a","amp;dn":"+Total+Recorder+Editor+10.9.8%28with+serial%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61251a11340e55c17c3ce1b61df41390f5c22a1a","infoHashBuffer":{"type":"Buffer","data":[97,37,26,17,52,14,85,193,124,60,225,182,29,244,19,144,245,194,42,26]},"announce":[],"urlList":[]}}