{"title":"A. Scott Berg - Lindbergh, abridged (rip-oop)","uid":9734897,"size":251892071,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:6146d7f22adf7df6385f035a3f4f725d862fa803&amp;dn=A.+Scott+Berg+-+Lindbergh%2C+abridged+%28rip-oop%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rip-oop","files":6,"time":1394431308,"description":"Author: A Scott Berg\nTitle: Lindbergh (Abridged)\nNarrator: Eric Stoltz\nPublisher: Random House, ISBN 0375404945\nYear: 1998\nFormat: MP3 96 kbit/s, 44,100 hz recorded from cassette tape via AGPTek August 2013\n\n\nFrom one of America's most acclaimed biographers, here at last is the definitive life of one of the most legendary, controversial, and enigmatic figures in American history - Charles A. Lindbergh.\n\nNational Book Award winner A. Scott Berg is the first and only writer to have been given unrestricted access to the massive Lindbergh archives - more than two thousand boxes of personal papers, including reams of unpublished letters and diaries - and to be allowed to freely interview Lindbergh's friends, colleagues, and family members, including his children and his widow, Anne Morrow Lindbergh.  The result is a brilliant biography that clarifies a life long blurred by myth and half-truth.\n\nFrom the moment he landed in Paris on May 21, 1927, Lindbergh found himself thrust upon an odyssey for which he was ill prepared - the first modern media superstar, defied and demonized many times over in a single lifetime.  Berg casts dramatic new light on Lindbergh's childhood; his astonishing flight; the kidnapping of his son, which has been called &quot;The Crime of the Century;&quot; Lindbergh's fascination with Hitler's Germany; and his unsung work in his later years.\n\nIn all, this is a most compelling story of a most significant life: the most private of public figures finally revealed with a sweep and detail never before possible.  This is at once Lindbergh the hero and Lindbergh the man.","torrent":{"xt":"urn:btih:6146d7f22adf7df6385f035a3f4f725d862fa803","amp;dn":"A.+Scott+Berg+-+Lindbergh%2C+abridged+%28rip-oop%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6146d7f22adf7df6385f035a3f4f725d862fa803","infoHashBuffer":{"type":"Buffer","data":[97,70,215,242,42,223,125,246,56,95,3,90,63,79,114,93,134,47,168,3]},"announce":[],"urlList":[]}}