{"title":"Prison Architect - Alpha 7 (Mac)","uid":8178164,"size":94120626,"categoryP":"games","categoryS":"mac","magnet":"?xt=urn:btih:61d95e99da0e31d20021f548cb3da84ade6fb015&amp;dn=Prison+Architect+-+Alpha+7+%28Mac%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Dwarth","files":1,"time":1361570480,"description":"&quot;We've fulfilled the name in game and face in game tiers so some prisoners are now personalised. Guards are now the only characters that can open doors. This sounds small, but makes a massive difference to the gameplay. You now have to think a lot more about how many guards to use and where to deploy them. There's also a graphics option menu that should keep a lot of you happy!\n\n\n= Name-in-the-game / Face-in-the-game\nThe community database of personalised Names and Faces has been imported into the game\nYou can view the full database from the main menu option &quot;Names in the game&quot;\nAround 30% of all randomly generated prisoners will now include a custom name and bio taken from this database\nYou can manually transfer any prisoner from this list into your jail - they will arrive in the 8am delivery\n\n= Only Guards can open doors\nAll locked doors must now be opened by Guards using their keys. Prisoners and staff must wait to be let in.\nThe exception is the doors on each jail Cell, which open automatically when the prisoner should be let out\nOffice doors are never locked - anyone can pass through at any time\nYou can right click on any door to open it manually\nDoors can be blocked open but will gradually push blocking objects aside until they close\n\n= Alarm buttons\nUnder 'Emergencies' there are two new &quot;alarm&quot; buttons:\nLOCKDOWN immediately closes and locks all the doors in the prison\nGuards will not open doors for anyone. However they will unlock doors on their way if you move them somewhere\nBANGUP instructs all prisoners to return immediately to their cell (confusingly, this was called Lockdown in alpha6)\nPrisoners will obviously ignore this alarm if they are misbehaving\n\n= Game Options menu\nFrom the main menu you can now access an 'Options' menu to control the application settings\nUnder GRAPHICS You can control the screen resolution, fullscreen/windowed setting and filtering mode\n- Multisampling uses fullscreen anti-aliasing (4xMSAA) to improve the sprite render quality\n- Supersampling renders everything at double resolution then downscales to your screen\nBoth improve the game visuals at the cost of reduced performance\nThere are also options for Sound, Game etc\n\n- You can now press F11 at any time to toggle fullscreen\n\n- You can press ctrl-p at any time to save a screenshot \n\n- The game will no longer crash on launch if your previous save game was corrupted. \nWe have disabled autoload of previous saved games for now, until we can fix some loading issues.\n(The game now launches with a new empty sandbox)\n\n- Prisoners can now be re-categorised (Max/normal/Min) from their rap sheet\n\n- All research times have been halved\n\n- Fixed: Building lots of fences whilst paused caused endless delivery of empty boxes\n\n- Fixed: Prisoners were no longer bothering to run around the yard whilst exercising\n\n- Fixed: The main build toolbar was sometimes scaled wrongly at certain resolutions, \nleading to an annoying scrollbar in the lists of objects/rooms etc\n\n- Performance improvements:\nFixed a major performance bug in the renderer, causing occasional extreme frame lag\nMany parts of the render system have been optimised - some visual glitches may occur in entity animations&quot;\t","torrent":{"xt":"urn:btih:61d95e99da0e31d20021f548cb3da84ade6fb015","amp;dn":"Prison+Architect+-+Alpha+7+%28Mac%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61d95e99da0e31d20021f548cb3da84ade6fb015","infoHashBuffer":{"type":"Buffer","data":[97,217,94,153,218,14,49,210,0,33,245,72,203,61,168,74,222,111,176,21]},"announce":[],"urlList":[]}}