{"title":"Transformations 1 &amp; 2 - A Documentary(Christian documentary)","uid":5487858,"size":1367342741,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:61f0f6a94ea200a7c2a7cb3cc432c03abf85a99e&amp;dn=Transformations+1+%26+2+-+A+Documentary%28Christian+documentary%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ab3br","files":2,"time":1270827485,"description":"Transformations I and II\nVideos that incite entire communities, churches, small groups, or families to \nconcentrated prayer for their area are rare. George Otis Jr. of The Sentinel Group is \ntrying to change that by offering two excellent documentaries: \n&quot;Transformations&quot; (1999) and &quot;Transformations II&quot; (2001).\n\n\nIn &quot;Transformations I&quot;, we are introduced to a community in Central America \nwhere 92 percent of the population is now born-again, forcing the closure \nof city jails and an amazing abundance of fruits and vegetables. Then we learn \nabout a powerful movement in Cali, Colombia (home to the Cali drug cartel) where \n60,000 Christians join together every 90 days for all-night prayer rallies, causing \nthe spiritual tide of the entire city to turn toward Christ. Residents of Hemet, \nCalifornia tell about their spiritual breakthroughs, while churches in a town in Kenya, \nan area once known for its illicit crime, praise God for the power He has reigned down upon their community.\n\nIn &quot;Transformations II&quot;, we meet native tribal members from Canada's northern shores, \nwhere a suicide rate 20 times the national average (not to mention the pandemic of alcoholism, \ndrug use, and physical and sexual abuse directed toward nearly every female) has given way to a \nnew hope in not only one settlement, but many throughout the entire region! Scottish residents \nin one community tell of the amazing happenings as scores of people held all-night prayer meetings \nin their barns and homes, leading to a fresh move of God upon their land, emptying local pubs and \nleaving the once-scarcely visited churches packed to overflowing.\n\nAnother story takes us to Uganda where military coups and dictatorial leadership, \nas well as blatant Satanic worship, has ravaged this east African country for more \nthan four decades since Idi Amin made infamous worldwide headlines for the genocide \nhe caused. But now, seeking God passionately, this nation has officially dedicated \nitself to God during a celebration at the turn of the millennium. Now the economy, \nseeing all indications of collapse, is one of the three best on the African continent. \nThe government has been seeking God's will, even instituting an official &quot;ethics and morality&quot; \npost that has instituted a &quot;zero tolerance&quot; policy on corruption. God has heard the prayers of his people.\n\n\nThese Videos have dutch subtitles hard encoded and couldn't be turned off.\nNevertheless it's worth watching!\n\nAfter plz Seed as long as you can........just dont watch these movies for ENTERTAINMENT  but take a lesson of how to change your community...\n\nUploaded by Abraham","torrent":{"xt":"urn:btih:61f0f6a94ea200a7c2a7cb3cc432c03abf85a99e","amp;dn":"Transformations+1+%26+2+-+A+Documentary%28Christian+documentary%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61f0f6a94ea200a7c2a7cb3cc432c03abf85a99e","infoHashBuffer":{"type":"Buffer","data":[97,240,246,169,78,162,0,167,194,167,203,60,196,50,192,58,191,133,169,158]},"announce":[],"urlList":[]}}