{"title":"Notorious 1946 DVDRip Sonata Premiere","uid":8873465,"size":734259515,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6271d36fd9f87e554797ae4600fdf2ffd4383c6d&amp;dn=Notorious+1946+DVDRip+Sonata+Premiere&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"klinho","files":2,"time":1378131564,"description":"Though Alfred Hitchcock's Notorious was produced by David O. Selznick's Vanguard Films, Selznick himself had little to do with the production, which undoubtedly pleased the highly independent Hitchcock. Ingrid Bergman plays Alicia Huberman, who goes to hell in a handbasket after her father, an accused WWII traitor, commits suicide. American secret agent Devlin (Cary Grant) is ordered to enlist the libidinous Alicia's aid in trapping Alexander Sebastian (Claude Rains), the head of a Brazilian neo-Nazi group. Openly contemptuous of Alicia despite her loyalty to the American cause, Devlin calmly instructs her to woo and wed Sebastian, so that that good guys will have an &quot;inside woman&quot; to monitor the Nazi chieftain's activities. It is only after Alicia and Sebastian are married that Devlin admits to himself that he's fallen in love with her. The &quot;MacGuffin&quot; in this case is a cache of uranium ore, hidden somewhere on Sebastian's estate. Upon discovering that his wife is a spy, Sebastian balks at eliminating her until ordered to do so by his virago of a mother (Madame Konstantin). Tension mounts to a fever pitch as Devlin, a day late and several dollars short, strives to rescue Alicia from Sebastian's homicidal designs. Of the several standout sequences, the film's highlight is an extended love scene between Alicia and Devlin, which manages to ignite the screen while still remaining scrupulously within the edicts of the Production Code. In later years, Hitchcock never tired of relating the story of how he and screenwriter Ben Hecht (who was nominated for an Oscar) fell under the scrutiny of the FBI after electing to use uranium as a plot device -- this before the bombing of Hiroshima and Nagasaki. A huge moneymaker for everyone concerned, Notorious is considered one of Hitchcock's best espionage melodramas. ","torrent":{"xt":"urn:btih:6271d36fd9f87e554797ae4600fdf2ffd4383c6d","amp;dn":"Notorious+1946+DVDRip+Sonata+Premiere","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6271d36fd9f87e554797ae4600fdf2ffd4383c6d","infoHashBuffer":{"type":"Buffer","data":[98,113,211,111,217,248,126,85,71,151,174,70,0,253,242,255,212,56,60,109]},"announce":[],"urlList":[]}}