{"title":"Tony Bennett - 2004 - The Complete Improv Recordings FLAC","uid":8966129,"size":1316184279,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:627516d45d60120f28a7161b7f97b411575d37be&amp;dn=Tony+Bennett+-+2004+-+The+Complete+Improv+Recordings+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"eika256","files":-1,"time":1380225328,"description":"Tony Bennett - 2004 - The Complete Improv Recordings\n\nFor those new to the music of Tony Bennett, Improv was a label started by Tony Bennett and businessman Bill Hassett. Bennett was fed up with the suits at Columbia Records, who were trying to make him sing rock &amp; roll. When his contract expired at the beginning of the 1970s, he and Hassett formed a label to help him realize his aesthetic ambitions, and Improv was born. Bennett recorded five albums for the label between 1975 and 1977 before it went bankrupt. These recordings may not have sold well -- due largely to distribution problems -- but all of them were critically acclaimed. On these sides, Bennett is in awesome company throughout, with talent ranging from Bill Evans and Earl Hines to Ruby Braff to Marian McPartland to Buddy Tate and Charlie Byrd. The albums included here are Tony Bennett Sings 10 Rodgers and Hart Songs, Tony Bennett Sings More Great Rodgers &amp; Hart, Tony Bennett and Bill Evans Together Again (this was the follow-up to the Fantasy set entitled The Tony Bennett/Bill Evans Album and is easily the better of the two), Life Is Beautiful, and Tony Bennett With the McPartlands and Friends Make Magnificent Music. While the original albums have been issued on CD before, complete sessions have never been available until now. Along with the original LPs are unissued alternate takes, 45s, and even an unreleased tune finished for a particular session but never used. In addition, the album with the McPartlands is here on compact disc for the first time. It should also be noted that this box finally completes the two different Tony Bennett and Bill Evans Together Again CD issues that were released on Rhino and Concord with different material. Collectors will find the box irresistible as much for its fine, if simple, presentation as for the material itself. The liner essay by jazz writer Will Friewald is not only informative about the period and the label, but is exhaustive in its discussion of the recording sessions. This is a reasonably priced multi-disc collection that offers an intimate, up-close view of a restlessly original artist during the biggest gamble of his professional career. (AllMusic)\n\nPersonnel : Tony Bennett- vocals; Torrie Zito, Bill Evans, Marian McPartland- piano; John Giuffrida, Brian Torff- bass; Chuck Hughes, George Reed, Joe Cocuzzo- drums; George Barnes, Wayne Wright, Charlie Byrd- guitar; Ruby Braff- cornet; Jimmy McPartland- cornet, trumpet; Vic Dickenson- trombone; Herb Hall- clarinet; Spider Martin- alto saxophone; Buddy Tate- tenor saxophone; Orchestra- conducted by Torrie Zito.\n\nEnjoy and share! ","torrent":{"xt":"urn:btih:627516d45d60120f28a7161b7f97b411575d37be","amp;dn":"Tony+Bennett+-+2004+-+The+Complete+Improv+Recordings+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"627516d45d60120f28a7161b7f97b411575d37be","infoHashBuffer":{"type":"Buffer","data":[98,117,22,212,93,96,18,15,40,167,22,27,127,151,180,17,87,93,55,190]},"announce":[],"urlList":[]}}