{"title":"The House on 56th Street (1933) Xvid 1cd [DDR]","uid":9249268,"size":734349312,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:62c4ca6b689e51bfcb549b4e085fb6fdd4885b84&amp;dn=The+House+on+56th+Street+%281933%29+Xvid+1cd+%5BDDR%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"SaM","files":-1,"time":1385436507,"description":"The House on 56th Street (1933) Xvid 1cd [DDR]\n\nTHE HOUSE ON 56TH STREET, based on a novel by Joseph Santley; directed by Robert Florey; a Warner Brothers Production. At the Hollywood.\nThe House on 56th Street is a 1933 drama film starring Kay Francis as a woman sent to prison for twenty years for a murder she did not commit. When she is released, her husband is dead and her daughter has been told she is too.\n\n    CAST:-\n    Kay Francis...............Peggy Martin Van Tyle / Peggy Stone\n    Ricardo Cortez........ Bill Blaine\n    Gene Raymond........Monte Van Tyle \n    John Halliday .......... Lyndon Fiske\n    Margaret Lindsay ... Eleanor Van Tyle Burgess\n    Frank McHugh..........Chester Hunt\n    William Boyd.............Mr. Bonelli \n    Hardie Albright..........Henry Burgess\n    Sheila Terry................Dolly\n    Phillip Reed...............Freddy\n    Philip Faversham.....Gordon\n    Walter Walker............Dr. Wyman\n    Nella Walker..............Eleanor Van Tyle\n\n    Directed by Robert Florey\n    Written by Joseph Santley (story), Austin Parker, Sheridan Gibney\n\nMOVIE REVIEW:- he House on 56th Street (1933)\nKay Francis is the leading player in &quot;The House on 56th Street,&quot; which is quite an original and intriguing pictorial drama. The actual story is secondary to the interesting idea of depicting what happens to a dwelling in the East Fifties in the course of a quarter of a century. The narrative is an adaptation of a novel written by Joseph Santley, and the introductory scenes in the film show life in the pre-automobile era.\n\nThe house in East Fifty-sixth Street is presumed to be a gift from Monte Van Tyle to his bride, Peggy, who was one of the alluring members of the &quot;Florodora&quot; sextet. On their honeymoon they visit France, Italy and other countries, and when they return Monte takes great pride in escorting his pretty wife through her spacious new home. Being blessed with an enviable bank account, Monte has anticipated every wish of his wife. It is a home which shall be hers as long as she lives.\n\nThe happy existence of the Van Tyles is brought to an abrupt ending when Lindon Fiske, Peggy's companion before she was married, decides to shoot himself. Peggy goes to visit him because he is ill, and, although she struggles with her former paramour to prevent his ending his life, the pistol shot is fired and he drops dead. This leads to her conviction and sentence to prison for manslaughter.\n\nAfter nearly twenty years Peggy is freed. Her husband has been killed in the World War and his relatives give her a substantial check to keep away from her daughter, Eleanor. Peggy, being by nature a gambler, in the course of time finds herself back in the Fifty-sixth Street house, not as a tenant but as a blackjack dealer, for the dwelling has been turned into a gambling place and speak-easy. How she is forced to remain there and what further tragic happenings she experiences are set forth in several exciting episodes.\n\nIt is a film possessing no little irony, particularly in the latter interludes. Peggy's first sight of her daughter in many years is depicted very effectively. Miss Francis, as Peggy, gives an adequate performance. She looks charming in the costumes of the Nineties. Margaret Lindsay is excellent as Eleanor. Gene Raymond is satisfactory as Monte Van Tyle, and John Halliday's acting of Lindon Fiske is highly commendable. Ricardo Cortez gives an expert conception of a cardsharp and William Boyd does well as a grim underworld authority.\n\nSprawling chronicle of 25 years in the life of a house, as Francis spends two decades in jail for a crime she didn't commit. The residence is now a speakeasy/gambling joint, where Francis returns to save her daughter from the same situation she was in. Offbeat but nothing special.\n\nTECHNICAL SPECIFICATIONS\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 855 kbps\nVideo Resolution: 640x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 23.976\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages: English\nRunTime 1:09:00\nSubtitles: None\nRipped by: Trinidad [DDR]\nDuration: 1:09:0","torrent":{"xt":"urn:btih:62c4ca6b689e51bfcb549b4e085fb6fdd4885b84","amp;dn":"The+House+on+56th+Street+%281933%29+Xvid+1cd+%5BDDR%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62c4ca6b689e51bfcb549b4e085fb6fdd4885b84","infoHashBuffer":{"type":"Buffer","data":[98,196,202,107,104,158,81,191,203,84,155,78,8,95,182,253,212,136,91,132]},"announce":[],"urlList":[]}}