{"title":"Kelly Joe Phelps - Brother Sinner and The Whale 2012","uid":8164850,"size":213335003,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:62ea37c90648654de6c978a4447d25dac4deec93&amp;dn=Kelly+Joe+Phelps+-+Brother+Sinner+and+The+Whale+2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"barber9","files":-1,"time":1361314119,"description":"Recorded in mono with only his voice and guitar, the songs are - mostly - based on themes from the book of Jonah in the bible's Old Testament. Phelps has referenced and played old gospel songs throughout his career. In fact, there is a new reading of the traditional I've Been Converted, which appeared on his debut album Lead Me On. But it's the originals, all rooted in country and blues gospel, that embrace with unflinching honesty a return to Phelps' evangelical roots, but he's older, wiser, repentant. His bottleneck slide playing and fingerpicking finesse are deft and fluid as ever. His writing is tight, full of solid melodies, beautiful couplets, biblical poetry, and lithe passages where lyrics and guitars blur and intertwine seamlessly. Check the slide blues opener Talkin' to Jehova, where each sung line is trailed by intricate, steely fills that feed the next one. The weary Hard Times They Never Go Away, reflects Doc Watson's ten-fingered folk-gospel style, but the lyrics and the instrumental interludes are pure Phelps, steeped in his brand of restless soul. His protagonist is out on the edge of the world, looking toward and longing for home. Speaking of instrumentals, there are two choice ones here: the gritty slide blues Spit Me Outta the Whale, and the National Steel guitar-fueled closer, Brother Pilgrim. The latter showcases his dazzling fingerstyle playing. No matter your spiritual beliefs, it's difficult to fault Phelps for such a warm, inviting, and brave recording. If conviction and quality are the measure of a songwriter and musician, the songs and performances on Brother Sinner &amp; the Whale are the very measure of both. (allmusic.com)\n\n- - -\n\nKelly Joe Phelps - Brother Sinner and The Whale 2012\n(Black Hen Music)\n\n 1. Talkin to Jehova\n 2. Goodbye to Sorrow\n 3. Hope in the Lord to Provide\n 4. Pilgrims Reach\n 5. Spit Me Outta the Whale\n 6. Sometimes a Drifter\n 7. Hard Time They Never Go Away\n 8. Ive Been Converted\n 9. The Holy Spirit Flood\n10. Down to the Praying Ground\n11. Guide Me, O Thou Great Jehova\n12. Brother Pilgrim\n","torrent":{"xt":"urn:btih:62ea37c90648654de6c978a4447d25dac4deec93","amp;dn":"Kelly+Joe+Phelps+-+Brother+Sinner+and+The+Whale+2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62ea37c90648654de6c978a4447d25dac4deec93","infoHashBuffer":{"type":"Buffer","data":[98,234,55,201,6,72,101,77,230,201,120,164,68,125,37,218,196,222,236,147]},"announce":[],"urlList":[]}}