{"title":"After the Last Man by Toivo Koivukoski","uid":10360824,"size":1115793,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6337f59b91d118e787b65ec0826ec22ec66dc1df&amp;dn=After+the+Last+Man+by+Toivo+Koivukoski&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"PirateBook","files":1,"time":1402803148,"description":"\nAfter the Last Man: Excurses to the Limits of the Technological System by Toivo Koivukoski\n\n\nIn this unique, enlightening monograph, Toivo Koivukoski explores the circumstances that have led modern society to use the concept of progress as a surrogate cosmology that gives individuals a sense of place and purpose. By linking various historical paradigms from German Idealist philosophy to contemporary philosophies of technology, this work of political theory describes an alternative, immanent pattern of development that is, in a sense, driven by its own unintended consequences. \n\nThe meditations outlined within this book map out the hypertext pathways of our global system, making its constitutive relations and underlying thought processes transparent. Koivukoski mirrors the new hyper-realities of electronic communications technologies by structuring the text in compact subchapters that are linked through an index of subjects that allows readers to &quot;find their own philosophy&quot; by jumping to areas of interest. \n\nIf, as he argues, history understood in a linear, lockstep fashion is over, then the ways of developing concepts should change respectively so that the sorts of retrievals, anticipations, loops, and leaps that characterize nonlinear, networked thinking are consciously realized in an identity of form and substance.\n\nGenre: Non Fiction, History ","torrent":{"xt":"urn:btih:6337f59b91d118e787b65ec0826ec22ec66dc1df","amp;dn":"After+the+Last+Man+by+Toivo+Koivukoski","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6337f59b91d118e787b65ec0826ec22ec66dc1df","infoHashBuffer":{"type":"Buffer","data":[99,55,245,155,145,209,24,231,135,182,94,192,130,110,194,46,198,109,193,223]},"announce":[],"urlList":[]}}