{"title":"The Safari Companion - A Guide to Watching African Mammals Inclu","uid":8923127,"size":31182600,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:640b7108bc100aab7d13b056f05f529dfba34c1a&amp;dn=The+Safari+Companion+-+A+Guide+to+Watching+African+Mammals+Inclu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"livhre","files":-1,"time":1379303642,"description":"Since its original publication in 1993, The Safari Companion has been the best field guide to observing and understanding the behavior of African mammals. An indispensable tool for naturalists traveling to Africa, this new edition has been revised to acknowledge the enthusiasm to those watching these magnificent animals at zoos and wildlife parks, and on film.\n\nThe Safari Companion enables readers to recognize and interpret visible behavioral activities, such as courtship rituals, territorial marking, aggression, and care of young. Each account of over 80 species includes a behavioral table in which the unique actions of the hoofed mammals, carnivores, and primates are described for easy reference. In addition, useful maps show the major national boundaries, vegetation zones, and game parks relevant to the guide. The book includes an extensive glossary, as well as tips on wildlife photography, a list of organizations working to protect African wildlife, and advice on where and when to see the animals","torrent":{"xt":"urn:btih:640b7108bc100aab7d13b056f05f529dfba34c1a","amp;dn":"The+Safari+Companion+-+A+Guide+to+Watching+African+Mammals+Inclu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"640b7108bc100aab7d13b056f05f529dfba34c1a","infoHashBuffer":{"type":"Buffer","data":[100,11,113,8,188,16,10,171,125,19,176,86,240,95,82,157,251,163,76,26]},"announce":[],"urlList":[]}}