{"title":"Masaki Adachi - Zoo (2005)","uid":4510449,"size":1468105911,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6415106eb47e1622ce4ae25c91358c8b15f51da0&amp;dn=Masaki+Adachi+-+Zoo+%282005%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gsu02","files":2,"time":1226759135,"description":"\tIMDb review:\n\nI have nothing bad to really say about this movie.  2 hours, five tales, kick ass movie.  A relatively unknown one from Japan for reasons that escape me.  If you like anthology movies or Japanese films, you should REALLY give this one a try as its quite interesting.  But, as usual, I&amp;#039;ll back up my opinion with one from IMDB:\n\nZoo is several tales of the macabre, for want of a better description, and is at times quite good and others merely adequate. In the first story twin sisters who are treated very differently by their mother switch places with interesting results. In another segment a group of people are held in windowless chambers awaiting death by a psychotic killer, and a young boy who has been captured with his sister moves from chamber to chamber through a narrow canal to visit with each captive to find out what&amp;#039;s going on. In another segment a man and his girlfriend stop at an abandoned zoo on a whim and he ends up killing her when she wants to break up with him, only to return every day to take a picture of her as she decomposes. This is apparently made for Japanese TV and yet it doesn&amp;#039;t have the cheap &quot;shot on video&quot; look of many of these sort of anthologies, and the stories are actually quite good and well thought out. Definitely has its moments of creepiness and yet a good dose of humanity too, no matter how ugly at times. 7 out of 10, well worth seeing for fans of Asian films. ","torrent":{"xt":"urn:btih:6415106eb47e1622ce4ae25c91358c8b15f51da0","amp;dn":"Masaki+Adachi+-+Zoo+%282005%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6415106eb47e1622ce4ae25c91358c8b15f51da0","infoHashBuffer":{"type":"Buffer","data":[100,21,16,110,180,126,22,34,206,74,226,92,145,53,140,139,21,245,29,160]},"announce":[],"urlList":[]}}