{"title":"The CSS Anthology: 101 Essential Tips, Tricks &amp; Hacks","uid":4718324,"size":13464840,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:65306a67a68563176c633fa4afaf534b38f6f45e&amp;dn=The+CSS+Anthology%3A+101+Essential+Tips%2C+Tricks+%26+Hacks&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"VasiaZozulia","files":1,"time":1234387285,"description":"A practical guide on CSS (Cascading Style Sheets) for professionals and novices, that can be used both as a tutorial and read cover-to-cover, or as a handy and practical reference book to common problems, s and effects. The 2nd edition is now full-color throughout and is completely updated and revised with the latest tips &amp; tricks covering everything from CSS layouts to rounded corners and tabbed navigation systems.\n\nThe CSS Anthology: 101 Essential Tips, Tricks &amp; Hacks is a compilation of best practice solutions to the most challenging CSS problems. The second edition of this best-selling book, now in full color, has been completely revised and updated to cover the latest techniques and newer browsers, including Firefox 2 and Internet Explorer 7. \n\nIt's the most complete question-and-answer book on CSS, with over 100 tutorials that'll show you how to gain more control over the appearance of your web page, create sophisticated Web page navigation controls, design for today's alternative browsing devices including phones and screen readers, and much more. \n\nThe CSS code used to create each of the components is available for download and guaranteed to be simple, efficient and cross-browser compatible. \n\nThis book will show you how to:\nConstruct robust CSS layouts that work every time. \nCreate sleek drop-down menus using only CSS. \nBuild a professional tabbed navigation system. \nReplace image-based navigation with low-fat CSS lists. \nDesign smarter, more usable CSS-flavored web forms. \nUse rounded corners minus the bloated HTML. \nAllow your visitors to select their preferred look and feel. \nLet the W3C validator do your debugging. \nReduce the burden of site maintenance and updates. \n... along with 92 other solutions to common questions and problems. \n\nContents:\nChapter 1. Getting Started with CSS\nChapter 2. Text Styling and Other Basics\nChapter 3. CSS and Images\nChapter 4. Navigation\nChapter 5. Tabular Data\nChapter 6. Forms and User Interfaces\nChapter 7. Cross-browser Techniques\nChapter 8. Accessibility and Alternative Devices\nChapter 9. CSS Positioning and Layout\n\nThe CSS Anthology: 101 Essential Tips, Tricks &amp; Hacks is ideal for Web designers who would like to add sparkle to their existing designs, as well as newcomers who want to become true CSS masters. \n\nThe book can be read cover to cover, or referred to like a cookbook with 101 different recipies for your Website. It's written in an easy-to-follow, consistent format that's well illustrated with plenty of full color screenshots and code examples, providing quick visual cues.","torrent":{"xt":"urn:btih:65306a67a68563176c633fa4afaf534b38f6f45e","amp;dn":"The+CSS+Anthology%3A+101+Essential+Tips%2C+Tricks+%26+Hacks","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"65306a67a68563176c633fa4afaf534b38f6f45e","infoHashBuffer":{"type":"Buffer","data":[101,48,106,103,166,133,99,23,108,99,63,164,175,175,83,75,56,246,244,94]},"announce":[],"urlList":[]}}