{"title":"Adam Sneyd - Governing Cotton. Globalization and Poverty in Afri","uid":10529524,"size":1137047,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:65d766fb4b7bc5da4d3b45eb49bf73d0583c53ac&amp;dn=Adam+Sneyd+-+Governing+Cotton.+Globalization+and+Poverty+in+Afri&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anette14","files":-1,"time":1405089504,"description":"Description\nProduct Details\nBook Title: Governing Cotton: Globalization and Poverty in Africa (International Political Economy)\nBook Author: Adam Sneyd (Author)\nSeries: International Political Economy\nHardcover: 256 pages\nPublisher: Palgrave Macmillan (March 1, 2011)\nLanguage: English\nISBN-10: 0230252788\nISBN-13: 978-0230252783\n\n===================================================================================\nBook Description\nRelease date: March 1, 2011 | ISBN-10: 0230252788 | ISBN-13: 978-0230252783\nThis book traces the historic relationships between cotton production, the international cotton trade and poverty south of the Sahara, and assesses various approaches to corporate social responsibility and nongovernmental policy advocacy in this area.\nThousands of people around the world are currently engaged in efforts which they believe will make African cotton work better for the millions of people who grow this crop and the millions more who depend upon it. This book traces the historic relationships between cotton and poverty south of the Sahara and assesses aspects of the new social concern evident in the area. Taking an empirical international political economy approach, it details the ways in which globalization has enabled poverty reduction and poverty maintenance on African cotton farms. Sneyd argues that while cotton farming and poverty will be connected for many years to come, there is hope that these issues are now on the agenda.\n\n===================================================================================\nReviews\n'Adam Sneyd's critique significantly contributes to the ongoing debate on poverty among commodity producers.' - Jomo Kwame Sundaram, UN Assistant Secretary General for Economic Development\n\n'This is a must read for scholars and policy-makers who are attempting to understand the micro-realities and lived experience of Africa's poverty problem. Sneyd belongs to an innovative and gifted generation of young scholars who are forcing us to rethink the basics of international political economy. His important book deserves high praise.' - Daniel Drache, Associate Director, Robarts Centre for Canadian Studies and Professor of Political Science, York University, Toronto, Canada\n\n'This book offers a thoughtful and balanced assessment of the linkages between cotton production and poverty in Africa in an era of economic globalization. The book's discussion of new governance initiatives such as corporate social responsibility efforts is both rich in detail and highly engaging.' -- Jennifer Clapp, CIGI Chair in Global Environmental Governance and Professor, Balsillie School of International Affairs and Environment and Resources Department, University of Waterloo, Canada\n\n===================================================================================\nAbout the Author\nADAM SNEYD is Assistant Professor of International Political Economy and Development at the University of Guelph, Canada. He has published on the relevance of the North-South debate in the present era of globalization, and his current research focuses on tropical timber and poverty in the Central Africa region.\n===================================================================================","torrent":{"xt":"urn:btih:65d766fb4b7bc5da4d3b45eb49bf73d0583c53ac","amp;dn":"Adam+Sneyd+-+Governing+Cotton.+Globalization+and+Poverty+in+Afri","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"65d766fb4b7bc5da4d3b45eb49bf73d0583c53ac","infoHashBuffer":{"type":"Buffer","data":[101,215,102,251,75,123,197,218,77,59,69,235,73,191,115,208,88,60,83,172]},"announce":[],"urlList":[]}}