{"title":"L'Orchestre de Contrebasses 4 albums","uid":4677112,"size":329723477,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:65ebb0b57ebb76fc4d59d756ffc0f2493827935d&amp;dn=L%5C%27Orchestre+de+Contrebasses+4+albums&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ghilgames","files":48,"time":1232938583,"description":"This is something i've been working on to gather for about a year now. L'orchestre de Contrebasses is a band created in 1981 by Christian Genet and it's composed, oddly enough by 6 virtuoso classic bass players. The albums represent a labour of pure authentic music and a big step foreward in what concerns the handling of an fundametally important instrument like the bass. The band's style ranges from classic influence to jazz and a new age jazz. But more important than this is the quality of excentric music that a bass sextet provides to the listener alltogether with sounds that could trick one's mind into believing that there are other string instruments like a cello or a viola incorporated into the band. I assure you there arent any. Just listen to Cardamome! This extraordinary succesfull experiment with it's vivante rythm brings the band to an international resonance and maybe more important levels up the concept of understanding and apreciating music in evry listener's mind.\n\n L'orchestre de contrebasses members are:\n   \nChristian Genet \nXavier Lugue \nOlivier Moret \nEtienne Romanet \nYves Torchinsky  \nJean-Philippe Viret  \n\n In this torrent there are only 4 albums of the band's discography. I simply couldn't find the others, but if anyone finds other albums or anything similar, please let me know, or leave me a comment. If you have any suggestions don't hesitate to ask. Thank you for downloading and seed as much as you can!","torrent":{"xt":"urn:btih:65ebb0b57ebb76fc4d59d756ffc0f2493827935d","amp;dn":"L%5C%27Orchestre+de+Contrebasses+4+albums","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"65ebb0b57ebb76fc4d59d756ffc0f2493827935d","infoHashBuffer":{"type":"Buffer","data":[101,235,176,181,126,187,118,252,77,89,215,86,255,192,242,73,56,39,147,93]},"announce":[],"urlList":[]}}