{"title":"Green Capital: A New Perspective on Growth by Christian Perthuis","uid":14469110,"size":17097714,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6617dff5053875194f6936c8c8bbd8a21d6c682a&amp;dn=Green+Capital%3A+A+New+Perspective+on+Growth+by+Christian+Perthuis&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Dr.Soc","files":2,"time":1461886858,"description":"Green Capital: A New Perspective on Growth by Christian de Perthuis and Pierre-André Jouvet\r\nEnglish | 2015 | ISBN: 0231171404 | 288 pages | True PDF + EPUB | 0.6 + 15.7 MB\r\n\r\nMany believe economic growth is incompatible with ecological preservation. Green Capital challenges this argument by shifting our focus away from the scarcity of raw materials and toward the deterioration of the great natural regulatory functions (such as the climate system, the water cycle, and biodiversity).\r\n\r\nAlthough we can find substitutes for scarce natural resources, we cannot replace a natural regulatory system, which is incredibly complex. It is therefore critical that we introduce a new price into the economy that measures the costs of damage to these regulatory functions. This change in perspective justifies such innovations as the carbon tax, which addresses not the scarcity of carbon but the inability of the atmosphere to absorb large amounts of carbon without upsetting the climate system. Brokering a sustainable peace between ecology and the economy, Green Capital describes a range of valuation schemes and their contribution to the goals of green capitalism, proposing a new approach to natural resources that benefits both businesses and the environment","torrent":{"xt":"urn:btih:6617dff5053875194f6936c8c8bbd8a21d6c682a","amp;dn":"Green+Capital%3A+A+New+Perspective+on+Growth+by+Christian+Perthuis","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6617dff5053875194f6936c8c8bbd8a21d6c682a","infoHashBuffer":{"type":"Buffer","data":[102,23,223,245,5,56,117,25,79,105,54,200,200,187,216,162,29,108,104,42]},"announce":[],"urlList":[]}}