{"title":"Antiques.Roadshow.S37E16.Liverpool.Metropolitan.Cathedral.2.mp4","uid":11791346,"size":654051961,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:667f444ee70f5e8156767accb6fb076ded1a7244&amp;dn=Antiques.Roadshow.S37E16.Liverpool.Metropolitan.Cathedral.2.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xela_5","files":1,"time":1427952926,"description":"Antiques Roadshow UK - S37E15 - Broadcast Sunday 29 March.\n\nI created the file using &quot;get i-player&quot; so it is bigger than normal and I have no idea how to edit or make it smaller!\n\n\nThe Antiques Roadshow makes a return visit to Liverpool Metropolitan Cathedral, where fascinating finds include a miniature piano with a secret, a sketch by LS Lowry and a mysterious chest found bricked up in the crypt.\n\nThe team admire a 17th-century long case clock known as the Old Doctor and a model of a local ship that was once the fastest to cross the Atlantic, while a miniature piano opens up to reveal a beautiful sewing kit and a music box.\n\nThe dean of the cathedral unveils a mysterious chest found bricked up behind a wall in 2009 and asks for the team's help in working out how old it is and what it was for.\n\nGlass specialist Andy McConnell tells a tale of skulduggery in the antiques world when he encounters the work of Elizabeth Graydon-Stannus, while paintings specialist Rupert Maas is enchanted by a street scene sketched by one of England's best loved artists, LS Lowry. \n\nRoadshow Uncovered features an artist's impression of the interior of Liverpool Cathedral by Sir Terence Cuneo, painted long before building work had been completed. But how does it compare to the finished interior decades later?","torrent":{"xt":"urn:btih:667f444ee70f5e8156767accb6fb076ded1a7244","amp;dn":"Antiques.Roadshow.S37E16.Liverpool.Metropolitan.Cathedral.2.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"667f444ee70f5e8156767accb6fb076ded1a7244","infoHashBuffer":{"type":"Buffer","data":[102,127,68,78,231,15,94,129,86,118,122,204,182,251,7,109,237,26,114,68]},"announce":[],"urlList":[]}}