{"title":"Disneys-A-Goofy And Extremely Goofy Movies[xvids]-Winker@kidzcor","uid":6385137,"size":1701529089,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:66ba009290f6c10b402dde0dbefea0895340e9c4&amp;dn=Disneys-A-Goofy+And+Extremely+Goofy+Movies%5Bxvids%5D-Winker%40kidzcor&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"alanwatson","files":-1,"time":1305177767,"description":"A Goofy Movie\n\nis a 1995 animated musical comedy film, produced by DisneyToon Studios and released to theaters by Walt Disney Pictures. The film features the characters from The Disney Afternoon television series Goof Troop but is explicitly part of the show's canon. The film can also be considered a road movie.\n\nThe film's plot revolves around the father-son relationship between Goofy and Max as they struggle to find common ground despite Max's persistence in having his own life and winning the girl of his dreams.\n\n\n\nan extremely goofy movie\n\nJoin Goofy and his son, Max, in a hip and hilarious all-new movie that kicks up outrageous fun on the road to higher education. It's all extreme sports and a life of freedom as Max sets off for college -- but Goofy misses Max so much he literally falls down on the job. The laughs come fast and furious as he shows up, leisure suit and all, to finish college alongside Max and his friends. When Goofy meets the librarian, they hit if off and spark a stuck-in-the-seventies disco inferno that steals the show. But as Goofy tries to get closer to Max, both must go to the extreme to learn how to live their own lives ... together! From inspired high-energy music to the antics of one of Disney's most beloved dads, AN EXTREMELY GOOFY MOVIE proves that two Goofs are better than one! ","torrent":{"xt":"urn:btih:66ba009290f6c10b402dde0dbefea0895340e9c4","amp;dn":"Disneys-A-Goofy+And+Extremely+Goofy+Movies%5Bxvids%5D-Winker%40kidzcor","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"66ba009290f6c10b402dde0dbefea0895340e9c4","infoHashBuffer":{"type":"Buffer","data":[102,186,0,146,144,246,193,11,64,45,222,13,190,254,160,137,83,64,233,196]},"announce":[],"urlList":[]}}