{"title":"American Police State Novel Series - The Conscience of Abes Turn","uid":4547575,"size":9443754,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:66bbf1fecbbabd1e466dd51dacc1d6a127067abb&amp;dn=American+Police+State+Novel+Series+-+The+Conscience+of+Abes+Turn&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"YaTimK","files":1,"time":1228185782,"description":"From Amazon:\n\nA story of Espionage, Romance, and Abuse of Power in the fictional town of Abe&amp;#039;s Turn: Somewhere in America, the people live in a police state. Ted and Clydene Jackson have felt it personally. So have their friends Mira and Michael, and all the victims they&amp;#039;ve tried to help, and all the volunteers lobbying to remove Police Chief Baedes from power. For Baedes&amp;#039;s sole ambition is to &quot;protect&quot; the town of Abe&amp;#039;s Turn, at all costs, even if he has to destroy a few innocents in the process. And he will knock down anyone who tries to get in his way. However, these four friends, unknown even to them, have the means, motive, and opportunity to restrain the forces around them, if they dare. and if their own feelings for each other don&amp;#039;t stop them before they even begin. Politically incorrect, distinctly libertarian, and teeming with complex characters, this epic novelette series (with a planned 24-episode story arc) explores the heart of freedom and the dangers of power. It blurs the lines between state, revolution, and terrorism. It asks what Thomas Jefferson once asked: &quot;What country can preserve its liberties, if its rulers are not warned from time to time, that this people preserve the spirit of resistance?&quot; (This first volume contains only Season 1, Episodes 1-4 of the series.)\n\n","torrent":{"xt":"urn:btih:66bbf1fecbbabd1e466dd51dacc1d6a127067abb","amp;dn":"American+Police+State+Novel+Series+-+The+Conscience+of+Abes+Turn","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"66bbf1fecbbabd1e466dd51dacc1d6a127067abb","infoHashBuffer":{"type":"Buffer","data":[102,187,241,254,203,186,189,30,70,109,213,29,172,193,214,161,39,6,122,187]},"announce":[],"urlList":[]}}