{"title":"Planet Man Original Broadcasting Radio Show-zombiRG","uid":9996022,"size":216676861,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:6737bab8db647fcc5afe7149f9cef9769ea10011&amp;dn=Planet+Man+Original+Broadcasting+Radio+Show-zombiRG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zombiRG","files":-1,"time":1397922266,"description":"Produced in about 1950 by Palladium Radio Productions, The Planet Man is the golly-gee-whillikers saga of Dantro, an intergalactic troubleshooter for an organization known as the League of Planets: &quot;the law enforcement body for peace and justice in the celestial world&quot;. (Think of him as an outer-space version of Marshal Matt Dillon: &quot;It's a chancy job, and it makes a [planet] man watchful...&quot;) With their center of operations situated on Planeria Rex, &quot;the capital of the planets&quot;, the League sends their water-carrier Dantro out into the celestial world to maintain law and order &quot;whenever danger threatens the universe&quot;. Dantro is assisted in his quest for law-and-order by the members of Earth's first rocket expedition: Dr. John Darrow, his daughter Pat, and engineer Slats, who are rescued by the Planet Man before their rocket comes perilously close to crashing into the moon. (The explanation for this is that Darrow and crew took on a pair of stowaways before blast-off, namely his nephew Billy and niece Jane -- which makes a listener wonder why the heck they weren't in school.) These five individuals join forces with the Planet Man to defeat evildoers like Marston, the ruler of Mars who possesses an insatiable appetite for interplanetary domination.\n\n\nThese are original broadcast recordings from 1950! The tracks within this torrent were not ripped from a cd, they are live broadcast recordings of the original shows from 1950.\n\n                           32kbps mp3 is the format\n\n                         Episodes 1 and 4 do not exist.\n\n                                    zombiRG","torrent":{"xt":"urn:btih:6737bab8db647fcc5afe7149f9cef9769ea10011","amp;dn":"Planet+Man+Original+Broadcasting+Radio+Show-zombiRG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6737bab8db647fcc5afe7149f9cef9769ea10011","infoHashBuffer":{"type":"Buffer","data":[103,55,186,184,219,100,127,204,90,254,113,73,249,206,249,118,158,161,0,17]},"announce":[],"urlList":[]}}