{"title":"Programming for Engineers - A Foundational Approach (Bradley)","uid":14027253,"size":3138252,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6796f10e600b60d0095eecae76825f384bd6ae24&amp;dn=Programming+for+Engineers+-+A+Foundational+Approach+%28Bradley%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"3055elec","files":1,"time":1458933632,"description":"Programming for Engineers - A Foundational Approach to Learning C and Matlab - Aaron R. Bradley (Springer, 2011).pdf\r\n\r\nISBN 978-3-642-23302-9\r\n\r\nTo learn to program is to be initiated into an entirely new way of thinking about engineering, mathematics, and the world in general. Computation is integral to all modern engineering disciplines, so the better you are at programming, the better you will be in your chosen field.\r\n\r\nThe author departs radically from the typical presentation by teaching concepts and techniques in a rigorous manner rather than listing how to use libraries and functions. He presents pointers in the very first chapter as part of the development of a computational model that facilitates an ab initio presentation of subjects such as function calls, call-by-reference, arrays, the stack, and the heap. The model also allows students to practice the essential skill of memory manipulation throughout the entire course rather than just at the end. As a result, this textbook goes further than is typical for a one-semester course -- abstract data types and linked lists, for example, are covered in depth. The computational model will also serve students in their adventures with programming beyond the course: instead of falling back on rules, they can think through the model to decide how a new programming concept fits with what they already know.\r\n\r\nThe book is appropriate for undergraduate students of engineering and computer science, and graduate students of other disciplines. It contains many exercises integrated into the main text, and the author has made the source code available online","torrent":{"xt":"urn:btih:6796f10e600b60d0095eecae76825f384bd6ae24","amp;dn":"Programming+for+Engineers+-+A+Foundational+Approach+%28Bradley%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6796f10e600b60d0095eecae76825f384bd6ae24","infoHashBuffer":{"type":"Buffer","data":[103,150,241,14,96,11,96,208,9,94,236,174,118,130,95,56,75,214,174,36]},"announce":[],"urlList":[]}}