{"title":"Ingo Swann - Extraterrestrial Telepathy and Biopsychic Sexuality","uid":5741816,"size":49724695,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:68da10189450c79064230c014833c24259d96cf3&amp;dn=Ingo+Swann+-+Extraterrestrial+Telepathy+and+Biopsychic+Sexuality&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"naba888","files":6,"time":1281056971,"description":"Ingo Swann - Extraterrestrial Telepathy and Biopsychic Sexuality \n\nIngo Swann is an artist and author, best known for his work as a co-creator (according to his frequent collaborators Russell Targ and Harold Puthoff) of the discipline of remote viewing, specifically the Stargate Project. He has written several books on remote viewing or related topics.\n\nSwann does not identify himself as a &quot;psychic,&quot; preferring to describe himself as a &quot;consciousness researcher&quot; who had sometimes experienced &quot;altered states of consciousness.&quot; Swann has stated, &quot;I don't get tested, I only work with researchers on well-designed experiments.&quot; Swann is dissatisfied in a role as a passive subject. He feels he must contribute to the preliminary design of the research. There have been &quot;Swann-inspired innovations&quot; that have led to impressive results in parapsychology. Experiments not controlled by Swann have not been very successful. These are rarely mentioned, and if so, only in passing. Swann has stated he hates James Randi's guts.\n\nSwann helped develop the process of remote viewing at the Stanford Research Institute in experiments sponsored by the Central Intelligence Agency. He is commonly credited with proposing the idea of Coordinate Remote Viewing, a process in which viewers would view a location given nothing but its geographical coordinates, which was developed and tested by Puthoff and Russell Targ with CIA funding. Due to the popularity of Uri Geller in the seventies a critical examination of Ingo Swann's paranormal claims was basically overlooked by skeptics and historians. Uri Geller comments very favorably on Ingo Swann. Geller says, &quot;If you were blind and a man appeared who could teach you to see with mind power, you would revere him as a guru. So why is Ingo Swann ignored by publishers and forced to publish his astounding life story on the Internet?&quot; Both Geller and Swann were tested by two experimenters, Russell Targ and Harold Puthoff, who concluded that Geller and Swann did indeed have unique skills. However, others have strongly disputed the scientific validity of Targ and Puthoff's experiments. In a 1983 interview magician Milbourne Christopher remarked Swann is &quot;one of the cleverest in the field.&quot; Details and transcripts of the SRI remote viewing experiments themselves were found to be edited and even unobtainable.","torrent":{"xt":"urn:btih:68da10189450c79064230c014833c24259d96cf3","amp;dn":"Ingo+Swann+-+Extraterrestrial+Telepathy+and+Biopsychic+Sexuality","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68da10189450c79064230c014833c24259d96cf3","infoHashBuffer":{"type":"Buffer","data":[104,218,16,24,148,80,199,144,100,35,12,1,72,51,194,66,89,217,108,243]},"announce":[],"urlList":[]}}