{"title":"Office 2010 The Missing Manual","uid":6489843,"size":7862472,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:69dda5e49b9a7e30e5eb5bee8ee03cc5dea1a87e&amp;dn=Office+2010+The+Missing+Manual&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"_F1_","files":-1,"time":1308840093,"description":"O'Reilly Media, Inc., 2010 - Computers - 960 pages\nMicrosoft Office is the most widely used software suite in the world. The half-dozen programs in Office 2010 are packed with amazing features, but most people just know the basics. This entertaining guide not only gets you started with Office, it reveals all kinds of useful things you didn't know the software could do -- with plenty of power-user tips and tricks when you're ready for more. Create professional-looking documents.Learn everything you need to know to craft beautiful Word documents. Stay organized.Keep track of your email, calendar, and contacts with Outlook. Crunch numbers with ease.Assemble data, make calculations, and summarize the results with Excel. Make eye-catching presentations.Build PowerPoint slideshows with video and audio clips, animations, and more. Build Access databases quickly.Make your data easy to find, sort, and manage. Manage your files more efficiently.Use the new Backstage view to quickly work with your Office files. Get to know the whole suite.Learn to use other handy Office tools: Publisher, OneNote, and Office Web Apps.","torrent":{"xt":"urn:btih:69dda5e49b9a7e30e5eb5bee8ee03cc5dea1a87e","amp;dn":"Office+2010+The+Missing+Manual","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69dda5e49b9a7e30e5eb5bee8ee03cc5dea1a87e","infoHashBuffer":{"type":"Buffer","data":[105,221,165,228,155,154,126,48,229,235,91,238,142,224,60,197,222,161,168,126]},"announce":[],"urlList":[]}}