{"title":"AUSTRALIA - Aboriginal - Songs from the Northern Territory cd3","uid":4389625,"size":46642043,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6b885565d04e35dca887eaf8bfd08c2fa3c34a68&amp;dn=AUSTRALIA+-+Aboriginal+-+Songs+from+the+Northern+Territory+cd3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"starinar","files":14,"time":1221095922,"description":"CLICK ON starinar TO GET MORE TRIBAL AND INDIGENOUS MUSIC.\nBE A MEMBER OF A GLOBAL SeeDeRS TRIBE. MoRE CoMING SooN. ENJoY!\n\n\n\nSongs From the Northern Territory 3: Music From Yirrkala and Milingimbi, North-Eastern Arnhem Land \nArtist/Collector: \nAlice Moyle \nLabel Information: \nAustralian Institute of Aboriginal and Torres Strait Islander Studies (AIATSIS): AIAS 3 CD \nMedia Type: \nCD \nYear: \nRecorded 1963; Released 1997 \nAvailability: \nAIATSIS \n\nNotes: For the purpose of music description, Eastern Arnhem Land of \nthe Northern Territory is divided here as follows: the north-eastern \nsector including offshore islands; the eastern sector extending along \nthe coast south as far as the Roper River; and the Groote Eylandt \narchipelago, north-west of the Gulf of Carpentaria. \nField recordings reproduced on this compact disc were collected in \nthe north-eastern sector at Yirrkala on the Gove Peninsula and \nMilingimbi on the Crocodile Islands off the north coast. The Aboriginal \ncommunities at these two localities, together with the people on \nGaliwin'ku (previously called Elcho Island) have, in the anthropological \nliterature, been referred to as the Murngin (WL Warner) and Wulamba \n(RM Berndt). More recently they have become known as the Yolngu, from a \nlocal word meaning 'people'. \nThe artistic talents of the Yolngu were soon to become widely known and \nadmired. Their bark paintings are now to be found in many Australian \ngalleries and in galleries overseas. Two of their leading painters in the \nearly 1960s, both of the Rirratjingu clan, are to be heard as singers in \nthis series of compact discs (see discs 3 and 4). \nYolngu children excelled as singers and dancers at the Darwin Eisteddfod, \nan annual 'top end' event which, in the 1960s, drew many Aboriginal entrants \nfrom communities within and beyond Arnhem Land. \nSince that time, there have been changes. Mission stations and government \nstations are now Community Centres administered by the Aboriginal people \nthemselves and many have preferred to live more or less permanently on \noutstations situated within traditional territories or homelands. \nItem characteristics of Eastern Arnhem Land clan songs performed and \nrecorded in 1960s-all of which were sung by men-are summarised here as \nfollows: (1) a didjeridu accompaniment which utilises two tones differing \nwidely in pitch (the interval between the higher or overblown tone and \nfundamental often sounding close to a tenth but varying according to the \nshape and length of the hollowed branch); (2) a narrow vocal range of \npitch (compare them, for instance with Western Arnhem Land songs) which \nrarely exceeds a fifth or sixth and may be less than a second; (3) clearly \naudible song words which are translatable, meaningful and appropriate to \nrelevant clan territories and related myths; and (4) the occurrence of an \nunaccompanied vocal termination (UVT), or termination of a song item by \nvoice or voices alone, after the accompanying instruments have ceased. \nGood examples of this fourth item characteristic are to be heard on this \ndisc (Track 11) and disc 4 (Track 1). \nSong refrains may consist of repeated strings of words and syllables, \na prolonged single syllable or a repeated pattern of vocal sounds \n(for example, bird calls). These calls are incorporated into the particular \nsectional or phraselike structure of many item sequences performed in \nEastern Arnhem Land. \nAs part of the music survey mentioned above, several visits were made to the \nnorth-eastern sector and a fairly comprehensive coverage was obtained of songs \nby men, women and children. I also made recordings of a number of ceremonial \nevents. An extract from one of these is to be heard in tracks 1-5 on this disc.\n\nManikay.com","torrent":{"xt":"urn:btih:6b885565d04e35dca887eaf8bfd08c2fa3c34a68","amp;dn":"AUSTRALIA+-+Aboriginal+-+Songs+from+the+Northern+Territory+cd3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b885565d04e35dca887eaf8bfd08c2fa3c34a68","infoHashBuffer":{"type":"Buffer","data":[107,136,85,101,208,78,53,220,168,135,234,248,191,208,140,47,163,195,74,104]},"announce":[],"urlList":[]}}