{"title":"Nine Inch Nails - Hurt","uid":5138677,"size":92342276,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:6c2fcaf4db6bf3e99456cd1bd95eee40630432da&amp;dn=Nine+Inch+Nails+-+Hurt&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"claudeq","files":1,"time":1256724784,"description":"'Nine Inch Nails' &quot;Hurt&quot; was never produced as a commercial single for the public. However, a promotional single was distributed, containing censored and uncensored mixes; the main difference being the line &quot;crown of shit&quot; is changed to &quot;crown of thorns&quot; for radio purposes. The disc, Interscope Records PRCD 6179, is labeled &quot;Halo Ten,&quot; like the earlier &quot;Piggy&quot; promotional disc. Neither is considered an official Halo, Further Down the Spiral being the official Halo Ten.\n\nThe music video for &quot;Hurt&quot; is a live performance that appears on Closure and the DualDisc re-release of The Downward Spiral. The audio portion appears on the UK version of Further Down the Spiral.\n\nA scrim had been dropped in front of the band on stage, onto which various images, such as war atrocities, a nuclear bomb test, survivors of the Battle of Stalingrad, a snake staring at the camera, and a time-lapse film of a fox decomposing in reverse, were projected to add visual symbolism (depicting various images of death, destruction and loss) to the song's subject matter. A spotlight was cast on Reznor so he could be seen through the images. Compared to the live renditions performed on future tours, this version most resembles the studio recording with its use of the song's original samples.\n\nThere are also official live recordings on the later releases And All that Could Have Been and Beside You in Time. Each version features distinct instrumentation by the varying members of the band in the respective eras.\n\n\n","torrent":{"xt":"urn:btih:6c2fcaf4db6bf3e99456cd1bd95eee40630432da","amp;dn":"Nine+Inch+Nails+-+Hurt","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c2fcaf4db6bf3e99456cd1bd95eee40630432da","infoHashBuffer":{"type":"Buffer","data":[108,47,202,244,219,107,243,233,148,86,205,27,217,94,238,64,99,4,50,218]},"announce":[],"urlList":[]}}