{"title":"KjÃƒÂ¸tt (komplett)","uid":4592631,"size":252947918,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6c8cb02be82ece1d620988806a536b7f3ccb363d&amp;dn=Kj%C3%83%C2%B8tt+%28komplett%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Roxxx","files":48,"time":1229887747,"description":"KjÃƒÂ¸tt.  \n\nKjÃƒÂ¸tt var et punke- og rockeband fra Oslo som eksisterte mellom 1979 og 1981. De ga i lÃƒÂ¸pet av disse to ÃƒÂ¥rene ut to 7&quot; EP-er, en 12&quot;-EP og en LP, ved siden av at de bidro pÃƒÂ¥ flere samleplater og -kassetter. I 1989 kom det ut en samleplate med bandet. Bandet hadde samme besetning gjennom hele sin levetid.\n\nBandets fÃƒÂ¸rste 7&quot; var blant Norges fÃƒÂ¸rste punk-plater. I dette sporet fulgte ogsÃƒÂ¥ 12&quot; EP-en med klassikere som Jeg vil bli som Jesus, NÃƒÂ¥ vil jeg ikke leke med teitinger mer og Elektrisk. Mens det var Krohn som hadde stÃƒÂ¥tt bak det meste av materialet her, ble Gaarder etter hvert en viktigere lÃƒÂ¥tskriver, noe som tydelig kommer til uttrykk pÃƒÂ¥ den andre 7&quot; og pÃƒÂ¥ LP-en Op. Selv om Krohn ogsÃƒÂ¥ bidro pÃƒÂ¥ sistnevnte, var hans typiske lekne og enkle punk-inspirerte melodier erstattet med mer eksperimentell musikk. Albumets mest eksperimentelle spor er Jern og Metall, som er kreditert til Krohn og Gaarder: Det dreier seg om rytmesporet fra en halvferdig innspilling av den senere Raga Rockers-hiten Trist at det skulle ende slik, speedet opp til dobbel hastighet og pÃƒÂ¥lagt ny vokal og instrumenter. Gruppen var pÃƒÂ¥ TV flere ganger, og NRK produserte en video til Beat Allegro 160.\n\nDette eksperimentelle trekket utviklet seg ytterligere da Krohn trakk seg ut av bandet for ÃƒÂ¥ stifte Raga Rockers. Resten av bandet fortsatte under navnet Montasje og ga ut ÃƒÂ©n LP. Gaarder grunnla senere Cirkus Modern og var frem til sin dÃƒÂ¸d i 2004 ansatt i Rikskonsertene.\n\nJÃƒÂ¸ran Rudi og Erik Aasheim er aktive innen samtidsmusikk.","torrent":{"xt":"urn:btih:6c8cb02be82ece1d620988806a536b7f3ccb363d","amp;dn":"Kj%C3%83%C2%B8tt+%28komplett%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6c8cb02be82ece1d620988806a536b7f3ccb363d","infoHashBuffer":{"type":"Buffer","data":[108,140,176,43,232,46,206,29,98,9,136,128,106,83,107,127,60,203,54,61]},"announce":[],"urlList":[]}}