{"title":"Computational Methods for Mass Spectrometry Proteomics","uid":15024633,"size":3063040,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6cbeced208c958a0fd0e52d2ccecabd334bca024&amp;dn=Computational+Methods+for+Mass+Spectrometry+Proteomics&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1466507110,"description":"Computational Methods for Mass Spectrometry Proteomics - Ingvar Eidhammer et al. (Wiley, 2007).pdf\r\n\r\nISBN 978-0-470-51297-5\r\n\r\nProteomics is the study of the subsets of proteins present in different parts of an organism and how they change with time and varying conditions. Mass spectrometry is the leading technology used in proteomics, and the field relies heavily on bioinformatics to process and analyze the acquired data. Since recent years have seen tremendous developments in instrumentation and proteomics-related bioinformatics, there is clearly a need for a solid introduction to the crossroads where proteomics and bioinformatics meet.\r\n\r\nComputational Methods for Mass Spectrometry Proteomics describes the different instruments and methodologies used in proteomics in a unified manner. The authors put an emphasis on the computational methods for the different phases of a proteomics analysis, but the underlying principles in protein chemistry and instrument technology are also described. The book is illustrated by a number of figures and examples, and contains exercises for the reader. Written in an accessible yet rigorous style, it is a valuable reference for both informaticians and biologists.\r\n\r\nComputational Methods for Mass Spectrometry Proteomics is suited for advanced undergraduate and graduate students of bioinformatics and molecular biology with an interest in proteomics. It also provides a good introduction and reference source for researchers new to proteomics, and for people who come into more peripheral contact with the field","torrent":{"xt":"urn:btih:6cbeced208c958a0fd0e52d2ccecabd334bca024","amp;dn":"Computational+Methods+for+Mass+Spectrometry+Proteomics","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6cbeced208c958a0fd0e52d2ccecabd334bca024","infoHashBuffer":{"type":"Buffer","data":[108,190,206,210,8,201,88,160,253,14,82,210,204,236,171,211,52,188,160,36]},"announce":[],"urlList":[]}}