{"title":"Bulb Boy v1.01","uid":12687091,"size":465937043,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6cefdcbf6ad6229c0f0987d52d9b5e4c43d12fca&amp;dn=Bulb+Boy+v1.01&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dauphong","files":1,"time":1446625918,"description":"\nAbout This Game\r\nOne gloomy night, Bulb Boy wakes suddenly from a frightening nightmare to discover that evil has overshadowed the Bulbhouse. His family has disappeared and there are horrid monsters lurking in the shadows. Gather the courage and use his glass head to save everything he loves. Find light in yourself!\r\nGameplay\r\nBulb Boy is an intuitive 2D point &amp; click horror adventure about a boy with a glowing head (alright, it's a bulb...) inspired by Machinarium and Gobliiins. Solve puzzles, defeat wicked monsters and reveal bulby's abilities to unfold a twisted tale. Ohhh... And don't forget to save your Grandpa-raffin and Mothdog from the frightening darkness..\r\nKey Features\r\n\r\n    DEFEAT THE MONSTERS -Explore the Bulb house, that is full of frightening creatures. Defeat the evil in all its forms and bring the light back.\r\n    BULB'S TALENTS - Being a boy that is a bulb comes with many talents. Not only does your head light up and allows you to survive electrical shocks, but it can also be unscrewed for use in strange places.\r\n    PLAYABLE FLASHBACKS - Play as other family characters. Relive Bulb Boy's childhood memories to uncover the mystery of the story.\r\n    BUBBLE SPEECH - No dialogue, just bubble speech. Watch the story unfold in animated clouds.\r\n    SECRETS - There are things in the house waiting to be revealed.\r\n    POOP - In many sizes and proportions","torrent":{"xt":"urn:btih:6cefdcbf6ad6229c0f0987d52d9b5e4c43d12fca","amp;dn":"Bulb+Boy+v1.01","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6cefdcbf6ad6229c0f0987d52d9b5e4c43d12fca","infoHashBuffer":{"type":"Buffer","data":[108,239,220,191,106,214,34,156,15,9,135,213,45,155,94,76,67,209,47,202]},"announce":[],"urlList":[]}}