{"title":"Outlines - Our Lives Are Too Short","uid":4472569,"size":78180219,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6d76577fdbeef6c4287c2a961d8a53c7624a50bd&amp;dn=Outlines+-+Our+Lives+Are+Too+Short&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"nigeldpablo","files":-1,"time":1225155534,"description":"Their roots in hip-hop and experience in the electronic sound of Paris, Outlines releases Our Lives Are Too Short, an album for your ears, feet and booty. The three blokes that make up Outlines are Jerome, Irfane and Jay1, who all come from different but equally impressive backgrounds. Jerome has worked as executive production (Blue Note Revisited, RZA, French ConnectionÃ‚Â¦), Irfane has made beats for such acts as Shabazz The Disciple, Shurikn, Afrob and Jay1 made it out alive after facing troubles with the law over his graffiti addiction. He is credited as creating the art on the front of the record. From its opening to its finnish, this funky blend of jazz, hip-hop, and electronica seems to have passed through a coating of pop. The sheer catchiness on this record is astounding. Lyrically, it may as well be your average European pop record, with love struck lyrics and the light subject matter we love. On many of the cuts, the harmonies by Jerome and Irfane are reminiscent of the The Bee Gees, only a few octaves down.\n\nThe albums passionate string intro, into an earthy upbeat jazz groove sets the tone for what Outlines will bring. Its as if they are setting the stage for a show, preparing the listener for musical surprises as electronic trickery. Bass lines fall in and out amidst ambient loops and electric keyboard tonality. A rapper by the name of Beat Assailant appears twice on Our Lives Are Too Short, lending his rhymes on Show Me and Waiting In Line, which weaves a dramatic story of a mans wrongfully accused run in with the law. Beat Assailant hails from Atlanta but lives in Paris and is a heavy, hungry artist in the French electronic/hip-hop scene. RZA, a more familiar rapper from the Wu Tang Clan, appears on Now That Im Free one of the best cuts on the record. Its refreshing to hear RZA outside of his element; hip-hopan urban American novelty. Impressive skills and compositional versatility make Beat Assailant and RZA a tasty addition to Outlines already sweet grooves. Out of all the bumpin tracks on this album; the single entitled Just A Lil Lovin is by far the most danceable. Its pulse begins awkwardly but builds into a bass and beat drop with a repeating female hook sample. The band takes what could have been a laid back piano interlude and develops it into a unique beat sequence perfect for the club. Just a little lovin early in the morning, just a little loving, early in the dayÃ‚Â¦you really cant go wrong there.\nWhat most stands out on the record isn't its sweet samples or its killer booty beats, but rather fact that this album is entirely comprehensive.  Its transitions from song to song are perfectly arranged so that its flow between song styles and tempos are incredibly natural. When musicians (especially electronic artists who sell more singles than entire LPs) are capable of presenting a neat layout of ample work, it is not something to ignore. Outlines palette of musical production and variety of sounds is every changing and I expect many more great releases from these French fusion DJs\n\n        1.      Introduction\n\t2.\tShow Me - (featuring Beat Assailant)\n\t3.\tOur Lives Are Too Short\n\t4.\tNow That I'm Free - (featuring RZA)\n\t5.\tHold On\n\t6.\tListen to the Drums\n\t7.\tBack to 1984\n\t8.\tToo Much to Ask - (featuring Abd-Al-Malik)\n\t9.\tJust a Lil' Lovin'\n\t10.\tWaiting in Line - (featuring Beat Assailant)\n\t11.\tMatter of Time, A\n\t12.\tBounce\n\t13.\tHow It Should Be Done\n\t14.\tOutro\n\t15.\tLucky Boy (Outlines Remix) (Bonus Track)","torrent":{"xt":"urn:btih:6d76577fdbeef6c4287c2a961d8a53c7624a50bd","amp;dn":"Outlines+-+Our+Lives+Are+Too+Short","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d76577fdbeef6c4287c2a961d8a53c7624a50bd","infoHashBuffer":{"type":"Buffer","data":[109,118,87,127,219,238,246,196,40,124,42,150,29,138,83,199,98,74,80,189]},"announce":[],"urlList":[]}}