{"title":"Raging Bull 1980 (Soundtrack) [FLAC]  - Kitlope","uid":6857457,"size":605310659,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6e2d0b15b073ae3a5d60e107b09e4297eaedcb3b&amp;dn=Raging+Bull+1980+%28Soundtrack%29+%5BFLAC%5D++-+Kitlope&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Kitlope","files":43,"time":1322751766,"description":"PC Software: Windows 7 Ultimate Build 7600 \nFile Type: FLAC Compression 6\nOptical Drive Hardware: Samsung SH-S223L\nOptical Drive Firmware: SB04\nCd Software: Exact Audio Copy V1.0 Beta 3 (Secure Mode)\nEAC Log: Yes\nEAC Cue Sheet: Yes\nM3U Playlist: Yes\nTracker(s):http://tracker.openbittorrent.com/announce; \nTorrent Hash: 6E2D0B15B073AE3A5D60E107B09E4297EAEDCB3B\nFile Size: 577.26 MB\nYear: Capitol / EMI\nCatalog #: 72435-60322-2-4\n\n\nPlease help seed these FLACs! \n\n\n\n\nFrom Wiki:\n\n\nRaging Bull is a 1980 American biographical sports drama film directed by Martin Scorsese, and adapted by Paul Schrader and Mardik Martin from the Jake La Motta memoir Raging Bull: My Story. It stars Robert De Niro as Jake LaMotta, a middleweight boxer whose sadomasochistic rage, sexual jealousy, and animalistic appetite destroyed his relationship with his wife and family. Also featured in the film are Joe Pesci as Joey, La Motta's well-intentioned brother and manager who tries to help Jake battle his inner demons; and Cathy Moriarty as his abused wife. The film features supporting roles from Nicholas Colasanto, Theresa Saldana, and Frank Vincent.\n\nScorsese was initially reluctant to develop the project, though he eventually came to relate to La Motta's story. Schrader re-wrote Martin's first screenplay, and Scorsese and De Niro together made uncredited contributions thereafter. Pesci was an unknown actor prior to the film, as was Moriarty, who was suggested for her role by Pesci. During principal photography, each of the boxing scenes was choreographed for a specific visual style and De Niro gained approximately 70 pounds (32 kg) to portray La Motta in his early post-boxing years. Scorsese was exacting in the process of editing and mixing the film, expecting it to be his last major feature.\n\nAfter receiving mixed initial reviews (and criticism due to its violent content), it went on to garner a high critical reputation and is now widely regarded among the greatest films ever made, including by Roger Ebert of the Chicago Sun-Times, renowned British motion picture historian Leslie Halliwell, the American Film Institute, Time magazine, The New York Times, Variety, Entertainment Weekly, Empire magazine, Total Film, Film 4, BFI's and Sight and Sound. It was listed in the National Film Registry in 1990, its first year of eligibility. \n\n\n\n\n\nRaging Bull 1980\n\n\nMartin Scorsese decided to assemble a soundtrack made of music that was popular at the time using his personal collection of 78s. With the help of Robbie Robertson the songs were carefully chosen so they would be the ones that one would hear on the radio, at the pool or in bars and clubs reflecting the mood of that particular era.[61][62] Some lyrics from songs would be slipped into some dialogue. The Intermezzo from Cavalleria rusticana by Italian composer Pietro Mascagni would serve as the main theme to Raging Bull after a successful try-out by Scorsese and the editor, Thelma Schoonmaker over the film's opening titles.[62] Two other Mascagni pieces were used in the film: the Barcarolle from Silvano, and the Intermezzo from Guglielmo Ratcliff.[63] A two-CD soundtrack was released in 2005, long after the film was released, because of earlier difficulties receiving permissions for many of the songs, which Scorsese selected from his childhood memories growing up in New York.\n\n\nTracks:\n\n\n\nDisc 1 \n\n1.\tCavalleria Rusticana Intermezzo - Orchestra of Bologna Municop Thetra \n2.\tJersey Bounce - Benny Goodman &amp; His Orchestra \n3.\tPrisoner of Love - Russ Columbo \n4.\tJust One More Chance - Bing Crosby \n5.\tCow - Cow Boogie \n6.\tVivere - Carlo Buti \n7.\tWhispering Grass (Don't Tell the Trees) - The Ink Spots \n8.\tTwo O'Clock Jump - Harry James &amp; His Orchestra \n9.\tDrum Boogie - Gene Krupa &amp; His Orchestra \n10.\tAll or Nothing at All - Harry James &amp; His Orchestra \n11.\tFlash - Harry James &amp; His Orchestra \n12.\tMy Reverie - Larry Clinton &amp; His Orchestra \n13.\tStornelli Fiorentini - Carlo Buti \n14.\tWebster Hall - Robbie Robertson \n15.\tBig Noise from Winnetka - Bob Crosby &amp; the Bob Cat Orchestra \n16.\tFrenesi - Artie Shaw &amp; His Orchestra \n17.\tDo I Worry? - The Ink Spots \n18.\tTuri Giuliano - Orazio Strano \n\n\n\n\nDisc 2\n\n1.\tSilvano Barcarolle - Orchestra of Bologna Municop Thetra \n2.\tStone Cold Dead in the Market - Ella Fitzgerald \n3.\tNao Tenho Lagrimas - PatrÃƒÂ­cio Teixeira \n4.\tHeartaches - Ted Weems &amp; His Orchestra \n5.\tA New Kind of Love - Robbie Robertson \n6.\tTill Then - The Mills Brothers \n7.\tMona Lisa - Nat King Cole \n8.\tThat's My Desire - Manny Klein \n9.\tGuglielmo Ratcliff Intermezzo - Orchestra of Bologna Municop Thetra \n10.\tBye, Bye, Baby - Marilyn Monroe \n11.\tThat's Entertainment - Robert DeNiro \n12.\tBlue Velvet - Tony Bennett \n13.\tScapricciatiello (Infatuation) - Renato Carosone \n14.\tCome Fly with Me - Frank Sinatra \n15.\tMedley - Louis Prima \n16.\tLonely Nights - The Hearts \n17.\tPrisoner of Love - Perry Como \n18.\tCavalleria Rusticana Intermezzo - Orchestra of Bologna Municop Thetra \n19.\tAt Last - Robbie Robertson \n\n\n\n\nEnjoy :)\n","torrent":{"xt":"urn:btih:6e2d0b15b073ae3a5d60e107b09e4297eaedcb3b","amp;dn":"Raging+Bull+1980+%28Soundtrack%29+%5BFLAC%5D++-+Kitlope","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e2d0b15b073ae3a5d60e107b09e4297eaedcb3b","infoHashBuffer":{"type":"Buffer","data":[110,45,11,21,176,115,174,58,93,96,225,7,176,158,66,151,234,237,203,59]},"announce":[],"urlList":[]}}