{"title":"Johnny Cool [1963] Elizabeth Montgomery","uid":5839610,"size":1024211874,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6e2e1a5165dce5bdea4d22efa89c7e0a48d4e1b2&amp;dn=Johnny+Cool+%5B1963%5D+Elizabeth+Montgomery&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ThorntonWilde","files":-1,"time":1284888126,"description":" &lt;a href=&quot;http://bayimg.com/lAPgLAAcc&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/lAPgLAAcc&lt;/a&gt;\n\nJohnny Cool (1963) \n\nVHS \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0057200/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0057200/&lt;/a&gt;\n\nJohnny Cool is a 1963 film directed by William Asher. It stars Henry Silva and Elizabeth Montgomery.\n\n Henry Silva ...  Johnny Cool / Salvatore Giordano \n Elizabeth Montgomery ...  Darien 'Dare' Guiness \n Richard Anderson ...  Correspondent \n Jim Backus ...  Louis Murphy \n Joey Bishop ...  Holmes, Used Car Salesman \n Brad Dexter ...  Lennart Crandall \n Wanda Hendrix ...  Miss Connolly \n Hank Henry ...  Larry, Bus Driver \n Marc Lawrence ...  Johnny Colini \n John McGiver ...  Oscar B. 'Oby' Hinds \n Gregory Morton ...  Jerry March \n Mort Sahl ...  Ben Morrow \n Telly Savalas ...  Vincenzo 'Vince' Santangelo \n Joan Staley ...  Suzy \n Sammy Davis Jr. ...  Educated \n\n\nJohnny Cool (1963) features the veteran character actor Henry Silva in one of his few leading roles. Silva was usually relegated to playing thugs in small bit parts, but in Johnny Cool, Silva stars as a Sicilian hitman named Giordano who is recruited by an exiled mob boss called Johnny Colini (Marc Lawrence) after a fatal run in with the Italian authorities. Colini gives Giordano the nickname of 'Johnny Cool' and sends him to America so he can take revenge on his numerous mob rivals. In New York Johnny Cool meets a beautiful and naive young woman by the name of Darien 'Dare' Guiness (Elizabeth Montgomery). They carry on a doomed love affair while Johnny Cool goes on a violent killing spree that takes the two lovers on an unforgettable road trip across the country.\n\nThe film was directed by William Asher who is mostly remembered for directing many of the Annette Funicello and Frankie Avalon Beach Party movies as well as numerous television programs including Bewitched, which starred the director's wife, actress Elizabeth Montgomery. William Asher and Elizabeth Montgomery met during the auditions for Johnny Cool and the two instantly hit it off. They were both married at the time (Asher to actress Danny Sue Nolan and Montgomery to actor Gig Young) but they soon filed for divorce from their respective spouses and were married right after Johnny Cool was released.\n\nWilliam Asher's direction in Johnny Cool is surprisingly innovative when compared to some of his other film and television work. While the movie occasionally suffers from uneven pacing and awkward editing, it also contains some impressive perspective shots that highlight Asher's filmmaking abilities and signal that he may have been a more creative director than he was often allowed to be. Asher also seemed to have a real feel for location shooting. Although Johnny Cool takes place in New York, Las Vegas and Los Angeles, Asher along with the Oscar winning cinematographer Sam Leavitt (A Star Is Born; 1954, The Defiant Ones; 1958, Anatomy of a Murder; 1959, Exodus; 1960, etc.), managed to thoroughly capture the atmosphere and mood of each city.\n\nPeter Lawford's production company Chrislaw (named after Peter's son, Christopher) produced Johnny Cool and the film features a good cast that includes Rat Pack members Sammy Davis, Jr. (who provided the film's terrific theme song) and Joey Bishop; as well as actor Hank Henry and the film's star Henry Silva who both appeared in Ocean's Eleven (1960) and Sergeants 3 (1962). The film also includes many familiar television regulars such as Telly Savalas, Jim Backus, John McGiver, Richard Anderson and Gregory Morton. The trailblazing comedian Mort Stahl also shows up in a memorable role as one of the gangsters that Johnny Cool murders. But the best acting in the film is provided by actress Elizabeth Montgomery. Her passionate and thoughtful characterization of a modern day gangster's moll is a somewhat thankless role, but Montgomery really dove into the part and delivers one of the most exciting performances of her career as Johnny Cool's love interest.\n\nThis brutal and downbeat crime drama received mixed reviews when it was initially released. The New York Daily News and Los Angeles Herald-Examiner both praised the movie but The New York Times thought that, &quot;Peter Lawford, who unexpectedly produced this collage, might well have taken a look at the rushes and saved himself the expense of a fairly elaborate group of guest stars&quot; and Newsweek called the film a &quot;weary, dreary, stupid, jerry-built messy fraud of a picture.&quot; The most evenhanded review probably came from the staff at Variety who praised the performances and look of the film but criticized its script and abundant violence. Today Johnny Cool seems like a gentle relic when compared to the violent crime films that followed in the wake of Francis Ford Coppola's epic Godfather trilogy. But when it was released in 1963 the movie's unexpected savagery raised more than a few eyebrows. \n\n","torrent":{"xt":"urn:btih:6e2e1a5165dce5bdea4d22efa89c7e0a48d4e1b2","amp;dn":"Johnny+Cool+%5B1963%5D+Elizabeth+Montgomery","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e2e1a5165dce5bdea4d22efa89c7e0a48d4e1b2","infoHashBuffer":{"type":"Buffer","data":[110,46,26,81,101,220,229,189,234,77,34,239,168,156,126,10,72,212,225,178]},"announce":[],"urlList":[]}}