{"title":"Command &amp; Conquer: Red Alert 3 for Mac OS X","uid":4937717,"size":6832366316,"categoryP":"games","categoryS":"mac","magnet":"?xt=urn:btih:6e8231589a354f0c6111acba7a12f2e28b7a76c4&amp;dn=Command+%26+Conquer%3A+Red+Alert+3+for+Mac+OS+X&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dima_a","files":-1,"time":1244320284,"description":"game released 03/23/2009\nCREDITS TO HEiRLOOM &lt;a href=&quot;\nhttp://www.apple.com/games/articles/2009/04/redalert3/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.apple.com/games/articles/2009/04/redalert3/&lt;/a&gt;\n\nCommand &amp; Conquer: Red Alert 3 for Mac.\nAfter seven years, Red Alert returns! After a time travel mission goes awry, a new superpower has been thrust onto the world stage and World War III is raging. The Empire of the Rising Sun has risen in the East, making WW III a three-way struggle between the Soviets, the Allies, and the Empire with armies fielding wacky and wonderful weapons and technologies such as Tesla coils, heavily armed War Blimps, teleportation, armored bears, intelligent dolphins, floating island fortresses, and transforming tanks. Experience the next chapter of the Red Alert saga. GAME WITH FAME: Randy Couture, Time Curry, Jenny McCarthy, Jonathan Pryce, J.K. Simmons, George Takei, and others join the largest live Hollywood cast ever assembled in a videogame, with over 60 minutes of high-def video sequences. RULE THE OCEANS, RULE THE WORLD: Unprecedented naval gameplay delivers an entirely new strategic dimension. UNLEASH THE MAN-CANNON: Bring about the rebirth of the Soviet Union with over-the-top weapons and vehicles including parachuting bears, dolphins with sonic weapons, and massive samurai robots. PLAY COOPERATIVELY WITH FRIENDS: Play through the entire campaign alongside your friends or enlist the help of nine in-game Co-Commanders.\n\nPatch included run after install (unzip and click it)\n- Mount the h-ccra3.dmg\n- Drag/Install game to your 'Applications' Directory\n- Decompress the zip file h-ccra3c.zip \n- Run patch Red Alert 3 [k].pkg\n- Game is ready click Command and Conquer - Red Alert 3.app\n(it will take some time for game to start, especially on mac with less horsepowers; like macbook)\n\nREQUIRES Mac OS X 10.5.6 Leopard or higher, Intel Core Duo\n(min 8GB free hard drive space)\n\nWill not run on a PowerPC (G3/G4/G5)Mac/PowerMac, 1024MB or less RAM\nonly Intel Core Duo (hackintosh with dual core should work)\n\nDo not install any updates to the game","torrent":{"xt":"urn:btih:6e8231589a354f0c6111acba7a12f2e28b7a76c4","amp;dn":"Command+%26+Conquer%3A+Red+Alert+3+for+Mac+OS+X","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e8231589a354f0c6111acba7a12f2e28b7a76c4","infoHashBuffer":{"type":"Buffer","data":[110,130,49,88,154,53,79,12,97,17,172,186,122,18,242,226,139,122,118,196]},"announce":[],"urlList":[]}}