{"title":"Video Vision Plus 12.0.11","uid":7328756,"size":15994807,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:6f4d20901fd4dbde99a780b85d13549992e6718c&amp;dn=+Video+Vision+Plus+12.0.11&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1338842096,"description":"\nVideo Vision Plus 12.0.11 | 15.3 MB\n\nThe products in the Video Vision range provide everything you need to control, manage and promote your movie and/or game rental business.Video Vision is available in two packages - Video Vision Lite and Video Vision Plus. Video Vision Lite is a scaled down version of Video Vision Plus designed for small stores or stores starting out on a limited budget who do not yet require the extra functionality provided in Video Vision Plus.\n\nFeatures\n\nCore features included in both the Lite and Plus versions include an intuitive Windows interface that is extremely simple to learn and use, integrated reservations, password protected functions, overdue rental monitoring and late fee calculation, customer account management, barcode scanner support, management reporting, top rentals chart, full rental histories, and much, much more. The Plus version of the program also includes barcode designing and printing, a range of promotional tools (including multi-rental discounts, Rental Plans and a Frequent Rental Points scheme), customer photo capture, customer membership card creation (with photo and barcode), full saleable stock control features, and much more.\n\nBoth programs permit flexible configuration of item formats, allowing entry not only of items with formats currently available (e.g. VHS, DVD and Blu-Ray for movies / XBOX 360, DS and Wii for games) but also quick configuration of any new formats that become available in the future.\n\nHome Page - http://www.vision-forecasting.com/content.aspx?cn=int&amp;pid=vv&amp;ln=en","torrent":{"xt":"urn:btih:6f4d20901fd4dbde99a780b85d13549992e6718c","amp;dn":"+Video+Vision+Plus+12.0.11","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f4d20901fd4dbde99a780b85d13549992e6718c","infoHashBuffer":{"type":"Buffer","data":[111,77,32,144,31,212,219,222,153,167,128,184,93,19,84,153,146,230,113,140]},"announce":[],"urlList":[]}}