{"title":"Counter-Strike Global Offensive (Update from 1.2.22.3 to 1.2.23.","uid":8331254,"size":1815520495,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6f7ef391811cd327be67d5066fbdd3bceca25646&amp;dn=Counter-Strike+Global+Offensive+%28Update+from+1.2.22.3+to+1.2.23.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"4gameslt","files":-1,"time":1364894363,"description":"Greetings from #4Games.LT...\n\nCounter Strike Global Offensive features new maps, characters, and weapons and delivers updated versions of the classic CS content (de_dust, etc.). In addition, CS: GO will introduce new gameplay modes, matchmaking, leader boards, and more.\n\nCounter-Strike took the gaming industry by surprise when the unlikely MOD became the most played online PC action game in the world almost immediately after its release in August 1999, said Doug Lombardi at Valve. For the past 12 years, it has continued to be one of the most-played games in the world, headline competitive gaming tournaments and selling over 25 million units worldwide across the franchise. CS: GO promises to expand on CS award-winning gameplay and deliver it to gamers on the PC as well as the next gen consoles and the Mac.\n\nCS:GO is being developed by Valve in cooperation with Seattle-based Hidden Path Entertainment. The title is targeted for release in early 2012 and will be playable at this year PAX Prime and Eurogamer Expo.\n\n4Games.LT presents you a CS:GO client update from 1.2.22.3 to 1.2.23.1. This update can be used to update your game to the newest version of CS:GO (be sure that your game version is 1.2.22.3 or newer, if you have older version like 1.2.13.1 or newer please download 4Games.LT AiO update from here: http://thepiratebay.se/torrent/8331245 ), and gives opportunity to play with bots, online, etc...\n\nFull CS:GO client can be found here: http://thepiratebay.se/torrent/8331220\n\nHow to update and play:\n\n1. Download this update, but firstly check client version.\n2. Open &quot;Counter-Strike Global Offensive&quot; folder, that is in you computer.\n3. Open downloaded archive.\n4. Extract everything from archive to &quot;Counter-Strike Global Offensive&quot; folder.\n5 (Optional). Go BACK to steam folder, launch Steam.exe, wait till it updates himselve. Then close steam.\n6. Go BACK till you see folder &quot;Steam&quot;.\n7. Place launcher there. Launcher can be found here:\n8. Start launcher with admin rights.\n9. Click on &quot;Validate&quot; button.\n10. Wait till validation will be finished.\n11. Click on big button &quot;Play Counter-Strike Global Offensive&quot;.\n\n\nYOU NEED:\n\n1. Windows Vista or highter. Windows XP is not supported any more, because CS:GO neads DirectX 11, and there is no officiall release of DirectX 11 for Windows XP.\n\nCheck my user for more games, updates, etc...: \n \n &lt;a href=&quot;\thttp://thepiratebay.se/user/4gameslt&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\thttp://thepiratebay.se/user/4gameslt&lt;/a&gt;\n\n#4Games.LT Team\n\n\nMore info, updates and full support here: \n &lt;a href=&quot;\thttp://forum.4games.lt&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\thttp://forum.4games.lt&lt;/a&gt;","torrent":{"xt":"urn:btih:6f7ef391811cd327be67d5066fbdd3bceca25646","amp;dn":"Counter-Strike+Global+Offensive+%28Update+from+1.2.22.3+to+1.2.23.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f7ef391811cd327be67d5066fbdd3bceca25646","infoHashBuffer":{"type":"Buffer","data":[111,126,243,145,129,28,211,39,190,103,213,6,111,189,211,188,236,162,86,70]},"announce":[],"urlList":[]}}