{"title":"Draw More Furries- Anthropomorphic Fantasy Creatures [PDF]","uid":9370356,"size":21061987,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6f973dff6a31970ea40d2869f9fb748727a97a06&amp;dn=Draw+More+Furries-+Anthropomorphic+Fantasy+Creatures+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"F1restorm","files":-1,"time":1387512712,"description":"Draw More Furries: How to Create Anthropomorphic Fantasy Creatures \nAuthors: Jared Hodges and Lindsay Cibos\nPublished: 2012\nPublisher: Impact\nISBN: 9781440314735\nFormat: Retail PDF\nReader Required: Adobe Reader, Adobe Digital Editions\n\nTested on the above readers with no problems on laptop and Android tablet. \nPlease allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nEnjoy! :D\n_____________________________________________________________________________________\n\nDraw Fabulous Furries!\nFurries are so much fun to draw, people have been doing so for thousands of years. By crossing animal traits with human, you can create some fantastic characters with distinct personalities.\n\nThe authors of Draw Furries bring you more of the best step-by-step lessons for creating anthropomorphic characters. You'll learn everything from furry anatomy, facial expressions and poses to costumes, coloring and settings! You'll also learn how to create characters that convey the various personalities and spirits of the animals they resemble. Draw More Furries is packed with 20 new furries, &quot;scalies,&quot; and mythological creatures with lessons covering everything from drawing mouths and muzzles to paws, feathers and fur. The anthropomorphic creatures you can create with these easy-to-learn lessons are limitless!\n\nBut you won't just stop there. Lindsay and Jared take you to the next level by showing you how to build a scene from start to finish. From dinosaur warriors to snow leopard pirates, you'll be drawing all kinds of fun, furry friends in no time!\n\n-Loaded with more than 50 step-by-step demonstrations for a variety of characters from furries to mythological creatures.\n-Extended demonstration shows how to build a scene from initial concept drawings and character development to a final colored scene.\n-See a variety of different styles of art from guest artists who share their processes for creating lively characters.","torrent":{"xt":"urn:btih:6f973dff6a31970ea40d2869f9fb748727a97a06","amp;dn":"Draw+More+Furries-+Anthropomorphic+Fantasy+Creatures+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6f973dff6a31970ea40d2869f9fb748727a97a06","infoHashBuffer":{"type":"Buffer","data":[111,151,61,255,106,49,151,14,164,13,40,105,249,251,116,135,39,169,122,6]},"announce":[],"urlList":[]}}