{"title":"The Noble Quran (perfect e-book)","uid":3669748,"size":2140989,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6fc12a6e89411f448c6c8d706e7c3006e5e75dbe&amp;dn=The+Noble+Quran+%28perfect+e-book%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"darkman_123","files":1,"time":1177171198,"description":"7 Reasons to Read the Glorious Qur&amp;#039;an \n(1) Intimate: \n\nIt dares you to disprove it. How? It says that humans can not write a book like this even if they pooled all their resources together and got help also from the spirits. The Qur&amp;#039;an said this fourteen hundreds years ago and yet no one has been able to disprove it. Billions of books have been written - but not another one like the Qur&amp;#039;an. \n\n\n\n\n(2) Incorruptible: \n\nIt is the only religious sacred writing which has been in circulation for such a long time and yet remains as pure as it was in the beginning. The Qur&amp;#039;an was kept intact. Nothing was added to it; nothing was changed in it; and nothing was taken away from it ever since it was completely revealed 1400 years ago. \n\n(3) Unsurpassable: \n\nThe Qur&amp;#039;an is God&amp;#039;s final revelation to humankind. God revealed the Torah to Moses, the Psalms to David, the Gospel to Jesus, and finally the Qur&amp;#039;an to Muhammad. Peace be upon all of them. No other book will come from God to surpass his final revelation. \n\n(4) Indisputable: \n\nThe Qur&amp;#039;an withstands the test of time and scrutiny. No one can dispute the truth of this book. It speaks about past history and turns out right. It speaks about the future in prophecies and it turns out right. It mentions details of physical phenomena which were not known to people at the time; yet later scientific discoveries confirm that the Qur&amp;#039;an was right all along. Every other book needs to be revised to accord with modern knowledge. The Qur&amp;#039;an alone is never contradicted by a modern discovery. \n\n(5) Your Roadmap for Life and Afterlife: \n\nThe Qur&amp;#039;an is the best guidebook on how to structure your life. No other book presents such a comprehensive system involving all aspects of human life and endeavor. The Qur&amp;#039;an also points out the way to secure everlasting happiness in the afterlife. It is your roadmap showing how to get to paradise. \n\n(6) God&amp;#039;s Gift of Guidance: \n\nGod has not left you alone. You were made for a reason. God tells you why he made you, what he demands from you, and what he has in store for you. If you operate a machine contrary to it&amp;#039;s manufacture specification you will ruin that machine. What about you? Do you have an owner&amp;#039;s manual for you? The Qur&amp;#039;an is from your function for success lest you fail to function. It is a healing mercy from God. It satisfies the soul, and cleans the heart. It removes doubts and brings peace. \n\n(7) Your Calling Card to Communicate with God: \n\nHumans are social creatures. We love to communicate with other intelligent life. The Qur&amp;#039;an tells us how to communicate with the source of all intelligence and the source of all life- the One God. The Qur&amp;#039;an tells us who God is, by what name we should address God, and the way in which to communicate with God. \n\nAre these not seven sufficient reasons for reading the Qur&amp;#039;an? \n\nBy: Shabir Ali \n\n \n \n \n","torrent":{"xt":"urn:btih:6fc12a6e89411f448c6c8d706e7c3006e5e75dbe","amp;dn":"The+Noble+Quran+%28perfect+e-book%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6fc12a6e89411f448c6c8d706e7c3006e5e75dbe","infoHashBuffer":{"type":"Buffer","data":[111,193,42,110,137,65,31,68,140,108,141,112,110,124,48,6,229,231,93,190]},"announce":[],"urlList":[]}}