{"title":"The Palace of Curiosities - Rosie Garland.epub","uid":9288433,"size":676734,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:70a699c551c226455e54fa701457314c1d58dc98&amp;dn=The+Palace+of+Curiosities+-+Rosie+Garland.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1386052485,"description":"A luminous and bewitching debut novel that is perfect for fans of Angela Carter. Set in Victorian London, it follows the fortunes of Eve, the Lion-Faced Girl and Abel, the Flayed Man. A magical realism delight. Before Eve is born, her mother goes to the circus. She buys a penny twist of coloured sugar and settles down to watch the heart-stopping main attraction: a lion, billed as a monster from the savage heart of Africa, forged in the heat of a merciless sun. Mama swears she hears the lion sigh, just before it leaps...and when Eve is born, the story goes, she didn't cry - she meowed and licked her paws. When Abel is pulled from the stinking Thames, the mudlarks are sure he is long dead. As they search his pockets to divvy up the treasure, his eyes crack open and he coughs up a stream of black water. But how has he survived a week in that thick stew of human waste? Cast out by Victorian society, Eve and Abel find succour from an unlikely source. They will become The Lion Faced Girl and The Flayed Man, star performers in Professor Josiah Arroner's Palace of Curiosities. And there begins a journey that will entwine their fates forever.","torrent":{"xt":"urn:btih:70a699c551c226455e54fa701457314c1d58dc98","amp;dn":"The+Palace+of+Curiosities+-+Rosie+Garland.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"70a699c551c226455e54fa701457314c1d58dc98","infoHashBuffer":{"type":"Buffer","data":[112,166,153,197,81,194,38,69,94,84,250,112,20,87,49,76,29,88,220,152]},"announce":[],"urlList":[]}}