{"title":"Blood, Sweat &amp; Tears.The  Singles (2014)","uid":9568241,"size":303833062,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7174bed449debae7a91c2f50824815beafa323c3&amp;dn=Blood%2C+Sweat+%26amp%3B+Tears.The++Singles+%282014%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"chmeee_sk_cdn","files":-1,"time":1391563156,"description":"mp3 320\n\nBLOOD, SWEAT &amp; TEARS: The Complete Columbia Singles (2-CD Set)\nThey were a pioneering jazz-rock outfit and a hit singles band (which shows how progressive pop music got in the late '60s/early '70s) that wowed fans and critics alike. They were Blood, Sweat &amp; Tears and this two-CD, 32-track set offers not only the most comprehensive collection ever compiled of their work, but also the most appropriate lens through which to view their long and often chaotic career. Very few bands experienced the kind of turnover that Blood, Sweat &amp; Tears did and lived to tell the tale the group began with the Blues Project's Steve Katz and Al Kooper as their visionary leaders, but Kooper left after their first album, to be replaced by David Clayton-Thomas as lead singer, thus launching the band's &quot;classic&quot; period punctuated with such hits as &quot;You've Made Me So Very Happy,&quot; &quot;And When I Die&quot; and &quot;Spinning Wheel&quot; (here in their rare mono single mixes). After their fourth album, B. S. &amp; T: 4, Clayton-Thomas and original members Fred Lipsius and Dick Halligan left en masse, yet the band soldiered on, winding up with only one original member drummer Bobby Colomby by the time they called it quits with Columbia. Yet, through it all, Blood, Sweat &amp; Tears maintained a remarkably high level of musicianship and material throughout their stint with the label, and their innovative use of jazzy horn arrangements in a rock context paved the way for such bands as Chicago, Cold Blood, Chase and If. Along the way, they also integrated elements of psychedelia, R&amp;B, folk and classical music into their jazz-rock framework to produce an eclectic mix of recordings unlike that of any other band of the era. Blood, Sweat &amp; Tears: The Complete Columbia Singles follows the band through every phase and configuration, and features five single versions/mixes making their first appearance on CD. Producer Ed Osborne s notes include fresh quotes from Steve Katz, and the entire set is beautifully remastered by Vic Anesini at Battery Studios in NYC. The ultimate look at an underrated band. ","torrent":{"xt":"urn:btih:7174bed449debae7a91c2f50824815beafa323c3","amp;dn":"Blood%2C+Sweat+%26amp%3B+Tears.The++Singles+%282014%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7174bed449debae7a91c2f50824815beafa323c3","infoHashBuffer":{"type":"Buffer","data":[113,116,190,212,73,222,186,231,169,28,47,80,130,72,21,190,175,163,35,195]},"announce":[],"urlList":[]}}