{"title":"Stop Pissing Me Off: What to Do When the People You Work with Dr","uid":6054385,"size":13411831,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:71c71cf7d9efe5550f17bba95a5f695569e9efea&amp;dn=Stop+Pissing+Me+Off%3A+What+to+Do+When+the+People+You+Work+with+Dr&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MANTESH","files":3,"time":1292850570,"description":" &lt;a href=&quot;http://img94.imageshack.us/img94/6453/1593375484.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://img94.imageshack.us/img94/6453/1593375484.jpg&lt;/a&gt;\n\n\n\n\n\n\n\nStop Pissing Me Off: What to Do When the People You Work with Drive You Crazy\n\nAdams Media\nLynne Eisaguirre \n2007-10-01 \nISBN: 1593375484 \n336 pages  \nPDF \nEnglish\n12.7 MB\n\n\n&quot;If you've ever said, `My work is great except for the people,' this book is for you. Written by a pro who has been through the jungle of office wars . . . [this is] a must read for survival and triumph at work.&quot; --Bob Vanourek, former CEO of Sensormatic, a $1 billion NYSE company, former officer of Pitney Bowes, and current adjunct professor, Denver University \n\n\n&quot;Lynne Eisaguirre is an expert on issues in the workplace. This book gives practical solutions for working effectively with your colleagues, employees, and supervisor. I highly recommend Stop Pissing Me Off! as one everyday guide to conflict management and negotiation.&quot; --Diane Chaffin, director of operations, The National Conference of State Legislatures &quot;Stop Pissing Me Off! is great coworker survival guide with legal and practical advice to help any employee handle even the most challenging people.&quot; --Milo Sindell and Thuy Sindell, founders of Hit The Ground Running and authors of Sink or Swim: New Job, New Boss, 12 Weeks to Get it Right If you feel like you're about to hit your limit--or your annoying clients, coworkers, or boss--Stop Pissing Me Off! is your book. Written by CNN Headline News contributor and former employment attorney Lynne Eisaguirre, Stop Pissing Me Off! gives you the essential, no-nonsense advice you need to negotiate conflicts and deal with problem people in the workplace. Has bad behavior gone from annoying to over the line? Should you call HR or an attorney--or just suck it up? Inside this book you'll find out the underlying reasons for difficult people and learn how to manage those difficulties effectively, work productively with a diverse workforce, and transform misery into productivity. It's time to turn down the drama meter, get cooperation from people you otherwise can't stand, and, most importantly, stay cool when work gets too hot to handle!.........................\n\n\n[/color][/b]","torrent":{"xt":"urn:btih:71c71cf7d9efe5550f17bba95a5f695569e9efea","amp;dn":"Stop+Pissing+Me+Off%3A+What+to+Do+When+the+People+You+Work+with+Dr","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71c71cf7d9efe5550f17bba95a5f695569e9efea","infoHashBuffer":{"type":"Buffer","data":[113,199,28,247,217,239,229,85,15,23,187,169,90,95,105,85,105,233,239,234]},"announce":[],"urlList":[]}}