{"title":"RealtimeBondage--Training of H  Hazel Hypnotic Part 1-8","uid":10296826,"size":8047282757,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:71e132966577b6bc25f2fc95e4749af682856a5a&amp;dn=RealtimeBondage--Training+of+H++Hazel+Hypnotic+Part+1-8&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"merzedes","files":-1,"time":1401926025,"description":"Here is the complete 8 part Training of H | Hazel Hypnotic from RealtimeBondage.\n\nWhen it was released we only had the WMV's but now we have em all and here they are.\n\n\nHD WMV, iPod and HD MP4 + Pics for all 8 parts.\n\nEnjoy :D\n\n\nTraining of H Part 1 | Hazel Hypnotic\n\nOctober 16, 2012\n\nHazel Hypnotic volunteered for an experience that every submissive woman dreams about. We took full possession of her for 24 hours. It gave us a chance to get to know her like no one else has. Every detail about her became significant because we had so much time and so many wonderful plans for her. \n\nAt first we were content to let her hang around. Hazel had on a beautiful little dress that we slowly took away to reveal her fantastic body. She keeps herself fit, which is good, because the following 24 hours took every bit of her strength and endurance to survive. \n\nScreens &lt;a href=&quot;\nhttp://www.realtimebondage.com/live/bondage/2012/10_16hazel4/RealtimeBondage-Hazel-Hypnotic-PD-Elise-Graves-Training-of-H.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.realtimebondage.com/live/bondage/2012/10_16hazel4/RealtimeBondage-Hazel-Hypnotic-PD-Elise-Graves-Training-of-H.php&lt;/a&gt;\n\n\nTraining of H Part 2 | Hazel Hypnotic\n            \nOctober 20, 2012\n\nHazel Hypnotic once remarked to us that she dreamed of being put upon a pedestal. What that dream probably did not include was being gagged with her own hair and made to masturbate live for all of our members. Even worse, she did not expect it to be covered with spikes soon after she got comfortable. It is a test of endurance, to see how long she can stand it, and it will not be the last one she suffers over the next 24 hours. \n\nIn fact, a few minutes later we have another distressing idea. Hazel is a smoker and we want to show her what a disgusting habit it is. We take a pair of cigarettes and put them up her nose. She will need to finish them both before we will be ready to move on. Every breath she takes comes with the acrid scent and burning sensation of smoke. \n\nAnd the next treatment is even nastier. Clothes pins are a double edged sword. When you put them on they pinch so hard that they cut off the blood supply and make the area go numb. As soon as they are removed the blood comes rushing back, bringing a wave of intense sensation with it. \n\nScreens &lt;a href=&quot;\nhttp://www.realtimebondage.com/live/bondage/2012/10_20hazel5/RealtimeBondage-Hazel-Hypnotic-PD-Elise-Graves-Training-of-H-Part-Two.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.realtimebondage.com/live/bondage/2012/10_20hazel5/RealtimeBondage-Hazel-Hypnotic-PD-Elise-Graves-Training-of-H-Part-Two.php&lt;/a&gt;\n\n\nTraining of H Part 3 | Hazel Hypnotic\n           \nOctober 23, 2012\n\nIn times long passed the strappado was one of the most feared forms of torment. The arms, once brought up behind the body, put an incredible amount of stress on the shoulders. Many girls have trouble maintaining the position at all. Hazel Hypnotic got lifted up by it. \n\nFor the brief time she was in the air her shoulders felt like they may come lose, but the real pain was still forthcoming. She was placed down on a crotch-horse that allowed all of her weight to rest upon her pussy. To give herself any relief all she had to do was pull herself up, straining against her brutal bondage again. \n\nWe did eventually move her hands to a more comfortable position, but only because it gave PD better access with the whip. And when we have decided that she has held herself up with her arms for long enough there is always a collar we can use that will keep her in place just as well. \n\nScreens &lt;a href=&quot;\nhttp://www.realtimebondage.com/live/bondage/2012/10_23hazel6/RealtimeBondage-Hazel-Hypnotic-PD-Elise-Graves-Training-of-H-Part-Three.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.realtimebondage.com/live/bondage/2012/10_23hazel6/RealtimeBondage-Hazel-Hypnotic-PD-Elise-Graves-Training-of-H-Part-Three.php&lt;/a&gt;\n\n\nTraining of H Part 4 | Hazel Hypnotic\n            \nOctober 27, 2012\n\nHazel Hypnotic told us she was tired right around the 6 hour mark of our live feed. She has 18 more hours to suffer through but we figure she should be allowed to get in a quick nap before the torment continues. We are just merciful like that. \n\nOr we saw a completely new way to get inside of her head. Her sleeping bag is as tight as they get, a sack, really, with several straps to keep her from moving about. A hood blacks out the room for her. She would be able to sleep quite peacefully if we were willing to let her. \n\nThere are little ports that we can use to access her tits, perfect for attaching electrodes, in fact. The stimulus makes her cry out quite a few times. We don't even have to sit there and monitor her. PD just hooks it to an automatic timer and her persistent exclamations let us know that it is still working. \n\nScreens &lt;a href=&quot;\nhttp://www.realtimebondage.com/live/bondage/2012/10_27hazel7/RealtimeBondage-Hazel-Hypnotic-PD-Elise-Graves-Training-of-H-Part-Four.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.realtimebondage.com/live/bondage/2012/10_27hazel7/RealtimeBondage-Hazel-Hypnotic-PD-Elise-Graves-Training-of-H-Part-Four.php&lt;/a&gt;\n\n\nTraining of H Part 5 | Hazel Hypnotic\n            \nOctober 30, 2012\n\nEveryone needs rest. It is hard for Hazel Hypnotic to keep on going when we are so persistent in wearing her out. We give her a bit of time to sleep, a few hours of a nap while we collect our thoughts, then wake her up with a bucket full of water to the face. \n\nShe is barely conscious when we move on to the next set of entertaining torments. We will wake her up pretty quickly, though. Once the adrenaline begins to flow she will perk right up. The first few whip lashes bring her back to the real world. Once she is all the way with us again we have a few needs that she needs to meet. \n\nPD wants his cock sucked. The members want to see some more tears. The rest of our crew just wants to make her scream. The stocks we stick her feet in give us a good chance to work her over. It makes for a bit of a rude awakening, but if we were really all that concerned with how she felt we wouldn't be doing our job. \n\nScreens &lt;a href=&quot;\nhttp://www.realtimebondage.com/live/bondage/2012/10_30hazel8/RealtimeBondage-Hazel-Hypnotic-PD-Elise-Graves-Training-of-H-Part-Five.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.realtimebondage.com/live/bondage/2012/10_30hazel8/RealtimeBondage-Hazel-Hypnotic-PD-Elise-Graves-Training-of-H-Part-Five.php&lt;/a&gt;\n\n\nTraining of H Part 6 | Hazel Hypnotic\n            \nNovember 3, 2012\n\nWhen people see pain coming they always brace for it. It helps them absorb the blows a bit. But when they are completely blind and so many parts of their body are exposed there is no way to prepare. That is the situation Hazel Hypnotic finds herself in when PD hooks electrodes to her pussy, ties her toes so that he can cane her feet, and sits her down so her tits are exposed. \n\nThe iron case surrounding her skull is like an echo chamber. To us it may muffle her screams a bit, but for her each one rings back into her ears, louder than ever. The darkness, combined with the incredible sound, intensifies the terror of the unknown. \n\nIt may seem counter intuitive to deny ourselves the pleasure of seeing her reactions and the ability to fuck with her pretty little face. But there is a method to our madness. When we let some light in she will be grateful. It will make her think things may get better. Taking that hope from her will hurt more than any other toy we have handy.\n\nScreens &lt;a href=&quot;\nhttp://www.realtimebondage.com/live/bondage/2012/11_03hazel9/RealtimeBondage-Hazel-Hypnotic-PD-Elise-Graves-Training-of-H-Part-Six.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.realtimebondage.com/live/bondage/2012/11_03hazel9/RealtimeBondage-Hazel-Hypnotic-PD-Elise-Graves-Training-of-H-Part-Six.php&lt;/a&gt;\n\n\nTraining of H Part 7 | Hazel Hypnotic\n            \nNovember 6, 2012\n\nHazel Hypnotic isn't even done with her 24 hour live feed but we have to go over some things with her. Her sins are numerous and she is going to have to answer for them. We have a special guest on hand and he is going to air his grievances all over her body. \n\nHer cheeks are beet red after the barrage of slaps that he rains down on her. Her face is slick from his spit and her tears. She is crying as she tries to choke out the words he is telling her to say, both from the intensity of the humiliation and the pain of her situation. She has failed to satisfy our members so far. \n\nOur next demand is probably the most taxing so far, so it is a good thing we have mentally prepared her. She swears she will last for this one. When we apply the clamps to her tits she insists she can bear it. When we attach the electrodes to them she doesn't even hesitate. And when she is done screaming for the intense electrical shocks she tells us, without a doubt, that she can take even more. That is when the current switches to her cunt and she regrets opening her mouth.\n\nScreens &lt;a href=&quot;\nhttp://www.realtimebondage.com/live/bondage/2012/11_06hazel10/RealtimeBondage-Hazel-Hypnotic-PD-Elise-Graves-Training-of-H-Part-Seven.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.realtimebondage.com/live/bondage/2012/11_06hazel10/RealtimeBondage-Hazel-Hypnotic-PD-Elise-Graves-Training-of-H-Part-Seven.php&lt;/a&gt;\n\n\nTraining of H Part 8 | Hazel Hypnotic\n           \nNovember 10, 2012\n\nTwo things about Hazel Hypnotic are wrong at this point. First off, she has a shit eating grin on her face, like nothing could possibly phase her. Second, she thinks she is ready for the punishment we are about to dish out next. That means it is time for some corrective measures. \n\nHer ass is going to look like raw meat by the time MWB finishes working it over. He has more than enough familiarity with that cane to leave his mark. \n\nOutside Elise Graves has another way of leaving impression. She has a couple of gallons of water that she wants Hazel to hold onto. Every drop she spills she is going to regret, but it is so difficult to keep it in when her ass is being reamed with such a vengeance. \n\nScreens &lt;a href=&quot;\nhttp://www.realtimebondage.com/live/bondage/2012/11_10hazel11/RealtimeBondage-Hazel-Hypnotic-PD-Elise-Graves-Training-of-H-Part-Eight.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.realtimebondage.com/live/bondage/2012/11_10hazel11/RealtimeBondage-Hazel-Hypnotic-PD-Elise-Graves-Training-of-H-Part-Eight.php&lt;/a&gt;\n\n14 000 down, but how much more to come ?? You decide ;) \n\nThe more you appreciate it, the more we want to do it. Can we get to 15k ??? \n\nWell, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)\n\n\nAny Questions ?? Read our FAQ!!\n &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-)  \n\n\n\n","torrent":{"xt":"urn:btih:71e132966577b6bc25f2fc95e4749af682856a5a","amp;dn":"RealtimeBondage--Training+of+H++Hazel+Hypnotic+Part+1-8","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71e132966577b6bc25f2fc95e4749af682856a5a","infoHashBuffer":{"type":"Buffer","data":[113,225,50,150,101,119,182,188,37,242,252,149,228,116,154,246,130,133,106,90]},"announce":[],"urlList":[]}}