{"title":"Evil Angel: Face Fucking Inc. 11 XXX DVDRip [Split Scenes]","uid":12121594,"size":2202592047,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:722f74e472c9bc50738c8595a89dbdf62ea76584&amp;dn=Evil+Angel%3A+Face+Fucking+Inc.+11+XXX+DVDRip+%5BSplit+Scenes%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Ctrlme","files":18,"time":1436833706,"description":"Evil Angel: Face Fucking Inc. 11 XXX DVDRip [Split Scenes]\n---------------------------------------\nScreenshot(s):   &lt;a href=&quot;\nhttp://imgctrl.com/image/AzH&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgctrl.com/image/AzH&lt;/a&gt; &lt;a href=&quot;\nhttp://imgctrl.com/image/AzZ&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgctrl.com/image/AzZ&lt;/a&gt; &lt;a href=&quot;\nhttp://imgctrl.com/image/Azi&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgctrl.com/image/Azi&lt;/a&gt; &lt;a href=&quot;\nhttp://imgctrl.com/image/Azq&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgctrl.com/image/Azq&lt;/a&gt; &lt;a href=&quot;\nhttp://imgctrl.com/image/Azx&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgctrl.com/image/Azx&lt;/a&gt; &lt;a href=&quot;\nhttp://imgctrl.com/image/Az6&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgctrl.com/image/Az6&lt;/a&gt; &lt;a href=&quot;\nhttp://imgctrl.com/image/AzB&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgctrl.com/image/AzB&lt;/a&gt; &lt;a href=&quot;\nhttp://imgctrl.com/image/AzI&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgctrl.com/image/AzI&lt;/a&gt; &lt;a href=&quot;\nhttp://imgctrl.com/image/AzL&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgctrl.com/image/AzL&lt;/a&gt; &lt;a href=&quot;\nhttp://imgctrl.com/image/AzU&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgctrl.com/image/AzU&lt;/a&gt;\n\nDirected By\nJoey Silvera\nStarring\nAngel Vain, Bill Bailey, Chastity Lynn, Cheyenne Jewel, Claudio Meloni, Jessie Andrews, Joey Silvera, Julia Ann, Jynx Maze, Katie St. Ives\nCategories\nAss, Big Dick, Big Tits, Black, Blonde, Blowbang, Blowjob, Brunette, Bubble Butt, College\nIn Joey Silvera's Face Fucking Inc 11, the byword is &quot;Xtreme,&quot; which isn't even a real word - that's how extreme it is! Nine of today's sweetest porn babes open their hearts, mouths and throats to huge, invading cocks, swallowing their pride and overcoming any vestige of a gag reflex in order to please their men. Door-to-door cookie scout Leslie Sierra shows up at Joey's house in a cute uniform, her short skirt showing off her smooth, brown legs. Joey films the petite, all-natural Latina stripping and sucking his cock to the root in a wet, gooey blow job. Tiny Sierra licks balls and earns herself a cum facial. In stockings, garters and a rubber bondage mask, busty Julia Ann is fondled by tattooed stud Tone Capone. He fucks her wet mouth through the hole, and the compliant MILF kneels to service his big, black cock. The blonde legend takes care \n\nJoey Silvera`s newest gagfest delivers nine cooperative cocksucking cuties who deep-throat, spit, gag, slobber and submissively stay put while some of the biggest dicks in porn slam and cram meat down their gullets with such force that one quickly realizes this is about the challenge. The women delight in having their nostrils sealed shut in order to show off their breath control credentials. The whole affair is a real tear jerker, as evidenced by the parade of pretty faces streaming with mascara mixed with saliva and sweat. The disc includes photo galleries, cast list, filmographies, and trailers.The women are a diverse lot: Blonde, blue-eyed MILF beauty Julia Ann dons a latex hood and black lingerie to match the black cock that she inhales with a skill becoming one of porn`s true veterans. Big-titted Angel Vain teases Joey as a prelude to her session with the master. Mr. Silvera also treats himself (and us) to a couple of raven haired face fuckees in the form of a fish-netted Cheyenne Jewel and smiling slut Leslie Sierra.Black stud Tone Capone, fresh from his workout with Julia Ann, follows with a deep insertion on petite Katie St. Ives. His cock is as big as her forearm, and yet she takes it like a hungry hussy. She literally makes love to every inch of it, paying extra special attention to his dark ball sack with a joy that is a sight to behold. Like the legendary Linda Lovelace, she must have her clitoris in her throat, because she manages to gag and cum simultaneously just from the sensation of having her mouth and throat filled to the brim.Claudio Meloni wins the Luckiest Face Fucker award since he`s in three out of eight scenes. He warms up with the misnamed Chastity Lynn; gets two lovely mouths on his dick from dirty blondes Lily Carter and Jessie Andrews; and finally shares duties as part of the unholy trinity of men who gang-bang the amazing Jynx Maze, Evil Angel`s latest it girl, in a cum-soaked face fucking finale. Clocking in (cocking in?) at over three hours, Face Fucking Inc. 11 embodies the creed Joey demands from his women: Cooperation","torrent":{"xt":"urn:btih:722f74e472c9bc50738c8595a89dbdf62ea76584","amp;dn":"Evil+Angel%3A+Face+Fucking+Inc.+11+XXX+DVDRip+%5BSplit+Scenes%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"722f74e472c9bc50738c8595a89dbdf62ea76584","infoHashBuffer":{"type":"Buffer","data":[114,47,116,228,114,201,188,80,115,140,133,149,168,157,189,246,46,167,101,132]},"announce":[],"urlList":[]}}