{"title":"Rex Libris","uid":7275765,"size":124458273,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:731b4c1f258991c330eb03e399dd03e8b5d5bffb&amp;dn=Rex+Libris&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"SmokeBogey","files":-1,"time":1337275024,"description":"The series follows the adventures of Rex Libris, the Head Librarian at the Middleton Public Library. Unbeknownst to the general public, Rex is actually over a thousand years old, and was the original librarian at the Library of Alexandria. He is a member of the Ordo Biblioteca, a secret international society of librarians. With the aid of the ancient god Thoth, who lives beneath the Library, Rex travels to the farthest reaches of the universe to collect late book fees, and to fight the powers of ignorance and darkness.\n\nFollow the story of Rex Libris, the tough-as-nails Head Librarian at Middleton Public Library, and his unending struggle against the forces of darkness. Wearing his distinctive, super-thick bottle glasses and armed with an arsenal of powerful weapons, he strikes fear into recalcitrant borrowers, and can take on virtually any foe, from loitering zombies to fleeing alien warlords who refuse to pay their late fees. Nowhere is beyond his reach, thanks to the use of teleportation crystals (powered with pseudo-science) capable of instantly transporting Rex to the farthest corners of the universe. Even the occasional infestation of rogue, public domain literary characters in the library are dispatched with aplomb. With fists of steel and mind as sharp as a tack, Rex is a true guardian of knowledge, foe of the foolish, defender of the Dewey Decimal System, and the best hope for the future of civilization.","torrent":{"xt":"urn:btih:731b4c1f258991c330eb03e399dd03e8b5d5bffb","amp;dn":"Rex+Libris","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"731b4c1f258991c330eb03e399dd03e8b5d5bffb","infoHashBuffer":{"type":"Buffer","data":[115,27,76,31,37,137,145,195,48,235,3,227,153,221,3,232,181,213,191,251]},"announce":[],"urlList":[]}}