{"title":"Cheating (US) (1987)","uid":14483703,"size":305707355,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:7344c3a629cc675c46dcbb4badac65c18347eb69&amp;dn=Cheating+%28US%29+%281987%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"distinc","files":1,"time":1462047583,"description":"...::ScreenShots::...\r\n \nhttp://imagedisco.net/?v=2570017632\r\n \nhttp://imagedisco.net/?g=3755485858\r\n\r\n\r\nPlot:\r\n\r\nTom Byron and Ron Jeremy think they're Redford and Newman in The Sting. They cheat Paul Thomas out of a bundle of hard, cold cash during a card/sex game, using the incredible Elle Rio as their pawn. To celebrate, these two lowlifes decide to pick up a couple of white chicks at the local spa and get caught. . .cheating. . .by wives Nina Hartley and Jeanna Fine. So the girls throw the guys out in the tradition of the best Flintstones episode and eventually lure them back using pool table sex. . . not in the tradition of the best Flintstones episode. (For the record, Ron Jeremy would play Fred and Tom Byron would play Barney.) Then everybody lusts happily ever after, trying to create heat in a tape-ending four-way. Before we see S.E.V.P.'s traditional bloopers at the end, director Stuart Canterbury crams a lot of sex into one compact feature. The promising story begins to take a nosedive as the demand for eroticism is met. The highlight, I think, involves Nina Hartley in a luscious lesbo number with buxom Keisha, after Nina catches Jeremy with her oversized melonloaves. And there's some great underwater videography as Jeremy steals Keisha's bathing suit bottoms. In addition, Billy Dee with Angel Kelly and Nina; Byron with petite Patti Petite and Rio's indescribable gobbling of both Byron and Thomas highlight this erotically entertaining video. The camerawork, editing, sound reproduction and video quality all live up to today's standards in a sexvid that even my jaded self can recommend","torrent":{"xt":"urn:btih:7344c3a629cc675c46dcbb4badac65c18347eb69","amp;dn":"Cheating+%28US%29+%281987%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7344c3a629cc675c46dcbb4badac65c18347eb69","infoHashBuffer":{"type":"Buffer","data":[115,68,195,166,41,204,103,92,70,220,187,75,173,172,101,193,131,71,235,105]},"announce":[],"urlList":[]}}