{"title":"The Golden Condom (2016).epub Gooner","uid":15017204,"size":660449,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:736e6e8cf8bdb0e4fd764ff7f1388ed79b101204&amp;dn=The+Golden+Condom+%282016%29.epub+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1466456292,"description":"The Golden Condom - And Other Essays on Love Lost and Found (2016).epub Gooner\r\n\r\nPublisher: Picador (13 May 2016)\r\nLanguage: English\r\nISBN-10: 125005575X\r\nISBN-13: 978-1250055750\r\n\r\nDr. Jeanne Safer has dedicated much of her decades' long career in psychotherapy to exploring taboo subjects that we all think about in private but seldom discuss in public. From conflicted sibling relationships to the choice not to have children, Safer's work has always been unflinching in its aim to dive deep into topics that make most of us blush, but which are present in all of our lives. \r\n\r\nIn The Golden Condom, Safer turns her sharp and fearless eye to a subject perhaps more universal than any other - love in all its permutations. In The Golden Condom Safer interweaves her own experiences with those of a variety of memorable people, including her patients, telling a series of tales that investigate relationships - both healthy and toxic - that most of us don't escape life without experiencing at least once, including traumatic friendships, love after loss, unrequited or obsessional love and more. \r\n\r\nNever prescriptive and always entertaining, these stories will demolish any suspicion you might have that you're alone in navigating a turbulent romantic life, and will inspire you with the range of possibilities that exist to find love, however unconventional, and at any age. For readers of Stephen Grosz and Mark Epstein","torrent":{"xt":"urn:btih:736e6e8cf8bdb0e4fd764ff7f1388ed79b101204","amp;dn":"The+Golden+Condom+%282016%29.epub+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"736e6e8cf8bdb0e4fd764ff7f1388ed79b101204","infoHashBuffer":{"type":"Buffer","data":[115,110,110,140,248,189,176,228,253,118,79,247,241,56,142,215,155,16,18,4]},"announce":[],"urlList":[]}}