{"title":"Magic Legend of the Leprechauns(2001).NLsub.NLT-Release (DIVx)","uid":4754938,"size":1720332888,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:73df217bb5ce8b30163e43dc4673235f22651d86&amp;dn=Magic+Legend+of+the+Leprechauns%282001%29.NLsub.NLT-Release+%28DIVx%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"diddle783","files":-1,"time":1236401873,"description":"Tijdsduur: 240 minuten\nJaar Release 2001\nCast Randy Quaid, Whoopi Goldberg, Roger Daltrey, Colm Meaney, Kieran Culkin, ZoÃƒÂ« Wanamaker \nRegisseur: John Henderson \n\nZakenman Jack Woods is voor zijn werk op bezoek in Ierland. Zijn eerste avond logeert hij in een klein huisje en ziet daar plotseling een dwerg. Jack gelooft zijn ogen niet, maar de volgende dag ziet hij de dwerg bijna verdrinken in de rivier. Jack redt de dwerg, die Muldoon heet, en ze sluiten vriendschap. Jack komt te weten dat de dwergen ervoor moeten zorgen dat de seizoenen wisselen. De elfen zijn hun aartsvijanden, want zij maken teveel natuur en gebruiken teveel bladeren. Ze veroorzaken daarmee veel werk voor de dwergen, maar tot een gevecht kan het niet komen, want dat heeft De Grote Banshee verboden... Dan weet Mickey, de zoon van Muldoon, stiekem binnen te komen op een elfenfeest en wordt hals over kop verliefd op de mooie prinses Jessica, de dochter van de elfenkoning Boric. Jessica is echter uitgehuwelijkt aan Graaf Grogin. Mickey's vriend Barney besluit een handje te helpen en raakt in gevecht met de graaf. De Grote Banshee ziet zich genoodzaakt om in te grijpen en laat Barney verdwijnen. Boric zweert wraak en er dreigt een oorlog uit te breken. Terwijl de dwergen Jack in hun leger rekruteren, gaat Mickey op zoek naar zijn geliefde die spoorloos is verdwenen. Uiteindelijk lijkt alles af te hangen van de liefde tussen Mickey en Jessica...\n\nVoor de nieuwste films en muziek ga je naar NLT.Ons-Forum het forum voor de Nederlands Ondertitelde/Gesproken Torrents:\n &lt;a href=&quot;\nhttp://www.nlt.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.nlt.ons-forum.nl&lt;/a&gt;\n\nVeel plezier met deze Film!! ","torrent":{"xt":"urn:btih:73df217bb5ce8b30163e43dc4673235f22651d86","amp;dn":"Magic+Legend+of+the+Leprechauns%282001%29.NLsub.NLT-Release+%28DIVx%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"73df217bb5ce8b30163e43dc4673235f22651d86","infoHashBuffer":{"type":"Buffer","data":[115,223,33,123,181,206,139,48,22,62,67,220,70,115,35,95,34,101,29,134]},"announce":[],"urlList":[]}}