{"title":"Christopher Cullen - Bonaventure (Great Medieval Thinkers)(pdf)","uid":8541941,"size":2199599,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:73f3437ca71729cecf0b4c89c804c1c8737d0382&amp;dn=Christopher+Cullen+-+Bonaventure+%28Great+Medieval+Thinkers%29%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pharmakate","files":-1,"time":1370416244,"description":"Christopher Cullen - Bonaventure (series: Great Medieval Thinkers)(Oxford UP, 2006). 251 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\n\nOverview of the thought of the great medieval scholastic NOT named Thomas Aquinas.\n\ndescription:\n\nThe great Franciscan theologian St. Bonaventure (c.1217-74) engaged in philosophy as well as theology, and the relation between the two in Bonaventure's work has long been debated. Yet, few studies have been devoted to Bonaventure's thought as a whole. In this survey, Christopher M. Cullen reveals Bonaventure as a great synthesizer, whose system of thought bridged the gap between theology and philosophy.\n\nThe book is organized according to the categories of Bonaventure's own classic text, De reductione artium ad theologiam. Cullen follows Bonaventure's own division of the branches of philosophy and theology, analyzing them as separate but related entities. He shows that Bonaventure was a scholastic, whose mysticism was grounded in systematic theological and philosophical reasoning. He presents a fresh and nuanced perspective on Bonaventure's debt to Augustine, while clarifying Aristotle's influence. Cullen also puts Bonaventure's ideas in context of his time and place, contributing significantly to our understanding of the medieval world.\n\nThis accessible introduction provides a much-needed overview of Bonaventure's thought. Cullen offers a clear and rare reading of &quot;Bonaventurianism&quot; in and for itself, without the complications of critique and comparison. This book promises to become a standard text on Bonaventure, useful for students and scholars of philosophy, theology, medieval studies, and the history of Christianity.\n\nReview\n\n&quot;A learned and judicious introduction to the philosophical and theological thought of Bonaventure.&quot; --Times Literary Supplement\n\nAbout the Author\n\nChristopher M. Cullen is Associate Professor of Philosophy at Fordham University.\n\n-----\n\nnote: With any luck this will be the first of many Bonaventure torrents.","torrent":{"xt":"urn:btih:73f3437ca71729cecf0b4c89c804c1c8737d0382","amp;dn":"Christopher+Cullen+-+Bonaventure+%28Great+Medieval+Thinkers%29%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"73f3437ca71729cecf0b4c89c804c1c8737d0382","infoHashBuffer":{"type":"Buffer","data":[115,243,67,124,167,23,41,206,207,11,76,137,200,4,193,200,115,125,3,130]},"announce":[],"urlList":[]}}