{"title":"Total Marvel Week of 2/12/2014 (darkhomr) [TPB]","uid":9617905,"size":567334981,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:75b39b2bcce3a3315c67216d3b1e5bab978435b3&amp;dn=Total+Marvel+Week+of+2%2F12%2F2014+%28darkhomr%29+%5BTPB%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dadrkhomr","files":15,"time":1392441699,"description":"Each week I will be posting the current week's Marvel titles These are the titles for February 12, 2014. \n\n Included in this pack will be all Marvel comics and Marvel NOW comics. What will NOT be included is Disney stuff, TV stuff, and the kids books. Those will be included (when available) in my Zero Day pack.\n\n My release packs are as follows: \n DC Universe 52 (Wednesdays based on scanners release times, but not later than Friday morning)\n Marvel NOW! (Marvel Comics in the NOW! universe will be released Wednesdays, based on scanners release times)\n Total Marvel (All Marvel Universe comics, released on Friday, based on scanners release times)\n Independent Comics (Non-DC Universe and Major Independent comics, released between Sunday and Monday morning)\n Starhome Scanners (Scans and edits from the members of the Starhome group)\n DC Monthly (all DC Universe comics for the month, released the first Friday after the end of the month)\n Total Marvel Monthly (all Marvel Universe comics, released the first Tuesday after the end of the month)\n\n\n\n[IMG]http://i1231.photobucket.com/albums/ee510/darkhomr/avengers26_zps8f24baf5.jpg[/IMG] [IMG]http://i1231.photobucket.com/albums/ee510/darkhomr/xfactor1_zps4bb23159.jpg[/IMG]  [IMG]http://i1231.photobucket.com/albums/ee510/darkhomr/sh1_zps7575f6b3.jpg[/IMG] [IMG]http://i1231.photobucket.com/albums/ee510/darkhomr/rqdh21_zps46d9fa3c.jpg[/IMG] [IMG]http://i1231.photobucket.com/albums/ee510/darkhomr/wintersoldier1_zps3fe2166d.jpg[/IMG] \n\n\nAll New X-Factor #3 (CBR 2/12/2014)\n\n&quot;Not Brand X&quot; The All-New X-Factor is meant to help people . . .But which one of their own has a secret?  Hint: It's Gambit. \n\nAll New X-Men #23 (CBR 2/12/2014)\n\n&quot;THE TRIAL OF JEAN GREY&quot; PART 3! Jean is on trial and it's up to the All-New X-Men and Guardians of the Galaxy to get her free. \n\nAvengers #26 (CBR 2/12/2014)\n\n&quot;ADAPT OR DIE&quot; The science war overtakes the world(s). The All-New Avengers Strike Back! All the answers to the questions you wished remained hidden. The collision of Avengers and New Avengers is imminent.\n\nDeadpool #23 (CBR 2/12/2014)\n\nYeah, no description.  \n\nRevolutionary War Deaths Head II #1 (CBR 2/12/2014)\n\nummmmmm......nothing to see here.\n\nKick-ass 3 #6 (of 8) (CBR 2/12/2014)\n\nIt's the flashback issue you've all been waiting for: The secret origin of Hit-Girl! Training, first blood, and of course, lots of hugs and positive reinforcement from Big Daddy. Exactly how does little Mindy McCready earn her assassin stripes? Hint: It ain't by collecting stickers. This issue will be extra-sized for extra awesome! \n\nMarvel Knights X-Men #4 (of 5) (CBR 2/12/2014)\n\nAll the X-men intended to do was locate two young mutants and keep them from harm's way. But now, scattered, manipulated and fighting themselves, the X-Men must get their act together and save an entire town! Can the X-Men stand against an army of villains ripped from their own minds?! \n\nShe-hulk #1 (CBR 2/12/2014)\n\nJENNIFER WALTERS IS THE SHE-HULK! A stalwart Avenger, valued member of the FF, savior of the world on more than one occasion, she's also a killer attorney with a pile of degrees and professional respect. A 7-foot-tall drink of cool, emerald water, she's tough enough to knock out Galactus with one punch (possibly?) and has a heart bigger than the moon. But juggling cases and kicking bad guy butt is starting to be a little more complicated than she anticipated. With a new practice, a new paralegal and a mounting number of super villains she's racking up as personal enemies, She Hulk might have bitten off a little more than she can chew... but she just calls that that Tuesday. \n\nSuperior Spider-Man #27 (CBR 2/12/2014)\n\n&quot;Goblin Nation&quot; #1 (of 5) The so-called Superior Spider-Man has failed. Under his watch, the Green Goblin took control of New York's underworld. This is all Otto Octavius' fault. Now it's his responsibility to take the Goblin down. Win or lose, this shall be Otto's greatest battle. Whatever you do, don't miss the first chapter of the biggest event in the entire Superior Spider-Man Saga! The End starts here. Superior Spider-Man versus . . . THE GOBLIN NATION! \n\nThor God Of Thunder #19 (CBR 2/12/2014)\n\nTHE LAST DAYS OF MIDGARD begin NOW! Thor, Asgardian God of Thunder, has always fought to save his adopted home of Earth. But who can he fight when the planet itself is dying? Thor's mortal ally and environmental secret agent Roz Solomon has a few ideas. Namely the world's largest and most nefarious energy company Roxxon, and its ruthless new CEO known as &quot;The Minotaur.&quot; Has the God of Thunder finally met his match, in the form of a multinational super-corporation? Meanwhile, many millennia ahead, a future version of Thor faces a very different battle to save what remains of the earth--a battle against the greatest villain the Marvel Universe has ever known-Galactus, the Devourer of Worlds! \n\nWinter Soldier Bitter March #1 (of 5) (CBR 2/12/2014)\n\n1966: With Nick Fury missing, and presumed dead, global espionage agency S.H.I.E.L.D. sends secret agent Ran Shen to collect two Nazi scientists with the key to defining who wins the Cold War. But the Americans are not the only ones who want the high value scientists. The Soviets have opened the Red Room, releasing their most dangerous operative --The Winter Soldier, who unbeknownst to the world, is the presumed-dead partner of Captain America-Bucky Barnes! The brainwashed soldier's mission: to acquire the scientists by any means or to kill them should they fall into American hands. This classic 60's style, high-octane, spy pulp told at Cold War's peak follows Ran Shen and his terrified scientists as they creep out of the shadow of East Berlin. Intrigue, adventure, romance and murder abound with ramifications that will shatter relationships in the modern-day Marvel Universe-including one with the Star Spangled Avenger himself! \n\nX-Force #1 (CBR 2/12/2014)\n\nAlmost every sovereign state in the Marvel Universe makes use of sanctioned superhumans to protect national interests and pursue a covert agenda. The United States has the Secret Avengers. The United Kingdom has MI13. And mutantkind has X-FORCE. In this dirty, secret, no-holds-barred, deadly game of superhuman black ops, veteran X-Man Cable and his team will spy, torture, and kill to ensure that the mutant race not only has a place in the world . . . but also a stake in it. \n\nX-Men Legacy #24 (CBR 2/12/2014)\n\n'FOR WE ARE MANY' CONCLUSION! Collapsing under the weight of his dead father' disappointment, Legion's god-like powers spiral out of control, leaving the fate of mutantkind in the balance. To what ends will Legion go to save the world from himself? This is it. This is the end. Anything can happen... \n","torrent":{"xt":"urn:btih:75b39b2bcce3a3315c67216d3b1e5bab978435b3","amp;dn":"Total+Marvel+Week+of+2%2F12%2F2014+%28darkhomr%29+%5BTPB%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"75b39b2bcce3a3315c67216d3b1e5bab978435b3","infoHashBuffer":{"type":"Buffer","data":[117,179,155,43,204,227,163,49,92,103,33,109,59,30,91,171,151,132,53,179]},"announce":[],"urlList":[]}}