{"title":"Maynard Ferguson - 2006 - M.F. Horn 3, 4 and 5 Live At Jimmy's F","uid":8436469,"size":604668264,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:763a0ea1d0ca4b9cf4b4b24fc1e0f9a1df616294&amp;dn=Maynard+Ferguson+-+2006+-+M.F.+Horn+3%2C+4+and+5+Live+At+Jimmy%27s+F&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"eika256","files":-1,"time":1367652666,"description":"Maynard Ferguson - 2006 - M.F. Horn 3, 4 and 5 Live At Jimmy's FLAC\n\nSome jazz purists are still whining about records made during the 1970s by Canadian trumpeter Maynard Ferguson, damning him with faint praise and acting righteously indignant as if jazz and pop haven't fed off of each other since before the First World War. Recorded in 1973 both in London and New York while Ferguson was wrapping up his five-year residency in England and preparing to reestablish himself in the U.S., the music on this album is an exciting reminder of just how diverse the music scene really was during the early to mid-'70s, even if pigeonholers didn't yet have a controllable category for some of the sounds that were in the air at that time. Bear in mind what Donald Byrd, Brother Jack McDuff, Miles Davis, Yusef Lateef, Freddie Hubbard, Rahsaan Roland Kirk, and dozens of other major modern musicians were up to during that same time period. The fact that Ferguson and his keyboardist, Pete Jackson, were actively combining jazz with elements of pop, rock, and funk hardly seems objectionable from a 21st century standpoint. If during the late '70s and early '80s Ferguson attempted to ensure his own financial stability by making records that would appeal to an even wider audience -- that was his choice. As for the music on this album, it's much better than most jazz critics have ever admitted in writing. &quot;Nice 'n Juicy,&quot; &quot;Pocahontas,&quot; and Jackson's &quot;Mother Fingers,&quot; &quot;S.M.O.F.,&quot; and &quot;Awright, Awright&quot; are superbly funky big-band jams that work uncommonly well as soundtracks for cruise-control freeway driving, thanks in large part to electric bassist Dave Markee, drummer Randy Jones, New Zealand baritone saxophonist Bruce Johnstone, and Ferguson's wild brass section. (Listen also for Vemu Mukunda strumming the veena, or South Indian lute, during &quot;S.M.O.F.&quot;) This album, originally issued as M.F. Horn, Vol. 3, has been reissued in a double-disc set with M.F. Horn, Vols. 4-5: Live at Jimmy's by the English Dutton Vocalion label. (AllMusic M.F. Horn 3)\nThis double LP is easily Maynard Ferguson's best jazz-oriented recording for Columbia. With the exception of a remake of &quot;MacArthur Park&quot; (which isn't bad), the music sticks exclusively to jazz with the highlights including &quot;I'm Gettin' Sentimental Over You,&quot; &quot;Two for Otis,&quot; &quot;Stay Loose with Bruce,&quot; &quot;The Fox Hunt,&quot; and &quot;Got the Spirit.&quot; In addition to Ferguson's powerful trumpet, other musicians making strong impressions include first trumpeter Lin Biviano, altoist Andy MacIntosh, Ferdinand Povel on tenor, baritonist Bruce Johnstone, and keyboardist Pete Jackson.(AllMusic M.F. Horn, Vols. 4-5: Live at Jimmy's)\n\nTrack list:\nM.F. Horn 3\n01 - Awright, Awright\n02 - 'Round Midnight\n03 - Nice 'N' Juicy\n04 - Pocahontas\n05 - Love Theme From 'The Valachi Papers'\n06 - Mother Fingers\n07 - S.o.m.f.\nM.F. Horn 4&amp;5 Live at Jimmy's\n01 - Teonova\n02 - Macarthur Park\n03 - Left Bank Express\n04 - I'm Gettin' Sentimental Over You\n05 - Two For Otis\n06 - Stay Loose With Bruce\n07 - Nice 'N' Juicy\n08 - Fox Hunt\n09 - Got The Spirit\n10 - Blue Birdland\n\nSplit with Medieval. Sorry.\nEnjoy and share! ","torrent":{"xt":"urn:btih:763a0ea1d0ca4b9cf4b4b24fc1e0f9a1df616294","amp;dn":"Maynard+Ferguson+-+2006+-+M.F.+Horn+3%2C+4+and+5+Live+At+Jimmy%27s+F","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"763a0ea1d0ca4b9cf4b4b24fc1e0f9a1df616294","infoHashBuffer":{"type":"Buffer","data":[118,58,14,161,208,202,75,156,244,180,178,79,193,224,249,161,223,97,98,148]},"announce":[],"urlList":[]}}