{"title":"Ulysses by James Joyce (RTE -- Unabridged)","uid":8458744,"size":428647691,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:7651452ba44dd4319bc23016d41e04cd9ca8e3b8&amp;dn=Ulysses+by+James+Joyce+%28RTE+--+Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tyl3rdurd3n","files":-1,"time":1368171069,"description":"In the past, Ulysses has been labeled dirty, blasphemous, and even unreadable. None of these adjectives, however, do the slightest justice to the novel. To this day it remains the modernist masterpiece, in which the author takes both Celtic lyricism and vulgarity to splendid extremes. It is funny, sorrowful, and even (in a close-focus sort of way) suspenseful. And despite the exegetical industry that has sprung up in the last 75 years, Ulysses is also a compulsively readable book.\n\nWilliam Blake saw the universe in a grain of sand. Joyce saw it in Dublin, Ireland, on June 16, 1904, a day distinguished by its utter normality. Two characters, Stephen Dedalus and Leopold Bloom, go about their separate business, crossing paths with a gallery of indelible Dubliners. We watch them teach, eat, stroll the streets, argue, and (in Bloom's case) masturbate. And thanks to the book's stream-of-consciousness technique--which suggests no mere stream but an impossibly deep, swift-running river--we're privy to their thoughts, emotions, and memories. The result? Almost every variety of human experience is crammed into the accordian folds of a single day, which makes Ulysses not just an experimental work but the very last word in realism.","torrent":{"xt":"urn:btih:7651452ba44dd4319bc23016d41e04cd9ca8e3b8","amp;dn":"Ulysses+by+James+Joyce+%28RTE+--+Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7651452ba44dd4319bc23016d41e04cd9ca8e3b8","infoHashBuffer":{"type":"Buffer","data":[118,81,69,43,164,77,212,49,155,194,48,22,212,30,4,205,156,168,227,184]},"announce":[],"urlList":[]}}