{"title":"Fourwinds by Elisabeth Gifford (retail) {dwg}","uid":11207413,"size":6138016,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:77a67351c70f9fa69cd6e0621da309a7c7813c54&amp;dn=+Fourwinds+by+Elisabeth+Gifford+%28retail%29+%7Bdwg%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gratefuldawg77","files":6,"time":1413239235,"description":"From the author of Secrets of the Sea House comes the mystery of a runaway bride. Can a century of family secrets be unravelled in time to bring her back? For fans of Kate Morton and Rachel Hore.\n\nOne house. Two families. A lifetime of secrets.\n\nAt Fourwinds they gather: Alice and Ralph, Patricia and Peter, to celebrate the marriage of their children. The marquee is on the lawn, breathing in and out in the summer heat. But the bride is nowhere to be seen.\n\nAs both families are drawn together, the past floods through the corridors of the old house. What secret has Ralph been keeping from his wife? What is it about Alice's wartime encounter with Peter that has haunted her ever since? And what could have caused Sarah to vanish without a word to any of the people she loves?\n\nMoving from the orange groves of Valencia and the spacious houses of the British countryside to the post-war slums in the north, Return to Fourwinds is a sweeping, lyrical story of the things we tell and the things we keep to ourselves. Is Sarah's disappearance a culmination of the pressures that have kept the two families apart? Or can they work together to bring her back to Fourwinds?","torrent":{"xt":"urn:btih:77a67351c70f9fa69cd6e0621da309a7c7813c54","amp;dn":"+Fourwinds+by+Elisabeth+Gifford+%28retail%29+%7Bdwg%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"77a67351c70f9fa69cd6e0621da309a7c7813c54","infoHashBuffer":{"type":"Buffer","data":[119,166,115,81,199,15,159,166,156,214,224,98,29,163,9,167,199,129,60,84]},"announce":[],"urlList":[]}}