{"title":"All Star Jam Session - Jazz Ballads 20 TQMP","uid":4926452,"size":550062734,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:77af905a2a3deb553488e61b234056a752021cf0&amp;dn=All+Star+Jam+Session+-+Jazz+Ballads+20+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zootallure","files":38,"time":1243866589,"description":"Ok, here is the last of Jazz Ballads series, #20, All Stars Jam Session (If anyone knows if this serial has a sequel, please let me know! ). After this upload I will take a break for a couple of weeks; as Breezin' said, i've been uploading like hell for last six month...and uploaded a quarter of my collection...Welcome to all who gived thanks in comments to my uploads and to all seeders! It is easy to dl, but without seeders...\n\nOne of the most rewarding events for jazz musicians is the jam session.\nThe gathering together of star musicians for such a session can make it a rewarding and entertaining experience for an audience too. One man made them into spectacular occasions; Norman Granz. Two other names are notable for bringing the skills of some of the greatest musicians of the 20th century to the attention of the public; talent scout John Hammond and producer George Avakian. Without the efforts of these three farsighted individuals, much of the finest music of the last century would have gone unrecorded.\n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project we, fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill :)\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC with 1024kb/s\nGet Your Free Copy of the EAC and FLAC suite at: &lt;a href=&quot;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&lt;/a&gt;\n\nPlease feel free to join the TQMP project!\nThe &quot;rules&quot; are simple: Rip your CD (no 1980's cassettetapes or vinylrips please!) in lossless format AND include artwork. Include cue- and logfiles for the purists and the TQMP searchtag in your title, so it can easily be found. (Yes, on Google as well..)\n\nSay Ã‚Â»thank youÃ‚Â« by seeding... just seed, it is not harmful to your health :-)","torrent":{"xt":"urn:btih:77af905a2a3deb553488e61b234056a752021cf0","amp;dn":"All+Star+Jam+Session+-+Jazz+Ballads+20+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"77af905a2a3deb553488e61b234056a752021cf0","infoHashBuffer":{"type":"Buffer","data":[119,175,144,90,42,61,235,85,52,136,230,27,35,64,86,167,82,2,28,240]},"announce":[],"urlList":[]}}