{"title":"Granicus - Granicus (1973/2009) [FLAC]","uid":10487029,"size":561963043,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:797f4d30b5a5fada957a37840c53dbdcdcb77209&amp;dn=Granicus+-+Granicus+%281973%2F2009%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":22,"time":1404489710,"description":"Band: Granicus\nAlbum: Granicus\nYear: 1973/2009\nCountry: USA\nGenre: Heavy/Hard Rock\n\nTrack list:\n\n01. You're In America (04:07)\n02. Bad Talk (02:48)\n03. Twilight (06:58)\n04. Prayer (11:05)\n05. Cleveland Ohio (03:29)\n06. Nightmare (08:19)\n07. When You're Movin' (03:16)\n08. Paradise (07:15)\n\nBonus tracks: &quot;Live, November 1973, Radio Show&quot;\n09. Cleveland Ohio [extended version] (07:55)\n10. Interview (00:51)\n11. Hollywood Star [unreleased track] (04:36)\n12. Prayer (10:26)\n13. Interview Part 2 (01:38)\n14. When You're Movin' (03:55)\n\nGranicus:\n*Wayne Anderson - lead guitar\n*Joe Battaglia - drums\n*Dale Bedford - bass\n*Woody Leffel - vocals, acoustic guitar\n*Al Pinel - rhythm guitar\n\n\nCleveland's enigmatic Granicus recorded just one eponymous LP before fading into rock &amp; roll oblivion, but boy, it's an absolute gem!\n\nQuietly released by RCA in 1973, Granicus is truly an album out of time -- especially its own -- which perhaps explains its eventual commercial failure.\nYears on, the record acts as a veritable time capsule, taking the listener back to that tenuous transition point where late-'60s progressive rock and experimental psychedelia finally gave way once and for all to what is now considered the classic '70s hard rock sound.\nIndeed, it's this convoluted transformation process that simultaneously informs the album with its edgy, nervous energy and helps explain its mysteriously lasting appeal.\nElements of the old ways pervade the wistful interlude &quot;Twilight,&quot; the prog-tastic &quot;Nightmare,&quot; and the 11-minute freakout &quot;Prayer,&quot; while ballsy hard rockers like &quot;You're in America&quot; and &quot;When You're Movin'&quot; reflect the new world order imposed by the church of Led Zeppelin.\nSomewhere in between, an optimum balance is struck by excellent single &quot;Bad Talk,&quot; the scorching, self-affirming tirade of &quot;Cleveland Ohio&quot; (where singer Woody Leffel scats his way through every insult ever aimed at his hometown's citizens: &quot;Uncool, unheavy, ungroovy, unfunky, unhip, greaseball!&quot;), and the amazing hard boogie workout that is closer &quot;Paradise.&quot;\nAs for the bandmembers, their technical prowess and taut interplay drives all of the above into truly impressive realms of inspiration, and with his piercing shrieks and bluesy falsetto, Leffel is a positively eerie sonic precursor to Rush's Geddy Lee.\nRock &amp; roll history may have dealt them a losing hand in the end, but there'll always be a place in musical anthropologists' hearts for both Granicus the band and Granicus the album.\nThis Granicus CD in digipack edition, with 06 bonus tracks, is a classic over-the-top rare 70s hard rock album with wild vocals. Excellent driving heavy guitars all over the place. &quot;Bad Talk&quot; totally kills!\n\n\n","torrent":{"xt":"urn:btih:797f4d30b5a5fada957a37840c53dbdcdcb77209","amp;dn":"Granicus+-+Granicus+%281973%2F2009%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"797f4d30b5a5fada957a37840c53dbdcdcb77209","infoHashBuffer":{"type":"Buffer","data":[121,127,77,48,181,165,250,218,149,122,55,132,12,83,219,220,220,183,114,9]},"announce":[],"urlList":[]}}