{"title":"Dave Sim Collected Letters 2004 Collected Letters 2","uid":8604402,"size":262029432,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:7a4820a63b9e768cdce8b9919de5dec1642d8fe0&amp;dn=Dave+Sim+Collected+Letters+2004+Collected+Letters+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"LeonardTSpock","files":-1,"time":1371972330,"description":"'Collected Letters 2004'\nWritten by Dave Sim\nAardvark-Vanaheim, 2005, 597 pages\n\n'Collected Letters 2'\nDave Sim, 2007, 223\nWritten by Dave Sim\n\nThe cover of the first volume, 'Collected Letters 2004', says, &quot;After you've finishing writing the longest sustained narrative in human history, it's time to answer the mail.&quot; And that's what you get - over 800 pages of Dave Sim's post-Cerebus letters. Letters written to every type of person you could imagine; friends, fans, &quot;celebrities&quot;, publishers of comics and magazines, enemies, haters, self-publishers looking for advice, published authors who sent him their books, comic shop owners and SO much more. The topics they cover are vast, many and varied, to the point of making writing a description of them a pointless endeavor. Here's some of what Dave teases as topics on the back of CL2004: critiques of self-published works by novices, Malthusian theory &amp; Ebenezer Scrooge, child pornography, why I quit drinking, the CBLDF and responsible retailing, borderline schizophrenia, the American founding fathers and Christianity, aesthetic responsibility, the Elfquest/Cerebus schism and (as they say) much, much more! Obviously (goes without saying, really), Cerebus, comics, Dave's faith and the decisions it helped him make are discussed at length with many different people. \n\nHere's some information about both volumes done in a comparative manner..\n\nFirst, the titles are actually 'Collected Letters 2004' (from now on, CL2004) and 'Collected Letters 2' (CL2).\n\nIn the introduction to CL2004 Dave Mentions that &quot;the complete 'Collected Letters 2004' totals 1500 pages so the first volume contains a little over a third of the total material.&quot; Clearly, the complete CL2004 never saw publication. One can only assume that this was due to a lack of interest, which is unfortunate, because they make for some pretty solid reading (geeky to the extreme - but a deep, fascinating look into the inner workings of a very interesting man at a pivotal point in his life, all the same). \n\nContinued in the comments section below...","torrent":{"xt":"urn:btih:7a4820a63b9e768cdce8b9919de5dec1642d8fe0","amp;dn":"Dave+Sim+Collected+Letters+2004+Collected+Letters+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a4820a63b9e768cdce8b9919de5dec1642d8fe0","infoHashBuffer":{"type":"Buffer","data":[122,72,32,166,59,158,118,140,220,232,185,145,157,229,222,193,100,45,143,224]},"announce":[],"urlList":[]}}