{"title":"Immortal Sergeant (Henry Fonda) {TV rip AMC} [1943] .avi","uid":7101177,"size":551660758,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7a5d6e699fb030362dc82b7db206f7b62ce91d91&amp;dn=Immortal+Sergeant+%28Henry+Fonda%29+%7BTV+rip+AMC%7D+%5B1943%5D+.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"alien99","files":-1,"time":1331699479,"description":"SORRY ALL THIS IS THE ONLY COPY I HAVE VERY GOOD TV RIP BUT THE AMC\nTV LOGO IS ON THE FILM      JUST ADVANCE WARNING \n\nStoryline\n\nOut on patrol in the war-time desert a Canadian corporal reminisces about the woman he has left behind in London and ponders whether she will fall for the charms of his rival in love. At the same time he worries about how he would get on with his outfit if his crack sergeant was not there to guide him. Circumstances combine to give answers to both questionS\n\nUser Review\n\nAverage war drama based on a John Brophy novel. The immortal sergeant is British Sgt. Kelly(Thomas Mitchell)in charge of a 14-man patrol in the desert of WWII Libya. Kelly is tough, but compassionate and held in high regard by the men in his unit. The group becomes smaller as only six survive an air attack in the open desert. Kelly's corporal is Colin Spence(Henry Fonda), a shy and laid back Canadian with enough military smarts to impress the sergeant in picking him as his replacement. The fatigued patrol comes face to face with a Nazi tank and after a harsh confrontation Spence is forced to step up and take the place of their fallen leader.\n\nThe photography for this war drama is very good for the mid-40's. Black &amp; White film sets the mood and feel of the movie well. The action is broken up with Spence's flashback reminiscing of the girl he left behind, the beautiful Maureen O'Hara. Also in the cast: Reginald Gardner, Allyn Joslyn, Melville Cooper, Morton Lowry, John Banner and a small role for Peter Lawford. ","torrent":{"xt":"urn:btih:7a5d6e699fb030362dc82b7db206f7b62ce91d91","amp;dn":"Immortal+Sergeant+%28Henry+Fonda%29+%7BTV+rip+AMC%7D+%5B1943%5D+.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a5d6e699fb030362dc82b7db206f7b62ce91d91","infoHashBuffer":{"type":"Buffer","data":[122,93,110,105,159,176,48,54,45,200,43,125,178,6,247,182,44,233,29,145]},"announce":[],"urlList":[]}}