{"title":"Gorillaz - Gorillaz","uid":7368946,"size":123919982,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7a87126d8f482d832286761ef19b1bfdf4592704&amp;dn=Gorillaz+-+Gorillaz&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":16,"time":1340185909,"description":"The Gorillaz claim to have found their motley crew of cartoon characters sleeping in Leicester Square, but Blur's Damon Albarn (a.k.a. 2-D) and cult cartoonist Jamie Hewlett (Murdoc) aren't fooling anyone. As the ultimate experiment in manufactured image, the Gorillaz are a virtual cartoon-character-based hip-hop band who bring together witty, silly lyrics and talented musicians. Infectious old-school hip-hop rhythms, rhymes, and effects courtesy of Deltron 3030's Kid Koala and Del Tha Funkee Homosapien (Russel) are combined with Albarn's passion for chugging lo-fi and edgy melodies to create a seemingly raw but ultimately slick blend of styles. This is nowhere more evident than on the hit single &quot;Clint Eastwood,&quot; which is carried along by the sound of 2-D's slurred voice and a bluesy harmonica melody interrupted by Russel's punching rhymes. But the surprises don't stop there: Ibrahim Ferrer's appearance on &quot;Latin Simone&quot; could have come straight from Buena Vista Social Club but for the obvious Blur-influenced piano style, while the spooky intro to &quot;M1 A1&quot; wouldn't sound out of place on Michael Jackson's Thriller. Backed by Jamie Hewlett's death-wish character on bass, Cibo Matto's Miho Hatori (Noodle) on guitar and occasional hyperactive vocals, and produced by Dan &quot;the Automator&quot; Nakamura, it's hardly surprising that Gorillaz is marked both by a sense of playfulness and a passion for experimentation.\n\nSize: 118MB\nFormat: MP3\nBitrate: 256k\nCovers: Front and back\nTracker: prq.to/announce","torrent":{"xt":"urn:btih:7a87126d8f482d832286761ef19b1bfdf4592704","amp;dn":"Gorillaz+-+Gorillaz","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a87126d8f482d832286761ef19b1bfdf4592704","infoHashBuffer":{"type":"Buffer","data":[122,135,18,109,143,72,45,131,34,134,118,30,241,155,27,253,244,89,39,4]},"announce":[],"urlList":[]}}