{"title":"Renewable Energy in the Middle East","uid":6526713,"size":3848484,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7b7f2dd32277debf0be9c9c272f71d196ad8f6ae&amp;dn=Renewable+Energy+in+the+Middle+East&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"_F1_","files":-1,"time":1310192370,"description":"Michael Mason, Amit Mor, &quot;Renewable Energy in the Middle East: Enhancing Security through Regional Cooperation (NATO Science for Peace and Security Series C: Environmental Security)&quot;\n Publisher: Springer | ISBN 10: 140209891X | 2009 | PDF | 190 pages | 3.68 MB\n\n Energy insecurity is not normally associated with the Middle East. However, away from the oil-rich Persian Gulf, the countries of the eastern Mediterranean are particularly vulnerable. Their fossil fuel endowments are low, while their fractious relationships with each other have long fostered wider political insecurities. Focusing on the Jordan Basin (Israel, the Palestinian Territories, Lebanon and Jordan), this timely volume addresses the prospects for the adoption of renewable energy in the oil-poor Middle East. Featuring regional energy experts, it offers an invaluable survey.\n\n After outlining the regional security context, this book first reviews renewable energy policy and practices in the Jordan Basin. It then considers options for greening energy use, including promising pilot projects in North Africa. The initiatives discussed encompass renewable energy finance, energy-efficient rural communities, and solar and wind energy. There is significant potential for an increase in the uptake of renewable energy technologies in the eastern Mediterranean. This window of opportunity has been created by high oil prices, energy infrastructure investment opportunities, and the UN climate change regime. In conclusion, the book considers the institutional conditions for collaborative decision-making on renewable energy. Such cooperation would deliver substantial security and human development benefits to the region, and indeed the world.","torrent":{"xt":"urn:btih:7b7f2dd32277debf0be9c9c272f71d196ad8f6ae","amp;dn":"Renewable+Energy+in+the+Middle+East","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b7f2dd32277debf0be9c9c272f71d196ad8f6ae","infoHashBuffer":{"type":"Buffer","data":[123,127,45,211,34,119,222,191,11,233,201,194,114,247,29,25,106,216,246,174]},"announce":[],"urlList":[]}}