{"title":"Biological Inorganic Chemistry - An Introduction","uid":14972152,"size":16121656,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7c947e9ba970a497558aa7e49af7f5bd851cbe0d&amp;dn=Biological+Inorganic+Chemistry+-+An+Introduction&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1466208761,"description":"Biological Inorganic Chemistry - An Introduction - Robert R. Crichton (Elsevier, 2008).pdf\r\n\r\nISBN 978-0-444-52740-0\r\n\r\nThe importance of metals in biology, the environment and medicine has become increasingly evident over the last twenty five years. The study of the multiple roles of metal ions in biological systems, the rapidly expanding interface between inorganic chemistry and biology constitutes the subject called Biological Inorganic Chemistry. The present text, written by a biochemist, with a long career experience in the field (particularly iron and copper) presents an introduction to this exciting and dynamic field. The book begins with introductory chapters, which together constitute an overview of the concepts, both chemical and biological, which are required to equip the reader for the detailed analysis which follows. Pathways of metal assimilation, storage and transport, as well as metal homeostasis are dealt with next. Thereafter, individual chapters discuss the roles of sodium and potassium, magnesium, calcium, zinc, iron, copper, nickel and cobalt, manganese, and finally molybdenum, vanadium, tungsten and chromium. The final three chapters provide a tantalising view of the roles of metals in brain function, biomineralization and a brief illustration of their importance in both medicine and the environment. Relaxed and agreeable writing style. The reader will not only find the book easy to read, the fascinating anecdotes and footnotes will give him pegs to hang important ideas on. It is written by a biochemist. It will enable the reader to more readily grasp the biological and clinical relevance of the subject. It includes many colour illustrations. It enables easier visualization of molecular mechanisms. It is written by a single author. It ensures homgeneity of style and effective cross referencing between chapters","torrent":{"xt":"urn:btih:7c947e9ba970a497558aa7e49af7f5bd851cbe0d","amp;dn":"Biological+Inorganic+Chemistry+-+An+Introduction","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c947e9ba970a497558aa7e49af7f5bd851cbe0d","infoHashBuffer":{"type":"Buffer","data":[124,148,126,155,169,112,164,151,85,138,167,228,154,247,245,189,133,28,190,13]},"announce":[],"urlList":[]}}