{"title":"[ExploitedCollegeGirls] Carmen (20 Years Old) (04.10.2014)","uid":9938674,"size":798143201,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:7d03c80514297e8690d24d31975d12774674d467&amp;dn=%5BExploitedCollegeGirls%5D+Carmen+%2820+Years+Old%29+%2804.10.2014%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"chkm8te","files":1,"time":1397192455,"description":"[ExploitedCollegeGirls] Carmen (20 Years Old) (04.10.2014)\n\nThis week we practice a little diversity with dark skinned and delightfully frizzy haired amateur Carmen. From her perky tits and ample bubble butt to her free-love neo-hippie attitude, Carmen could convert anyone to a lover of chocolate chicks. We start, as usual, with a revealing interview during which Carmen confesses to being in a rare dry spell. When she regales Jay with her adventurous and risquï¿½ sexual history, you can't imagine this girl is ever dry.\nOur man Jay starts off with a little light pussy fingering that progresses to full on finger banging as Carmen gets close to orgasming but for some reason she holds back and doesn't get off. This is a bad idea. Loyal viewers know that there are few things Jay responds to like a challenge and he takes this as a personal insult. To satisfy his honor he reaches for the Rabbit and gives her no choice but to orgasm.\nAfter getting her off, Jay has her drop to the floor and suck him off. Carmen displays a talent for dick sucking and has no problem when Jay grabs the back of her head and face fucks her. Recalling how earlier Carmen had held back her O, Jay is determined to punish her a little. He starts off fucking her on her back and builds to a jackhammer finish that leaves her a little shaky legged. After a bit of rest, she climbs on for some cowgirl and then Jay flips her over into a pin down position and pounds her pussy like he's trying to fuck start a stubborn outboard motor. When she cums again, Jay feels satisfied and sets her on her knees for the big finish.\nWhile we were hoping for the Duke pornstar this week, we're out of luck, she's too hot. But, we did get the Loyola pornstar, and she's probably a better fuck anyway.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=cde1g35dbfjs1zoyna8d.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=cde1g35dbfjs1zoyna8d.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=dzlpmkxer5ccq3r8u6z6.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=dzlpmkxer5ccq3r8u6z6.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:7d03c80514297e8690d24d31975d12774674d467","amp;dn":"%5BExploitedCollegeGirls%5D+Carmen+%2820+Years+Old%29+%2804.10.2014%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d03c80514297e8690d24d31975d12774674d467","infoHashBuffer":{"type":"Buffer","data":[125,3,200,5,20,41,126,134,144,210,77,49,151,93,18,119,70,116,212,103]},"announce":[],"urlList":[]}}