{"title":"Turok : Dinosaur Hunter","uid":7116529,"size":18723154,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7e09f275674e6ed1ab19c71134f54cbc54ea4f5e&amp;dn=Turok+%3A+Dinosaur+Hunter&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"N97","files":1,"time":1332232232,"description":"Turok: Dinosaur Hunter is a first-person shooter video game developed by Iguana Entertainment and published by Acclaim for the Nintendo 64 console and personal computer platforms. It was released in 1997 in North America and Europe. Turok is an adaptation of the Acclaim Comics comic book series of the same name. The player controls a Native American warrior, Turok, who must stop the evil Campaigner from conquering the universe with an ancient and powerful weapon.\n\nTurok: Dinosaur Hunter is a shooter game in which gameplay takes place from a first-person perspective. The three-dimensional (3D) computer graphics and style of play combine elements of the run-and-gun computer game Doom with exploration mechanics of Tomb Raider.Players begin the game in a central hub level, which contains portals to seven other stages. The player must find keys scattered across the stages. When enough keys have been inserted into the lock mechanisms of a hub portal, that level is unlocked. Players explore the large, typically jungle-based levels by jumping, swimming, climbing, crawling, and running.","torrent":{"xt":"urn:btih:7e09f275674e6ed1ab19c71134f54cbc54ea4f5e","amp;dn":"Turok+%3A+Dinosaur+Hunter","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e09f275674e6ed1ab19c71134f54cbc54ea4f5e","infoHashBuffer":{"type":"Buffer","data":[126,9,242,117,103,78,110,209,171,25,199,17,52,245,76,188,84,234,79,94]},"announce":[],"urlList":[]}}