{"title":"Spring - 1972 Brian Wilson / David Sandler production","uid":3957492,"size":31451193,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7e30028aad5df22d33ae233d80ef7714290a1494&amp;dn=Spring+-+1972+Brian+Wilson+%2F+David+Sandler+production&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"st2580smile","files":1,"time":1199244513,"description":"Biography by Bruce Eder\n \nSpring ? not to be confused with the progressive rock outfit of the same name who came along about a year later ? was an offshoot of Brian Wilson&amp;#039;s extra-curricular activities during the post-Smile era, when he was writing and producing, but mostly not working with the band. They started out as a sister act long before they ever thought of performing: Marilyn Rovell and her sister Diane Rovell were two of three sisters ? the other was Barbara ? born into a musical family, to a mother who&amp;#039;d been a jazz pianist. They learned to harmonize and had worked as the Rovell Sisters, winning talent awards and competitions on a television show called Rocket to Stardom, and soon found themselves featured in local commercials for Oldsmobile. That lasted until they were all in their teens and then they drifted away from professional performing.In the meantime, rock &amp; roll had come along, elevating the exposure of harmony vocal music with a distinct youth twist. One day in late 1962 or early 1963 ? none of the participants can remember now ? Marilyn and Diane joined a cousin, Ginger Blake, at a Los Angeles club called the Pandora&amp;#039;s Box, on a night when a new L.A.-based group called the Beach Boys were performing. In the course of the night, the group&amp;#039;s bassist, one Brian Wilson, managed to spill chocolate sauce on Marilyn. That led to more contact, personal and professional, between Wilson and Marilyn, and Wilson and the two sisters-plus-a-cousin. They regrouped as the Honeys and were duly signed to Capitol Records, where Brian Wilson produced a series of singles that were mostly near-misses commercially and led them to eventually disband. Marilyn Rovell, following stints as a model and some crisscrossing with the band professionally, also married Wilson and became part of the extended family that constituted the Beach Boys operation during those years, from the mid-&amp;#039;60s onward. It was Diane Rovell who got her and her sister back into the singing business, while hanging around the Wilson kitchen with Marilyn and her brother-in-law. And the result was Spring, a harmony duo of the Wilson/Rovell siblings, produced by Brian and every bit as contemporary as any act working in 1970, doing lost treasures from the Carole King songbook and rewrites and rearrangements of Brian Wilson (and Mike Love) tunes (most magnificently, &quot;This Whole World&quot;), plus renditions of Rita Coolidge and Leon Russell repertoire and standards like &quot;Tennessee Waltz.&quot; They didn&amp;#039;t last past the one album and the sessions that went into it ? the group wasn&amp;#039;t a full-time or even an ongoing commitment, just something to have fun with and to see where it took them, which may be why it took them so far. The record, like the group, became one of the great lost chapters of the Beach Boys&amp;#039; post-psychedelic history, and a stunning musical document in its own right. Released by United Artists at just about the same time as the first ELO album, it died on the vine and became a choice collectable within just a few years. Various CD reissues have enhanced its exposure and raised the demand for the recordings. (AMG)\n\nTrivia note:\nDrummer/Percussionist Hal Blane performed on \nSuperstar&quot; for The Carpenters, and again on the Spring version within a few months.\n\nTRACKS:\n\n 1   Tennessee Waltz  King, Stewart     \n 2   Thinkin&amp;#039; &amp;#039;Bout You Baby  Love, Wilson     \n 3   Mama Said  Denson, Dixon     \n 4   Superstar  Bramlett, Russell     \n 5   Awake  Tucker     \n 6   Sweet Mountain  Sandler, Wilson     \n 7   Everybody  Roe     \n 8   This Whole World  Wilson     \n 9   Forever  Jakobsen, Wilson     \n 10   Good Time  Jardine, Wilson     \n 11   Now That Everything&amp;#039;s Been Said  King, Stern     \n 12   Down Home  Goffin, King  \n\n Keith Allison Bass  \n Allan Beutler Horn  \n Larry Carlton Guitar  \n David Bennett Cohen Guitar  \n Stephen W. Desper Producer  \n John Guerin Drums  \n Richard Henn Arranger  \n Billy Hinsche Vocals  \n Igor Horoshevsky Cello  \n Alan Jardine Vocals  \n Mike Love Vocals  \n Lincoln Mayorga Piano  \n Ray Pohlman Bass  \n Diane Rovell Vocals  \n David Sandler Piano, Arranger, Vocals, Producer  \n Brian Wilson Arranger, Vocals, Producer, Vocal Arrangement  \n Carl Wilson Guitar  \n Marilyn Wilson Vocals  \n Marilyn Wilson-Rovell Vocals  \n Pique Withers Drums, Glockenspiel, Group Member  \n   \n     \n *Stay tuned more from &quot;the Honeys&quot; are on the way*","torrent":{"xt":"urn:btih:7e30028aad5df22d33ae233d80ef7714290a1494","amp;dn":"Spring+-+1972+Brian+Wilson+%2F+David+Sandler+production","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e30028aad5df22d33ae233d80ef7714290a1494","infoHashBuffer":{"type":"Buffer","data":[126,48,2,138,173,93,242,45,51,174,35,61,128,239,119,20,41,10,20,148]},"announce":[],"urlList":[]}}