{"title":"GILBERT GOODMATE and the Mushroom of Phungoria","uid":5450230,"size":1069182464,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7edc1124012ae1050b3bc3ec76c3324c5efa4be3&amp;dn=GILBERT+GOODMATE+and+the+Mushroom+of+Phungoria&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"frank_pe","files":-1,"time":1269163786,"description":"Many years ago, an evil wizard lived in a country far away. There had never been a wizard so powerful, or a man so evil as Karn, and his only wish was to conquer the world.\nMany brave men tried to stop him, and failed. But when all seemed lost, a young boy chose to face Karn on his own, and with the unlikely help of a big mushroom, managed to defeat the wizard and save the world from tyranny and darkness.\n\nThe hero was celebrated, the people rejoiced, and the mushroom was placed on the square in the nearby town of Phungoria.\n\nAnd the people remembered.\nEvery year, a festival was held, so the citizens would never forget how the world was saved. During each festival a new citizen would be elected to keep the mushroom safe for another year.\nThis year, it was Gilbert's grandfather, Abraham Goodmate, who swore the oath to protect the mushroom, to care for it and keep it safe, and to defend it, if need be, with his life.\nBut one week before the festival, the mushroom is stolen -- and Abraham is blamed for allowing it to happen.\nHe swore an oath, the people say, to defend the mushroom with his life -- well, then, let him pay with his life! And so, Abraham Goodmate is thrown in jail, and sentenced to be executed during the mushroom festival.\n\nThere is only one way for Gilbert Goodmate to save his grandfather. He must find the stolen mushroom, and capture the thief, before the end of the week!\n &lt;a href=&quot;\nhttp://www.gilbertgoodmate.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.gilbertgoodmate.com&lt;/a&gt; ","torrent":{"xt":"urn:btih:7edc1124012ae1050b3bc3ec76c3324c5efa4be3","amp;dn":"GILBERT+GOODMATE+and+the+Mushroom+of+Phungoria","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7edc1124012ae1050b3bc3ec76c3324c5efa4be3","infoHashBuffer":{"type":"Buffer","data":[126,220,17,36,1,42,225,5,11,59,195,236,118,195,50,76,94,250,75,227]},"announce":[],"urlList":[]}}