{"title":"Democracy Now - 29 feb 2012","uid":7066609,"size":456201701,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:7f0f70d461d8dc54e29351ba858d3e247017ea21&amp;dn=Democracy+Now+-+29+feb+2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1330535634,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Feb 29, 2012\n\n- U.N.: Syria Uprising Toll Passes 7,500\n- 13 Activists Killed Helping Evacuate British Photographer From Syria\n- U.S. Drafts New U.N. Security Council Measure on Syria\n- U.N. Human Rights Chief Calls for ICC Probe of Syrian Officials\n- 25  Arrested in Raids Targeting Hacker Group Anonymous\n- Egypt Claims Arrest of Top Al-Qaeda Leader\n- OWS Protesters Hold &quot;Reboot&quot; Rally in New York\n- U.S. Supreme Court Hears Arguments in Corporate Abuses Case\n- Remains of 9/11 Victims Dumped in Pentagon Landfill\n- Virginia Senate Approves Ultrasound Requirement\n- Iowa State Senate Backs &quot;Ag-Gag&quot; Bill\n- Sharif Abdel Kouddous, Center for Media and Democracy Win Izzy Awards for Independent Media\n- Romney Wins Arizona, Narrowly Edges Santorum in Michigan\n- Obama Issues Waivers for Indefinite Detention Law\n\n\nSpecial reports\n\n- Leaked Stratfor Email Suggests Secret U.S. Indictment of WikiLeaks Founder Julian Assange\n\nThe whistleblowing website WikiLeaks has published an internal email from the private intelligence firm Stratfor that suggests the U.S. Justice Department has obtained a sealed indictment against WikiLeaks founder Julian Assange. The email is one of around five million obtained from Stratfor's servers by the hacker group, Anonymous. &quot;Somehow you have a private intelligence company, Stratfor, 'shadow CIA' as people have called it, having information about this sealed indictment, secret again, that Julian Assange does not have, that Wikileaks does not have, that his lawyers do not have,&quot; says Michael Ratner of the Center for Constitutional Rights, who is a legal advisor to both Assange and to WikiLeaks. &quot;What you see is secrecy, secrecy, secrecy.&quot; News of the indictment comes less than a week after Army Private Bradley Manning was arraigned for allegedly leaking classified U.S. military and State Department documents to WikiLeaks.\n\n\n- Slim Romney Win Signals GOP Challenges in Reaching Michigan's Working Class, Arab-American Voters\n\nMitt Romney claimed victory in Tuesday's Republican primaries, winning Arizona by a wide margin, but only narrowly edging out Rick Santorum in his native state of Michigan. Against the backdrop of a struggling economy, the Michigan primary foreshadowed the challenges Republicans will face when they confront Obama in the fall. Michigan's economic woes preceded the rest of the country's downturn and its current 9.3 percent unemployment rate is noticeably higher than the national rate of 8.3 percent. The revival of the automobile industry played a central role in the campaign, with Romney and Santorum opposing the 2008 government rescue. Michigan also has a large Arab-American population, which overwhelmingly supported President Obama in the 2008 election. We go to Michigan to speak with Chris Savage, a Michigan-based political writer and founder of Eclectablog, and Dawud Walid, executive director of CAIR Michigan.\n\n\n- Amnesty International's Salil Shetty: Arms Embargo, Human Rights Monitors Needed for Syria Crisis\n\nThe death toll in Syria has reportedly topped 7,500 after 11 months of the government's crackdown on anti-government protesters and armed rebels. Activists say more than 250 people have died in the past two days alone - mostly from government shelling in Homs and Hama province. We speak with the Secretary General of Amnesty International, Salil Shetty, who is due to discuss Syria withU.N. Secretary-General Ban Ki-Moon. &quot;The Syrian government needs to stop the bombardment,&quot; Shetty says, noting Amnesty International has not called for the use of force. &quot;The immediate issue is about allowing unfettered access to independent human rights monitors. It's [also] to stop the arms flow, because the arms embargo which we've been calling for for a long time has not happened.&quot; Shetty also discusses the crackdown on freedom of expression in Iran during the run up to this week's parliamentary elections, human rights in Egypt, and Amnesty International's campaign for an effective global Arms Trade Treaty.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:7f0f70d461d8dc54e29351ba858d3e247017ea21","amp;dn":"Democracy+Now+-+29+feb+2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f0f70d461d8dc54e29351ba858d3e247017ea21","infoHashBuffer":{"type":"Buffer","data":[127,15,112,212,97,216,220,84,226,147,81,186,133,141,62,36,112,23,234,33]},"announce":[],"urlList":[]}}