{"title":"Under The Dome Episode 12 (720p)","uid":10726385,"size":1174282626,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:7f17a64224f9345c08ebc654cf63e2dd78c5ab46&amp;dn=Under+The+Dome+Episode+12+%28720p%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"shareregi","files":2,"time":1407568388,"description":"As Barbie hides in the woods, Big Jim gives a speech to the townspeople convincing them to continue the search for Barbie, with Linda enforcing rules of security. Dodee later reveals to Big Jim, after hearing radio transmissions from the military, that Barbie is being searched for from outside the dome. During the radio transmissions, Dodee remembers what happened to her days ago when she touched the mini-dome. She takes Big Jim to the radio station and tells him about the egg in the mini-dome. She then leaves the room for a moment, where Big Jim hears the people on the transmission discuss past events that occurred in the dome, including Reverend Coggins's murder. Dodee overhears the transmission, realizing that Big Jim was responsible for his death and other past crimes in the town. Big Jim tells her he did it to protect the town, and also wants to make sure the dome does not come down. Dodee then says she hopes for his eventual death, which pushes Big Jim to kill her and burn the station, blaming Barbie for arson. Joe, Angie, and Norrie grow confused over the vision they witnessed earlier, with the three of them and Junior killing Big Jim. Norrie's stepmom Carolyn then discovers the mini-dome, and promises to keep it secret from the town and Big Jim. Big Jim and some volunteers help him break into the barn to find the mini-dome, but find nothing; Joe's friend Ben has hidden the mini-dome in his house. Big Jim then arrests Joe and Norrie for aiding a vigilante, where he tries to interrogate the two in their cells. In doing so, Norrie stabs him in the arm with a knife she hid away. Joe and Norrie are soon released, and make their way to Ben's house, where he has been covering the dome in blankets after a piercing noise from the egg starts. Ben, Joe, Norrie, and Carolyn take off the blankets to find the dome glowing orange and the monarch cocoon beginning to move. Linda then walks upon the scene. Barbie later finds Angie and convinces her to protect Julia, who is recovering in the hospital from bullet wounds. He worries that Julia will reveal Big Jim's lies and will be killed because of it. Angie manages to distract Junior, by sweetly talking to him and kissing him, while Barbie takes Julia's stretcher to a nearby ambulance. Junior attempts to stop him, but Barbie manages to subdue him, and gets Angie to drive the ambulance to a safe place. He is later arrested by Linda for arson and murder of Dodee, with Phil kicking him in the mouth before being taken away. Julia wakes up with Angie helping her recollect, where she begins to worry over what Big Jim will do to Barbie. In his cell, Barbie is encouraged by Big Jim to confess to all the charges put on his record, or have those closest to him harmed. Junior then finds Big Jim and demands the truth from him; Big Jim lies to him, saying that Barbie was responsible for everything he is charged for. Conflicted over his father's trustworthiness, Junior walks to the end of the dome, and touches it, hoping for an answer. Big Jim walks Barbie to the front of town hall, where many angry townspeople wait for Barbie's guilty plea; after a few moments of contemplation, he pleads not guilty.","torrent":{"xt":"urn:btih:7f17a64224f9345c08ebc654cf63e2dd78c5ab46","amp;dn":"Under+The+Dome+Episode+12+%28720p%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f17a64224f9345c08ebc654cf63e2dd78c5ab46","infoHashBuffer":{"type":"Buffer","data":[127,23,166,66,36,249,52,92,8,235,198,84,207,99,226,221,120,197,171,70]},"announce":[],"urlList":[]}}