{"title":"Scared_Sacred_(Documentary)_DVDrip","uid":4859125,"size":1470076460,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:803e63b69e53a8a90d2af529f273800032556efc&amp;dn=Scared_Sacred_%28Documentary%29_DVDrip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Schopenhauer","files":-1,"time":1240185439,"description":"This is a movie beyond words.\nIncredible.\n\nI don't like dark documentaries, and kept it at home for a year or so until i finally saw it and it was more moving than anything else i have seen. And not because of the dark really , but because of the light in the dark. It is a very hopeful movie in the sense that is shows that any suffering can be turned into meaning and insight. Do yourself a favour and see it, you will likely not regret it.\n\nTrailer: http://www.scaredsacred.org/assets/TrailerWMA9.wmv\nPage of the movie: http://www.scaredsacred.org/\nAnd of the new Movie from Velcrow Ripper: http://www.fiercelight.org/\nT that page, scroll down and donate some money to the filmmakers (Paypal), they are more than worth it, they put their life at risk making this movie to us.\n\nIt can be seen online here: http://www.nfb.ca/film/scared_sacred/\n\nThere is a Link in the txt file to a torrent site &quot;b t junkie&quot; that supplies 600mb of DVD extras about this movie.\n\nHere follows the synopsis:\n\n\n------------------------------------------------------------------------------------------\nSYNOPSIS   |   ScaredSacred\n\nIn a world teetering on the edge of self-destruction, award-winning filmmaker Velcrow Ripper sets out on a unique pilgrimage. Visiting the 'Ground Zeros' of the planet, he asks if it's possible to find hope in the darkest moments of human history.\n\nRipper travels to the minefields of Cambodia; war-torn Afghanistan; the toxic wasteland of Bhopal; post-9/11 New York; Bosnia; Hiroshima; Israel and Palestine. This powerful documentary captures his five-year odyssey to discover if humanity can transform the 'scared' into the 'sacred'.\n\nDeep in the jungles of Cambodia, Ripper meets Aki Ra, a child soldier forced to lay landmines for the Khmer Rouge. Today Aki wanders his ravaged country with a simple wooden stick, decommissioning thousands of mines each year. In the shattered land of Afghanistan, Ripper searches for a Sufi musician who was banned from performing or even listening to music, by the reign of fundamentalism. The musician discovered a way out: he filled his house with songbirds. In each Ground Zero, he unearths unforgettable stories of survival, of ritual, resilience and recovery.\n\nScaredSacred deftly weaves together stunning footage with haunting memories, inspirational stories, and an evocative soundscape. Featuring an engaging, first-person narrative, this film is an exquisite portrait of a search for meaning in times of turmoil, a luminous gift to a world in shadows.\n---------------------------------------------------------------------------------------------- &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0424410/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0424410/&lt;/a&gt;\n\n167 ImDB voted 7.0 of 10.0\n\nRunning time: 105 min.\nVOTES       PERCENTAGE    RATING FROM 1-10\n43- - - - - - - - - -25.7%    10\n33- - - - - - - -19.8%         9\n29- - - - - - -17.4%           8\n22- - - - - 13.2%              7\n14- - -  8.4%                  6\n11- - -6.6%                    5\n8- - 4.8%                      4\n                               3\n3- -1.6%                       2\n4- 2.4%                        1","torrent":{"xt":"urn:btih:803e63b69e53a8a90d2af529f273800032556efc","amp;dn":"Scared_Sacred_%28Documentary%29_DVDrip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"803e63b69e53a8a90d2af529f273800032556efc","infoHashBuffer":{"type":"Buffer","data":[128,62,99,182,158,83,168,169,13,42,245,41,242,115,128,0,50,85,110,252]},"announce":[],"urlList":[]}}