{"title":"The Pleiadian Workbook: Awakening Your Divine Ka [iDeusEx]","uid":8600566,"size":671103,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:803ff687cbffdd81b7a192eab0a553e6eb98c117&amp;dn=The+Pleiadian+Workbook%3A+Awakening+Your+Divine+Ka+%5BiDeusEx%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"iDeusEx","files":-1,"time":1371866783,"description":"The Pleiadian Workbook: Awakening Your Divine Ka\n\nAmorah Quan Yin (Author)\n\n\n\n\nLEARN HOW TO CONSCIOUSLY ALIGN WITH YOUR HIGHER SELF AND DIVINE ONENESS! \n\nThe Pleiadian Workbook is a direct transmission from the Pleiadian Emissaries of Light-light beings from the Pleiades-who say its time now for spiritual growth, ascension, and healing. Through Amorah Quan Yin, we are taught to open our &quot;Ka Channels,&quot; which pull energy from our multidimensional holographic selves into our physical bodies. These galactic healing techniques align us with our divine selves, raise our vibratory rates, and rejuvenate and balance our bodies, while accelerating spiritual evolution and stimulating emotional healing. \n\n&quot;The Pleiadians are here now to offer all beings the opportunity to choose health and perfect balance in the midst of the energy acceleration. Amorah Quan Yin's Pleiadian Workbook is the source of Pleiadian energetic healing techniques, a gift of love and compassion during these amazing days.&quot; \n--Barbara Hand Clow. author of The Pleiadian Agenda and Heart of the Christos: Starseeding from the Pleiades \n\n&quot;This wonderful book can strengthen anyone's spiritual awareness and spiritual path. It is a step by-step guide to enlightenment and ascension, which then flow from each individual to all of humanity. It is a great blessing to Earth.&quot; \n--Joanna Cherry, founder of Ascension Mastery International \n\n&quot;The exercises Amorah gives are practical and necessary at this time of Earth transitions. Vast perspectives on Earth, the solar system, and galactic cycles are given to enable each person to transform karmic patterns. In this book we can find ways to forgive ourselves of past misdeeds and move on to unconditional, compassionate states of wholeness.&quot; \n--Rowena Pattee Kryder, MFA. Ph.D.. author of Sacred Ground to Sacred Space and Gaia Matrix Oracle \n\nAMORAH QUAN YIN has been a natural healer and psychic since birth, and as a child was gifted with clairvoyance and clairaudience. A personal health crisis in later years led her to a path of holistic living, spiritual awakening, and sharing her gifts with others. Amorah has become well known and respected as a healer, seer, and teacher in Mt. Shasta, California. where she maintains a private teaching and healing practice.","torrent":{"xt":"urn:btih:803ff687cbffdd81b7a192eab0a553e6eb98c117","amp;dn":"The+Pleiadian+Workbook%3A+Awakening+Your+Divine+Ka+%5BiDeusEx%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"803ff687cbffdd81b7a192eab0a553e6eb98c117","infoHashBuffer":{"type":"Buffer","data":[128,63,246,135,203,255,221,129,183,161,146,234,176,165,83,230,235,152,193,23]},"announce":[],"urlList":[]}}