{"title":"The.Neighbors.2012.S01E12.HDTV.x264-LOL","uid":8030457,"size":124039793,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:80d4cd26bc7a95b56b236f7daef442867818e2a1&amp;dn=The.Neighbors.2012.S01E12.HDTV.x264-LOL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Thhaque","files":1,"time":1358401253,"description":"The Neighbors\n\nGenre: Comedy\nYear: 2013\nCountry: USA\nRuntime: 22 min\nProducer: Chris Koch\nCast: Malcolm Bowen, Trisity Cameron, Tim Jo, Mobin Khan, Tracy Weisert, Max Charles, Isabella Cramp, Robert T. Barrett, Laura LaMonaco, Americus Abesamis\n\nIMDB: http://www.imdb.com/title/tt2182229/\n\n.: Plot :.\nHow well do you know your neighbors?\n\nMeet the Weavers, Debbie (Jami Gertz) and Marty (Lenny Venito). Marty, in hopes of providing a better life for his wife and three kids, recently bought a home in Hidden Hills, a gated New Jersey townhome community with its own golf course. Hidden Hills is so exclusive that a house hasn't come on the market in 10 years. But one finally did and the Weavers got it!\n\nIt's clear from day one that the residents of Hidden Hills are a little different. For starters, their new neighbors all have pro-athlete names like Reggie Jackson (Tim Jo), Jackie Joyner-Kersee (Toks Olagundoye), Dick Butkis (Ian Patrick) and Larry Bird (Simon Templeman). Over dinner, Marty and his family discover that their neighbors receive nourishment through their eyes by reading books, rather than eating. The Weavers soon learn that the entire community is comprised of aliens from Zabvron, where the men bear children and everyone cries green goo from their ears.\n\nThe Zabvronians have been stationed on Earth for the past 10 years, disguised as humans, awaiting instructions from home, and the Weavers are the first humans they've had the opportunity to know. As it turns out, the pressures of marriage and parenthood are not exclusive to planet Earth. Two worlds will collide with hilarious consequences as everyone discovers they can &quot;totally relate&quot; and learn a lot from each other.\n","torrent":{"xt":"urn:btih:80d4cd26bc7a95b56b236f7daef442867818e2a1","amp;dn":"The.Neighbors.2012.S01E12.HDTV.x264-LOL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"80d4cd26bc7a95b56b236f7daef442867818e2a1","infoHashBuffer":{"type":"Buffer","data":[128,212,205,38,188,122,149,181,107,35,111,125,174,244,66,134,120,24,226,161]},"announce":[],"urlList":[]}}