{"title":"Ciara feat. T-Pain - Go Girl","uid":4509690,"size":145301508,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:80fd2bb01ffe168a27136eefb60e635dea322bab&amp;dn=Ciara+feat.+T-Pain+-+Go+Girl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1226728558,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Go Girl&quot; is a song performed by American R&amp;B/pop singer Ciara. The song was recorded for her third studio album Fantasy Ride, which is set for release in January 2009. It is a female empowerment anthem that preaches control, featuring semi-auto-tune vocals and a mid-tempo beat.\n\nReleased as the first single from the album, &quot;Go Girl&quot; was released worldwide to digital outlets on September 30, 2008. \n\nDirected by Melina Matsoukas, the music video was shot on September 19 and September 20, 2008. The video begins with Ciara sitting in a chair at a desk with a typewriter with four female dancers behind her in chairs. She is dressed in a dominatrix catsuit and thigh-high black stiletto boots. Then, Ciara jumps off the desk and does a immediate split, She and her dancers perform erotic choreography on the chairs. Second, Ciara walks into an elevator. She gets in and performs erratic choreography and shows her transforming. Then, she exits the elevator. She and her dancers make robotic movements and dance routines. Shortly after, T-Pain performs his verse and dances. Ciara in a different sexy robotic costume is sitting on a motorcycle with sparks shooting from the back. Next, the music video goes to a dance break, calling all the &quot;Go Girls&quot; to the dance floor. Ciara slides down a pole and starts performing intense choregraphy with several dancers. The video concludes with Ciara typing &quot;Go Girl&quot; on the typewriter.\n\nThe music video for &quot;Go Girl&quot; premiered on BET&amp;#039;s &quot;Access Granted&quot; and Yahoo! Music on October 7, 2008. The following day, the video premiered on BET&amp;#039;s 106 &amp; Park. The video charted 106 &amp; Park on Tuesday October 14, 2008 six days after its premiere at the #9 position, and the video peaked at #1. The video premiered on MTV&amp;#039;s TRL on October 16, 2008.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:80fd2bb01ffe168a27136eefb60e635dea322bab","amp;dn":"Ciara+feat.+T-Pain+-+Go+Girl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"80fd2bb01ffe168a27136eefb60e635dea322bab","infoHashBuffer":{"type":"Buffer","data":[128,253,43,176,31,254,22,138,39,19,110,239,182,14,99,93,234,50,43,171]},"announce":[],"urlList":[]}}