{"title":"FAKE TORRENT PROCEDURE !! (A Start)","uid":10744564,"size":1275,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:80fffac90952396d7471e680526b3aa7a0a8a2be&amp;dn=FAKE+TORRENT+PROCEDURE+%21%21+%28A+Start%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zoocar","files":1,"time":1407805443,"description":"There is an individual, or are individuals that have chosen to implement attacks on The Pirate Bay by repeatedly and frequently posting fake torrents that most likely contain malicious computer code that may quite possibly be designed to take over your computer for nefarious and/or unscrupulous purposes.\n\nThese postings contain files that are .ZIP, .RAR and/or .WMV which may very easily affect your computer's performance.\n\nThe most obvious characteristics of these posters is that they have no posting history or credibility with The Pirate Bay.  A reputable and frequent poster will often bear at least a VIP icon next to the posting.  This is not meant to minimize the work of those that may post less frequently.\n\nA second, easily visible, trait of these malicious posters is the large quantity of postings in a very short period of time. These postings most often are sequential and have several withing a minute.\n\nPosting comments to these obviously fake torrents does nothing but feed the poster's obviously demented sensibilities.\n\nThe most direct action would be to post a notice to The Pirate Bay administrators through the &quot;Contact Us&quot; and &quot;Fake Torrents&quot; category with the poster's identity, and be patient while the administrators do their work.\n\n","torrent":{"xt":"urn:btih:80fffac90952396d7471e680526b3aa7a0a8a2be","amp;dn":"FAKE+TORRENT+PROCEDURE+%21%21+%28A+Start%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"80fffac90952396d7471e680526b3aa7a0a8a2be","infoHashBuffer":{"type":"Buffer","data":[128,255,250,201,9,82,57,109,116,113,230,128,82,107,58,167,160,168,162,190]},"announce":[],"urlList":[]}}