{"title":"The Dudesons - The Complete Season 1 [DVDRip]-SPRINTER","uid":5971445,"size":1473468463,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:812bb6cd082f5b142e29f8a981c6463fb4abe466&amp;dn=The+Dudesons+-+The+Complete+Season+1+%5BDVDRip%5D-SPRINTER&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"FaMoUz","files":-1,"time":1290300236,"description":"\n\n\n\n\n\n\n\n\n\n            The Dudesons - The Complete Season 1 [DVDRip]-SPRINTER\n\n\n\n\n\n\n\n\nPlot:\n\nThe Dudesons is a Finnish television series, which originally started in January 2001 under the Finnish name Extreme Duudsonit. A combination of extreme stunts, comedy and reality, the show has become the most wide-spread Finnish TV-series of all time. The show follows the every day life of four best friends, who have a tendency for anarchy and perilous situations. In January 2000, Laasala found work as an editor for a small cable TV-channel MoonTV. He saw a possibility to make his own show and the next month The Dudesons started shooting a self-financed pilot episode for a series. The pilot was finished in August 2000, and the channel immediately green lighted the first season, titled as Extreme Duudsonit. The episodes started running on MoonTV in January 2001, and the series became the most popular show in the channel. In September 2001, the Dudesons moved from MoonTV to Nelonen, the 2nd biggest commercial network in Finland. 2002 saw the coming of the 2nd season of the Extreme Duudsonit, and the same year The Dudesons were also elected as The Media Persons Of The Year by the readers of Finland's most popular youth magazine Suosikki. The third and fourth seasons run respectively in 2003 and 2004, with the latter expanding the previously stunt based show into a more varied reality comedy show. The fourth season also saw the introduction of the 5th member of the Dudesons, the male pet pig(originally called Satan), who has since then remained as an important character in The Dudesons TV-series. \n\n\n\n\nNOTE: this torrent contains an EXTRA episode only on tha DVD Box Set (episode 8)\n\n\n\n\nEpisode List:\n\nSeason 1, Episode 1: Introducing the Dudesons\n\nSeason 1, Episode 2: Mayhem on the Dudesons Ranch\n\nSeason 1, Episode 3: Summer Jobs\n\nSeason 1, Episode 4: Freezing to Death\n\nSeason 1, Episode 5: Neighbor Wars\n\nSeason 1, Episode 6: Fire in the House\n\nSeason 1, Episode 7: Friendship Hurts\n\n\n\n\n\n                    PLZ SEED AZ LONG AZ POSSIBLE &amp; ENJOY...","torrent":{"xt":"urn:btih:812bb6cd082f5b142e29f8a981c6463fb4abe466","amp;dn":"The+Dudesons+-+The+Complete+Season+1+%5BDVDRip%5D-SPRINTER","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"812bb6cd082f5b142e29f8a981c6463fb4abe466","infoHashBuffer":{"type":"Buffer","data":[129,43,182,205,8,47,91,20,46,41,248,169,129,198,70,63,180,171,228,102]},"announce":[],"urlList":[]}}