{"title":"Arthur, The Complete Season 11 (SD iTunes WEB-DL)","uid":10548212,"size":3476835184,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:814ccad102b34ab6ee01d595145c20fc20a429cd&amp;dn=Arthur%2C+The+Complete+Season+11+%28SD+iTunes+WEB-DL%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":4,"uploader":"KJFinster","files":10,"time":1405308391,"description":"Arthur, The Complete Season 11 (SD iTunes WEB-DL)\n\nSchool is out, and Arthur and his friends are back with 10 new episodes. The new season kicks off with &quot;Swept Away&quot; as Arthur, D.W., and Buster spend a few days at the beach discovering the simple joys of building sandcastles. But can they save their beloved creation from the inevitable ocean tides? Other new episodes include: &quot;Germaphobia,&quot; in which Buster's friends have had enough of his sloppy habits, so they band together to educate him on the realities of germs; &quot;Buenas Noches, Vicita,&quot; where we find Vicita Molina having lost her favorite book; and &quot;Prunella Packs It In,&quot; where, after piling on the extra-curricular activities, Prunella begins to crack under the heavy load. Also this season, Arthur goes behind the camera when he is inspired by special guest star Matt Damon to try his hand at filmmaking. Responding to Matt's call for homemade videos for his latest project, &quot;Postcards from You!,&quot; Arthur and his friends join kids from all over the country to make one-minute videos about their lives. Matt is so inspired by Arthur's friends and family that he asks Arthur if he would be interested in starring in his own TV show. (Hmm, so is that how it all started?)\n\nAll episodes come from the iTunes Store, with all the iTunes metadata, and most of them with subtitles in CC format.\n\nIf you need to use this files as MP4s, change the extension.\n\n\nRemember to share and enjoy!\n","torrent":{"xt":"urn:btih:814ccad102b34ab6ee01d595145c20fc20a429cd","amp;dn":"Arthur%2C+The+Complete+Season+11+%28SD+iTunes+WEB-DL%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"814ccad102b34ab6ee01d595145c20fc20a429cd","infoHashBuffer":{"type":"Buffer","data":[129,76,202,209,2,179,74,182,238,1,213,149,20,92,32,252,32,164,41,205]},"announce":[],"urlList":[]}}