{"title":"The Mentalist S1 E4 (2008)nl.subs.NLT-Release (DivX)","uid":4624885,"size":786162428,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:82156f5b5bd22c61ddf0239d6fbf836d28439ba8&amp;dn=The+Mentalist+S1+E4+%282008%29nl.subs.NLT-Release+%28DivX%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"linday1","files":-1,"time":1231176179,"description":"De nieuwe Amerikaanse hitserie The Mentalist is vanaf 1 januari wekelijks te zien op SBS 6. Deze crimeserie vertelt het verhaal van Patrick Jane: een zeer bekende, voormalig televisieparagnost die, nadat hij ontmaskert is als fraudeur, nu zijn echte vaardigheden als mentalist gebruikt om het Californie Bureau of Investigation te helpen met het oplossen van misdrijven. Als mentalist, gebruikt Patrick Jane zijn zeer ontwikkelde kundigheden: observeren, afleiden en manipuleren, om het Serious Crime Team te ondersteunen. Hij is charismatisch, een beetje vreemd - en stuurs, en zijn moderne Sherlock Holmes achtige, opzienbarende methodes overschrijden vaak een grens, maar deze methodes geven hem uiteindelijk vaak gelijk.\n\nTeresa Lisbon is een top agent van het CBI die vaak met Patrick Jane samenwerkt. Alhoewel ze schoorvoetend moet toegeven dat hij talent heeft en dat zijn methodes vaak werken, is ze vastberaden de misdrijven op te lossen, met of zonder hem.\n\n\n[b]Season 1: Episode 04: Ladies in Red[/b]\nThe CBI team investigates the murder of a wealthy investment banker, found tortured before being bolted inside his hidden &quot;safe room.&quot; At the memorial service, Patrick Jane flirts with the widow and gets her to reveal the victim was a many of many secrets. Through further investigation, the team learns she was living a dual life between suburban wife and young mistress, and was also skimming millions from clients and hoarding it away in a secret place. While the team suspects the killer is after the money, their suspicions are confirmed when the victim's daughter is kidnapped in exchange for the hidden money. Jane suspects the wife and mistress so he sets up a mental conundrum, testing their interest in finding the money or child. In the end, the greedy killer shows her true colors.\n\n\nVoor de nieuwste films en muziek ga je naar NLT.Ons-Forum het forum voor de Nederlands Ondertitelde Torrents:\n\n &lt;a href=&quot;\nhttp://www.nlt.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.nlt.ons-forum.nl&lt;/a&gt;\n\n\nEnjoy The Movie!!!!!!","torrent":{"xt":"urn:btih:82156f5b5bd22c61ddf0239d6fbf836d28439ba8","amp;dn":"The+Mentalist+S1+E4+%282008%29nl.subs.NLT-Release+%28DivX%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82156f5b5bd22c61ddf0239d6fbf836d28439ba8","infoHashBuffer":{"type":"Buffer","data":[130,21,111,91,91,210,44,97,221,240,35,157,111,191,131,109,40,67,155,168]},"announce":[],"urlList":[]}}