{"title":"Botanical Medicine for Womens Health{BBS}","uid":6700531,"size":32357716,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:834ad91ea2647e19635a8d843139ab63a0191400&amp;dn=Botanical+Medicine+for+Womens+Health%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1316910277,"description":"A comprehensive resource of medical and herbal interventions related to women's health issues, Botanical Medicine for Women's Health provides a unique combination of traditional and modern scientific data on herbal medicine. Written by Aviva Romm, MD, an experienced herbalist, physician, and midwife, this guide blends a clinician-sensitive and patient-centered approach to women's health issues. Coverage of menstrual health, fertility, breast conditions, and more makes this an essential resource for everyday practice.\n\nWinner of the 2010 American Botanical Council's James A. Duke Excellence in Botanical Literature Award!\n\n\n    * Expert author Dr. Aviva Romm combines her experience as an herbalist, physician, and midwife for a fully integrated approach to medical and botanical interventions.\n\n    * Convenient organization begins with herbal medicine and then covers health conditions organized chronologically by lifecycle help you understand the relationship between herbal medicine and women's health.\n\n    * Plant profiles include principle uses, clinical indications, and safety information on the 10 most commonly used botanicals for women's health.\n\n    * Detailed illustrations and professional plant photographs enable you to identify herbs visually as well as by substance make-up.\n\n    * Specialized focus on women's health and botanical medicine provides the specific information you need for treating women at any stage of life.\n\n    * Content on over 150 botanicals for over 35 different conditions make this a comprehensive resource for current, evidence-based information.\n\n    * Appendices on common botanical names, quick dose reference charts, adverse interactions, and botanical medicine resources offer practical information at a glance.\n\n    * Over 30 expert contributors with a combination of practical experience as clinicians and teachers provide a unique, clinically based perspective on botanical medicine.\n\nProduct Details\n\n    * Paperback: 720 pages\n    * Publisher: Churchill Livingstone; 1 edition (April 21, 2009)\n    * Language: English\n    * ISBN-10: 0443072779\n    * ISBN-13: 978-0443072772","torrent":{"xt":"urn:btih:834ad91ea2647e19635a8d843139ab63a0191400","amp;dn":"Botanical+Medicine+for+Womens+Health%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"834ad91ea2647e19635a8d843139ab63a0191400","infoHashBuffer":{"type":"Buffer","data":[131,74,217,30,162,100,126,25,99,90,141,132,49,57,171,99,160,25,20,0]},"announce":[],"urlList":[]}}