{"title":"Folder Protect v1.8.9 + License [ThumperRG]","uid":6334450,"size":3732671,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:83c40d1eee47338d0ba4255f7a627ebafb43de48&amp;dn=Folder+Protect+v1.8.9+%2B+License+%5BThumperRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rahulro","files":-1,"time":1303412271,"description":"More AT: &lt;a href=&quot; http://thumperdc.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thumperdc.com&lt;/a&gt;\n\nOverview:\n\nFolder Protect is a new concept in Data Security. It lets you password protect and set different access rights to your files, folders, drives, installed programs and popular extensions.\n\nFolder Protect goes beyond normal file locking and encryption by letting you customize your security and choose between making files inaccessible, hidden, delete-proof or write-protected.\n\nThe program uses Windows Kernel level protection that even works in Safe Mode ensuring complete security of protected folders. You can lock, hide, access block and even prevent data from being deleted or modified. This can help you give access of your data to others without worrying about it getting deleted or modified.\n\nFolder Protect can't be uninstalled without a correct password. Furthermore, the program can work in complete stealth and you can choose an idle time when the data gets protected automatically.\n\nFolder Protect offers an easy and uncomplicated way to select security type and make your files inaccessible, hidden, write-protected and delete-proof by choosing No Access, No Visible, No Write and No Delete respectively. You can also set a combination of these protection types according to their needs; e.g. No Delete and No Write can be selected simultaneously to make your files delete-proof and write-protected.\n\nFolder Protect's Masking Protection is another valuable feature that protects all popular extensions like *.avi, *.gif, *.jpeg, *.bmp, *.mp3, *.wmv, *.mpeg, *.doc and many more. It lets you protect all the files of a same format with a single mouse click.\n\nFurthermore, Folder Protect's Context Menu allows you to password protect your files directly from the Windows Explorer without the need to start the program first.\n\nGive Folder Protect a try to see what it's all about!\n\nInstallation Instructions:\n\n1. Install The Software.\n2. Open The &quot;License.exe&quot; File In &quot;License&quot; Folder And It Will Get Registered.\n3. Done. Enjoy!!\n\nBy ThumperRG\n\nMore AT: &lt;a href=&quot; http://thumperdc.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thumperdc.com&lt;/a&gt;","torrent":{"xt":"urn:btih:83c40d1eee47338d0ba4255f7a627ebafb43de48","amp;dn":"Folder+Protect+v1.8.9+%2B+License+%5BThumperRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83c40d1eee47338d0ba4255f7a627ebafb43de48","infoHashBuffer":{"type":"Buffer","data":[131,196,13,30,238,71,51,141,11,164,37,95,122,98,126,186,251,67,222,72]},"announce":[],"urlList":[]}}