{"title":"U2 - Where The Streets Have No Name","uid":4674803,"size":178040836,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:854521213c328e39594a58332481371989c5e851&amp;dn=U2+-+Where+The+Streets+Have+No+Name&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"2nafish","files":-1,"time":1232863396,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Where the Streets Have No Name&quot; is a song by Irish rock band U2, from their 1987 album, The Joshua Tree. It was released August 1987 as the third single from The Joshua Tree. Bono was inspired to write the lyrics by the notion that it's possible to identify a person's religion by the street on which they lived, particularly in Belfast, and also their income depending upon the part of the street. Amidst difficulties recording the song, producer Brian Eno attempted to erase it. The song's signature is a repeating guitar arpeggio utilizing a delay effect that is played at the beginning and end of the song.\n\nIt peaked at #14 in Canada, #10 in The Netherlands and #4 in the United Kingdom. The song became a staple of live shows, being played 645 times at 642 shows since its inaugural performance 2 April 1987 in Tempe, Arizona. Its critical reception was mostly warm, praised by music critics such as Rolling Stone. In Rolling Stone issue 1054, the song was ranked 28th in the issue's list of the &quot;100 Greatest Guitar Songs of All Time.&quot;\n\nThis song is played during the home introduction of the Baltimore Ravens of the NFL and the Vancouver Canucks of the NHL.\n\nThis video was directed by Meiert Avis. The song was performed to playback on the rooftop of the Republic Liquor Store at East 7th Street and South Main Street in Los Angeles on 27 March 1987. The scenes including the police shutting the video down due to traffic concerns are real, although the video was edited and heavily overdubbed to make it appear the band defied the police and kept on filming the video. In reality they stopped performing upon being ordered to do so. In 1988, the music video won a Grammy Award for &quot;Best Performance Music Video&quot;. At the beginning of the video, the tune of Bullet the Blue Sky can be heard.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:854521213c328e39594a58332481371989c5e851","amp;dn":"U2+-+Where+The+Streets+Have+No+Name","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"854521213c328e39594a58332481371989c5e851","infoHashBuffer":{"type":"Buffer","data":[133,69,33,33,60,50,142,57,89,74,88,51,36,129,55,25,137,197,232,81]},"announce":[],"urlList":[]}}