{"title":"Asiapa Universalis Europa Universalis IV mod","uid":11030517,"size":35368,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:86114ee481c92e215908864939f3d308bb65d691&amp;dn=Asiapa+Universalis+Europa+Universalis+IV+mod&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Nimbleton","files":-1,"time":1410720821,"description":"Asiapa Universalis Europa Universalis IV mod\n\n\nDESCRIPTION\nChanges in Asiapa Universalis \n\nThis mod is designed to make the rest of the world a little bit more playable in multiplayer games, specifically making an Asia only game fun and rewarding. \n\nTechnology \nCurrently, tech groups are rather painful due to the pain of westernizing right now. To compensate, I've added a decrease in idea cost to all of the tech groups between and including Muslim to Chinese. These bonuses will apply when the country is above two stability. Idea cost decreases start at 5% and move up by 5% for each tech group, with the exception of the Nomad group who are at only 10%, due to the fact that Nomads are already rather powerful. So this means \nMuslims get -.05 idea cost \nIndians get -.10 idea cost \nChinese get -.15 idea cost \nHordes get -.10 idea cost \n\nWestern Arms Trade is also no longer available to eastern and ottoman countries. This is so that these tech group countries cannot have better tech percentages than western countries. To compensate, eastern and ottoman tech are both 5% cheaper(so eastern is 15%, and Ottoman is 20%). \n\nMap \nZhou, Xi, and Shun now control the land that once was Ming. Ming is a truly interesting country to play in singleplayer, but rather painful to play in multiplayer, as well as being a big massive blob extremely early in the game. All three countries are significantly more player friendly, as they start with despotic monarchy as a government type. \n\nJapan has gained a significant number of it's prior vassals' lands, and the vassals that remain are larger now. This should help Japan form faster, making Japan's first session a bit more entertaining. The Shogunate government has been adjusted to make Japan still maxed on relations, and has gained a relations modifier instead. \n\nIdeas \nMing's three celestial Kingdoms have had their ideas changed to be Chinese instead of national ideas. \n\nWith the decrease in idea cost for lower tech groups, some countries become exceptionally powerful due to their country ideas, so any country idea group that grants a decrease in idea cost has had it moved to the ambition. This does not include Western, Eastern, or Native tech groups. Affected nations are all Chinese nations, Tibet, all Malayan nations, all Daimyo nations, and Korea. \n\nChampa has inherited South Indian ideas, because historically Champa imitated much of India culturally and religiously. \n\nReligion \nAll eastern religions now have a +3 tolerance of heretics, given by a triggered modifier. The religions themselves all have a -1 tolerance of heathens plus a unique bonus. Confucians get +10% production efficiency, Buddhists receive a -10% land maintenance modifier, and Shinto still receives its +10% army morale. Buddhist and Confucians can now convert to Buddhist and Confucian for a cost of 100 prestige wherein they gain religious zeal, but there's no ducat bonus like a converting Christian. Shinto remains isolated. \n\nTrade \nThe Canton trade node now feeds into Siam. \nPhilippines no longer feed into California. \nHudson Bay now feeds into California. \nMexico no longer feeds into Nippon. \nBrazil now feeds into Peru \nMississippi now feeds into Mexico \nMexico, Peru, and Panama now feed into a new trade node called Eastern Asia. This trade node functions like Western Europe, except for Asia. It feeds into Nippon, Beijing, Hangzhou, Canton, and Malacca. \n\nWesternizing \nA new way of westernizing is available, based on decisions. Each decision will move you up one tech level. Overall, it will cost you more than clicking the westernize button on the tech page, but the results will be a little more direct. Each tech group up to ottomaneastern will cost you 100 of each power, three stability, 10 legitimacy, and 100 ducats. Moving from Muslim to Ottoman and Ottoman/Eastern to Western will cost 300 of each power, three stablity, 30 legitimacy, and 300 ducats. For ten years after each move you'll have the effect of westernizing which gives an extra three revolt risk, tech will be 5% more expensive, and you won't be able to accept the next westernize decision. \n\nIncorporating BrockMod \nI've also incorporated BrockMod into this, so all credit for modifying relationships goes to Brockosaurus. His mod removes the competing great powers relations, historical friends relations, and historical enemies relations.","torrent":{"xt":"urn:btih:86114ee481c92e215908864939f3d308bb65d691","amp;dn":"Asiapa+Universalis+Europa+Universalis+IV+mod","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"86114ee481c92e215908864939f3d308bb65d691","infoHashBuffer":{"type":"Buffer","data":[134,17,78,228,129,201,46,33,89,8,134,73,57,243,211,8,187,101,214,145]},"announce":[],"urlList":[]}}