{"title":"AD Sound Recorder v5.4.5 with Key [TorDigger]","uid":8054257,"size":2258890,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:8615988ce03cabd3168c9742f0c9017676fe93cb&amp;dn=AD+Sound+Recorder+v5.4.5+with+Key+%5BTorDigger%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TorDigger","files":10,"time":1358922114,"description":"AD Sound Recorder\n\nAD Sound Recorder is a sound record program. It can record all audio from your sound card into MP3, WMA or WAV format. Real-time sound visualization enables you to adjust your audio source and make high quality recordings.\n\nAD Sound Recorder features include hot switching of the working audio source, waveform and spectrum monitoring, a peak indicator with sound clipping detectors, recording control with the hotkeys, a built-in player, a file list and an ID3 Tag editor.\n\nKey Features:\n\nReal-time sound monitoring:\nÂ· This feature lets you check the selected audio source and adjust its volume. You can see a sound waveform, spectrum and peak amplitude and change the volume level on the fly to avoid sound clipping.\n\nHot switching of the active (working) audio device and audio source for Vista:\nÂ· AD Sound Recorder detects any changes you have made with the active audio device and source and the program will be restarted automatically.\n\nSound clipping detection:\nÂ· The program detects and displays sound clipping events if sound level is very high. These events reduce of the current recording quality.\n\nRecord control with hotkeys:\nÂ· Hotkeys make start or stop recording quickly either the program is maximized or minimized on the taskbar.\n\nConvert WAV into MP3:\nÂ· You can record a WAV file with CD-quality and then convert it into MP3 format with a bitrate as you wish.\n\nPlaying files:\nÂ· The program includes a built-in player so you can play any file just after recording.\n\nEditing of ID3 Tags for MP3 files:\nÂ· AD Sound Recorder allows you to create or edit ID3 TAGs for MP3 files with a built-in editor.\n\nPlatforms: \n\nWindows 2000, XP, 2003, Vista, 7\n\nHomepage: http://www.adrosoft.com/\n\nInstallation Instructions:\n\n1. Install Program.\n2. Use given Serial to register application.\n3. Done, Enjoy.\n\nHave A Nice Day\n\nNote: Uploader is only responsible if any problem in torrent, never responsible for software functionality problems.","torrent":{"xt":"urn:btih:8615988ce03cabd3168c9742f0c9017676fe93cb","amp;dn":"AD+Sound+Recorder+v5.4.5+with+Key+%5BTorDigger%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8615988ce03cabd3168c9742f0c9017676fe93cb","infoHashBuffer":{"type":"Buffer","data":[134,21,152,140,224,60,171,211,22,140,151,66,240,201,1,118,118,254,147,203]},"announce":[],"urlList":[]}}