{"title":"EXPLOITED COLLEGE GIRLS - Leah - Her First Hard Fuck 720p *NEW*","uid":10670071,"size":2912439917,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:86880f26047181a89a63535041ebbb11910ad507&amp;dn=EXPLOITED+COLLEGE+GIRLS+-+Leah+-+Her+First+Hard+Fuck+720p+%2ANEW%2A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"beta2008x","files":1,"time":1406856737,"description":"\n &lt;a href=&quot;\nhttp://imgboxxx.com/viewer.php?file=75we5_lh.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgboxxx.com/viewer.php?file=75we5_lh.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgboxxx.com/viewer.php?file=glpb4_ecg_14_07_31_leah_s.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgboxxx.com/viewer.php?file=glpb4_ecg_14_07_31_leah_s.jpg&lt;/a&gt;\n\n\nFrom her long legs to her big smile to her perfect little backside it's hard to pick Leah's best feature, but an informal vote here at Ex Co Gi has her amazing dick sucking lips in first place (especially after you see what she does with them despite her innocent Utah upbringing). This tall drink of water has more to offer than her oral skills, though. For fans of slim, petite girls she's near perfection with a perky set of A cups and an inner thigh gap that would make a 108 pound girl feel fat.\n\nJay is obviously smitten with her, he has the camera on her as soon as he picks her up from the airport and is grilling her about her turns ons. As soon as Leah admits that she's turned on by doing &quot;bad&quot; things and confesses that she's a bit of a naughty girl, he's already making plans. Once back at the hotel, Jay delves into Leah's love life and finds out that she's tried just about everything except toys (seems legit, aren't vibrators illegal in Utah?) and pretty much liked it all. Just what we look for in an Ex Co girl.\n\nWith a sassy look over her shoulder, Leah marches to the bed to get this party started. Jay dives in with just his fingers and manages to coax a quiet orgasm out of her in a scant few minutes. This will definitely be the first of many. He graduates to a vibrator and gets her off again, possibly twice. Leah returns the favor with a slow, sloppy wet blowjob that is so good you should probably rewind 2 or 3x to make sure you see every second of it.\n\nAfter more quiet but completely real orgasms in doggy style, on her back and from the side our man can't hold back and pumps a huge load into Leah, hoping for a nice, messy creampie. Oddly, Leah turns out to be so tight that hardly a drop of jizz makes its way out despite her pushing and fingering herself. Bad for fans of creampies, yes. But good for the sheets, everyone hates a wet spot, right?\n","torrent":{"xt":"urn:btih:86880f26047181a89a63535041ebbb11910ad507","amp;dn":"EXPLOITED+COLLEGE+GIRLS+-+Leah+-+Her+First+Hard+Fuck+720p+%2ANEW%2A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"86880f26047181a89a63535041ebbb11910ad507","infoHashBuffer":{"type":"Buffer","data":[134,136,15,38,4,113,129,168,154,99,83,80,65,235,187,17,145,10,213,7]},"announce":[],"urlList":[]}}