{"title":"Growth and Collapse of the Tibetan Plateau","uid":6517753,"size":7705418,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:87697d863ca36e3f024edbd867044df074ff1bb1&amp;dn=Growth+and+Collapse+of+the+Tibetan+Plateau&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"_F1_","files":-1,"time":1309887763,"description":"R. Gloaguen, &quot;Growth and Collapse of the Tibetan Plateau - Special Publication 353 (Geological Society Special Publication)&quot;\n Publisher: Geological Society Of London | 2011 | ISBN: 1862393265 | PDF | 264 pages | 12.2 MB\n\n Despite agreement on first-order features and mechanisms, critical aspects of the origin and evolution of the Tibetan Plateau, such as the exact timing and nature of collision, the initiation of plateau uplift, and the evolution of its height and width, are disputed, untested or unknown. This book gathers papers dealing with the growth and collapse of the Tibetan Plateau. The timing, the underlying mechanisms, their interactions and the induced surface shaping, contributing to the Tibetan Plateau evolution are tightly linked via coupled and feedback processes. We therefore present cross-disciplinary contributions which allow insight into the complex interactions between lithospheric dynamics, topography building, erosion, hydrological processes and atmospheric coupling. The book is structured in four parts: early processes in the plateau formation; recent growth of the Tibetan Plateau; mechanisms of plateau growth; and plateau uplift, surface processes and the monsoon.\n\n The Geological Society of London\n\n Founded in 1807, the Geological Society of London is the oldest geological society in the world, and one of the largest publishers in the Earth sciences.\n\n The Society publishes a wide range of high-quality peer-reviewed titles for academics and professionals working in the geosciences, and enjoys an enviable international reputation for the quality of its work.\n\n The many areas in which we publish in include:\n\n -Petroleum geology\n -Tectonics, structural geology and geodynamics\n -Stratigraphy, sedimentology and paleontology\n -Volcanology, magmatic studies and geochemistry\n -Remote sensing\n -History of geology\n -Regional geology guides","torrent":{"xt":"urn:btih:87697d863ca36e3f024edbd867044df074ff1bb1","amp;dn":"Growth+and+Collapse+of+the+Tibetan+Plateau","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87697d863ca36e3f024edbd867044df074ff1bb1","infoHashBuffer":{"type":"Buffer","data":[135,105,125,134,60,163,110,63,2,78,219,216,103,4,77,240,116,255,27,177]},"announce":[],"urlList":[]}}