{"title":"Dallas Cowboys Cheerleaders Making The Team S09E05 WEB x264 mp4.","uid":10995187,"size":239941623,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:87d9e2016bbbc2146d2ad905c88c8454d082a38f&amp;dn=Dallas+Cowboys+Cheerleaders+Making+The+Team+S09E05+WEB+x264+mp4.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"herbsmokinfreak","files":1,"time":1410055804,"description":"To be a Dallas Cowboys Cheerleader, you need to look like a Dallas Cowboys Cheerleader. This week, Kelli makes sure all the girls have the look. Starting with makeovers, the new girls travel to the swank Halcyon salon for new hairdos. Two ladies get extreme makeovers and shockingly come out looking like new people. The veterans on weight probation visit My Fit Foods and learn how to lose weight the healthy way. Many personal and funny eating habits are revealed. Meanwhile, the girls still need to dance. A guest choreographer is brought in to teach the squad a new country routine that will be performed during the season. It's a super-hard dance, and many of the girls struggle. Then, it's off to Belk to learn to dress like a Dallas Cowboys Cheerleader. The new girls are surprised when they find out they will have to walk in a fashion show as Kelli and Judy judge their presence and appearance. Melissa Rycroft mentors three ladies who are on the bubble and need extra help. The final rehearsal of the week brings emotions to the forefront as a girl is sent home. \n\n","torrent":{"xt":"urn:btih:87d9e2016bbbc2146d2ad905c88c8454d082a38f","amp;dn":"Dallas+Cowboys+Cheerleaders+Making+The+Team+S09E05+WEB+x264+mp4.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87d9e2016bbbc2146d2ad905c88c8454d082a38f","infoHashBuffer":{"type":"Buffer","data":[135,217,226,1,107,187,194,20,109,42,217,5,200,140,132,84,208,130,163,143]},"announce":[],"urlList":[]}}