{"title":"Marvel's Daredevil - Season 1 (720p)","uid":13174515,"size":22738179501,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:89bbf6407adc84f4c3b1f317c0f54c5063b73f07&amp;dn=Marvel%27s+Daredevil+-+Season+1+%28720p%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"Zero_Assassin","files":14,"time":1452273537,"description":"Marvel's Daredevil, or simply Daredevil, is an American web television series created for Netflix by Drew Goddard, based on the Marvel Comics character of the same name. It is set in the Marvel Cinematic Universe (MCU), sharing continuity with the films of the franchise, and is the first in a series of shows that will lead up to a Defenders crossover miniseries. The series is produced by Marvel Television in association with ABC Studios, DeKnight Productions and Goddard Textiles, with Steven S. DeKnight serving as showrunner on the first season, Doug Petrie and Marco Ramirez taking over for the second, and Goddard serving as consultant.\r\n\r\nCharlie Cox stars as Matt Murdock / Daredevil, a blind lawyer-by-day who fights crime at night. Daredevil entered development in late 2013, a year after the film rights to the character reverted to Marvel, with Goddard initially hired in December 2013. DeKnight replaced him as showrunner and Cox was hired to star in May 2014, with Deborah Ann Woll, Elden Henson, and Rosario Dawson also starring. Additional season one stars include Toby Leonard Moore, Vondie Curtis-Hall, Bob Gunton, Ayelet Zurer, and Vincent D'Onofrio, while Jon Bernthal, Élodie Yung, and Stephen Rider join the cast for season two. Filming takes place in New York City, in areas that still look like the old Hell’s Kitchen.\r\n\r\nAll episodes of the first season premiered on April 10, 2015. They were released to critical acclaim, with critics praising the action sequences, performances, and the darker tone compared to other properties set in the MCU. On April 21, 2015, Marvel and Netflix renewed Daredevil for a second season, due to premiere on March 18, 2016.\r\n\r\n\r\n\r\n\r\nAll 13 episodes, in MKV format, and at 1280x720p. Great audio and video quality.\r\n\r\nPlease continue to seed so that others can share also. Cheers. :)","torrent":{"xt":"urn:btih:89bbf6407adc84f4c3b1f317c0f54c5063b73f07","amp;dn":"Marvel%27s+Daredevil+-+Season+1+%28720p%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89bbf6407adc84f4c3b1f317c0f54c5063b73f07","infoHashBuffer":{"type":"Buffer","data":[137,187,246,64,122,220,132,244,195,177,243,23,192,245,76,80,99,183,63,7]},"announce":[],"urlList":[]}}