{"title":"The Bone Bed - Patricia Cornwell","uid":7862771,"size":35616,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:89ed6a453a8eef4ac43b410c0356d590fbb464e8&amp;dn=The+Bone+Bed+-+Patricia+Cornwell&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"michilllie","files":-1,"time":1353979251,"description":"This is my second attempt at my first upload, so be gentle with me. If it works out, I have thousands of audio books and DVDs to upload. My fingers are crossed.\n\nPlease comment and let me know if does or does not work. I'm a little concerned because of the small file size. Thanks\n\nThe Bone Bed (Kay Scarpetta #20)\nby Patricia Cornwell\n\nA woman has vanished while digging a dinosaur bone bed in the remote wilderness of Canada. Somehow, the only evidence has made its way to the inbox of Chief Medical Examiner Kay Scarpetta, over two thousand miles away in Boston. She has no idea why. But as events unfold with alarming speed, Scarpetta begins to suspect that the paleontologistÎ“Ã‡Ã–s disappearance is connected to a series of crimes much closer to home: a gruesome murder, inexplicable tortures, and trace evidence from the last living creatures of the dinosaur age.\n\nWhen she turns to those around her, Scarpetta finds that the danger and suspicion have penetrated even her closest circles. Her niece Lucy speaks in riddles. Her lead investigator, Pete Marino, and FBI forensic psychologist and husband, Benton Wesley, have secrets of their own. Feeling alone and betrayed, Scarpetta is tempted by someone from her past as she tracks a killer both cunning and cruel.\n\nThis is Kay Scarpetta as you have never seen her before. The Bone Bed is a must read for any fan of this series, or an ideal starting point for new readers.\n\nEnjoy!\tAnd Seed Please. :)\n","torrent":{"xt":"urn:btih:89ed6a453a8eef4ac43b410c0356d590fbb464e8","amp;dn":"The+Bone+Bed+-+Patricia+Cornwell","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89ed6a453a8eef4ac43b410c0356d590fbb464e8","infoHashBuffer":{"type":"Buffer","data":[137,237,106,69,58,142,239,74,196,59,65,12,3,86,213,144,251,180,100,232]},"announce":[],"urlList":[]}}