{"title":"John Coltrane - Lush Life (1958 ) [Jazz][mp3 320][schon55]","uid":5694201,"size":87522966,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:8a314d74d3f98765fd33ba7bc38a55383767b704&amp;dn=John+Coltrane+-+Lush+Life+%281958+%29+%5BJazz%5D%5Bmp3+320%5D%5Bschon55%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"schon55","files":10,"time":1279222316,"description":"John Coltrane - Lush Life \nOriginal: 1958\nAudio CD: October 25, 1990 \nFormat: Original recording reissued \nLabel: Ojc \nQuality: mp3 320 kbps\n\nMost of these Prestige titles are blowing sessions, albeit pretty damn good blowing sessions as the jazz artists are talented live performers and these albums are nothing but little snippets of live performances. Generally, these cds by Miles Davis, Red Garland or John Coltrane give you that after-hours, dark, smoky nightclub feel. They're great to just toss on, and chill out because you not only feel like you're there, but also there really are some stellar performances as well. \nLush Life was one of those albums John Coltrane recorded sometime between his stint with Thelonious Monk and Miles Davis in the late 1950's. This is Coltrane at the top of his game during his fabled &quot;sheets of sound&quot; era, but also perhaps some of his most restrained. The first three tunes are piano-less (&quot;the piano player didn't show up&quot;) reworkings of old classics (&quot;Like Someone in Love,&quot; &quot;I Love You&quot;) and an original (&quot;Trane's Slo Blues&quot;). The absence of the piano though, allows Coltrane to really dig deep, especially the Latino reworking of &quot;I Love You.&quot; The last two tracks come from a later session in which the piano player did show up, and they are joined by a young Donald Byrd on trumpet. While the first three tracks previously mentioned are worth the price of admission, the band's rendition of Billy Strayhorn's classic Lush Life is literally awesome. Coltrane would later record this with vocalist, Johnny Hartman, but here his playing is strong and hard, and Byrd's solo, almost an afterthought adds to the excitement. \n\nIf you're new to jazz, or new to John Coltrane, this is an excellent album to start off with. I believe however, that Lush Life is the cornerstone to any jazz collection. First, Coltrane rarely recorded without a piano player and it's fascinating to hear him in this context. Second and most important, this is simply one of his best performances on record during the 50's. Essential. ~ Arsophagus Wu\n\nThis album reflects a time when Coltrane was searching musically, as well as spiritually. In the transition of leaving Miles Davis for good, Coltrane knew he had to make a good few albums for his label of the time, Original Jazz Classics. While this period is not widely considered his best, I would be inclined to say that none of his music is &quot;bad,&quot; and this album absolutely smokes. The title track is beautiful, jaunting; and &quot;Trane's Slow Blues&quot; is my definite favorite from this period. &quot;Like Someone In Love&quot; is absolutely and supremely melodic, and is also one of Trane's best of this period. This is not Giant Steps, or My Favorite Things, but this album has a feel all it's own. More blues rooted than a lot of his albums, but it is not blues at all, except for track #3. Five Stars. ~ &quot;wednightprayermeeting&quot;\n\nPersonnel:\nJohn Coltrane (tenor saxophone)\n#1-3:\nEarl May (bass)\nArthur Taylor (drums)\n#4-5:\nDonald Byrd (trumpet)\nRed Garland (piano)\nPaul Chambers (bass)\nLouis Hayes (drums on #4)\nAlbert &quot;Tootie&quot; Heath (drums on #5)\n\nJohn Coltrane - Lush Life Tracks:\n01  Like Someone In Love\n02  I Love You\n03  Trane's Slo Blues\n04  Lush Life\n05  I Hear A Rhapsody\n","torrent":{"xt":"urn:btih:8a314d74d3f98765fd33ba7bc38a55383767b704","amp;dn":"John+Coltrane+-+Lush+Life+%281958+%29+%5BJazz%5D%5Bmp3+320%5D%5Bschon55%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a314d74d3f98765fd33ba7bc38a55383767b704","infoHashBuffer":{"type":"Buffer","data":[138,49,77,116,211,249,135,101,253,51,186,123,195,138,85,56,55,103,183,4]},"announce":[],"urlList":[]}}