{"title":"Politically Incorrect Guide to the Middle East (M4B format)","uid":4962808,"size":371316915,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:8a3946475dcd68b811c2d825ef49bbfeed2a8fe3&amp;dn=Politically+Incorrect+Guide+to+the+Middle+East+%28M4B+format%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"spanikopita","files":2,"time":1245395337,"description":"[This is in M4B. Suited for iPod audiobooks.]\n\nThe Politically Incorrect Guide to the Middle East\n\nProduct Description\n\nWhy most of what you think you know about the Middle East is wrong \nThe Middle East: a region that's almost never off the front pages, yet one most Americans know little about. The mainstream media and Ivy League academics only make matters worse by casting everything in the usual politically correct mold: Arab terrorists are just desperate freedom fighters, and the region's one free democracy--Israel--is the oppressor, not least because of its alliance with America. And if Islamic extremism is a problem, the establishment tells us, it's only because it's rooted in that source of all evils: religion. A different strain of political correctness has seeped into some minds on the right--most notably the Bush administration, which, so ready to buy into the egalitarian myths we are all taught, believed that Western-style democracy could flourish anywhere. Now, in The Politically Incorrect Guide(tm) to the Middle East, veteran Middle East correspondent Martin Sieff puts the lie to all these myths and cliches, giving you everything you need to know about the region to understand its past, its present, and its possible future. In The Politically Incorrect Guide(tm) to the Middle East, you'll learn: \n\n* How, for three decades, the British supported parliamentary democracy throughout the Middle East, but it didn't work \n\n* Why Britain's post-World War I Middle East policy was a comedy of errors and incompetence that soon escalated into tragedy \n\n* Where America went wrong in Iraq: how U.S. policymakers vastly underestimated the intransigent, unsophisticated, and anti-Western nature of its competing communities \n\n* How Saudi Arabia's security forces defeated al Qaeda--and why you never heard about it \n\n* Why we'll miss the Arab dictators when they're gone \n\n* How the Muslim nations of the Middle East took an irrevocable turn toward radical Islam not in the tenth century or after the fall of Baghdad to the Mongols in the thirteenth century--but in 1979 \n\n* How the Arab states openly declared their determination to prevent a Jewish state from being born in 1947--twenty years before the West Bank and Gaza were first occupied \n\nThe Politically Incorrect Guide to the Middle East is a bold first step toward facing the hard truths necessary for peace. \n\nFrom the Inside Flap\n\nWhy most of what you think you know about the Middle East is wrong \nThe Middle East: a region that's almost never off the front pages, yet one most Americans know little about. The mainstream media and Ivy League academics only make matters worse by casting everything in the usual politically correct mold: Arab terrorists are just desperate freedom fighters, and the region's one free democracy--Israel--is the oppressor, not least because of its alliance with America. And if Islamic extremism is a problem, the establishment tells us, it's only because it's rooted in that source of all evils: religion. A different strain of political correctness has seeped into some minds on the right--most notably the Bush administration, which, so ready to buy into the egalitarian myths we are all taught, believed that Western-style democracy could flourish anywhere. Now, in The Politically Incorrect Guide(tm) to the Middle East, veteran Middle East correspondent Martin Sieff puts the lie to all these myths and clichÃƒÂ©s, giving you everything you need to know about the region to understand its past, its present, and its possible future. \n\n&lt;--Spinacia Oleracea  *  3.14159265--&gt;","torrent":{"xt":"urn:btih:8a3946475dcd68b811c2d825ef49bbfeed2a8fe3","amp;dn":"Politically+Incorrect+Guide+to+the+Middle+East+%28M4B+format%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a3946475dcd68b811c2d825ef49bbfeed2a8fe3","infoHashBuffer":{"type":"Buffer","data":[138,57,70,71,93,205,104,184,17,194,216,37,239,73,187,254,237,42,143,227]},"announce":[],"urlList":[]}}