{"title":"MARCH OF THE PENGUINS-(WTC-SWE)","uid":4477946,"size":734211014,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8a3cb96a6a61bf71f6afe07603691f75c69b7c1d&amp;dn=MARCH+OF+THE+PENGUINS-%28WTC-SWE%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"WTC-SWE","files":-1,"time":1225426864,"description":"\n                             MARCH OF THE PENGUINS\n                            -----------------------\n\nIn the Antarctic, every March since the beginning of time, the quest begins to find the perfect mate and start a family. This courtship will begin with a long journey - a journey that will take them hundreds of miles across the continent by foot, in freezing cold temperatures, in brittle, icy winds and through deep, treacherous waters. They will risk starvation and attack by dangerous predators, under the harshest conditions on earth, all to find true love. \n\nMarch of the Penguins instantly qualifies as a wildlife classic, taking its place among other extraordinary films like Microcosmos and Winged Migration. French filmmaker Luc Jacquet and his devoted crew endured a full year of extreme conditions in Antarctica to capture the life cycle of Emperor penguins on film, and their diligence is evident in every striking frame of this 80-minute documentary.\n\n Narrated in soothing tones by Morgan Freeman, the film focuses on a colony of hundreds of Emperors as they return, in a single-file march of 70 miles or more, to their frozen breeding ground, far inland from the oceans where they thrive. At times dramatic, suspenseful, mischievous and just plain funny, the film conveys the intensity of the penguins' breeding cycle, and their treacherous task of protecting eggs and hatchlings in temperatures as low as 128 degrees below zero.\n\n There is some brief mating-ritual violence and sad moments of loss, but March of the Penguins remains family-friendly throughout, and kids especially will enjoy the Antarctic blue-ice vistas and the playful, waddling appeal of the penguins, who can be slapstick clumsy or magnificently graceful, depending on the circumstances. A marvel of wildlife cinematography, this unique film offers a front-row seat to these amazing creatures, balancing just enough scientific information with the entertaining visuals. --Jeff Shannon \n\n\n\n\n\nNarrator Morgan Freeman:\n------------------------\n\n\n\n\nFile Size: 700 MB \nFormat:AVI\nVideo Length: 01:20:13\nVideo Codec:XviD\nVideo Resolution: 640x368\nVIdeo Bitrate: 1191 kbit/s\nAudio Bitrate: 124 kbit/s\nAudio Codec: MPEG Layer -3 (AC3)\nSubtitles:(External English)\n\n\n  &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0428803/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0428803/&lt;/a&gt;\n\n\n\n\n\nENJOY:\n\n\n\n\nYOUR CHOICE\n\nWTC-SWE\n\n\n\n\n(Please seed so others can enjoy)\n\n                                                \n                                        \n\n\n\nNote: External English subtitles included.\n------------------------------------------","torrent":{"xt":"urn:btih:8a3cb96a6a61bf71f6afe07603691f75c69b7c1d","amp;dn":"MARCH+OF+THE+PENGUINS-%28WTC-SWE%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a3cb96a6a61bf71f6afe07603691f75c69b7c1d","infoHashBuffer":{"type":"Buffer","data":[138,60,185,106,106,97,191,113,246,175,224,118,3,105,31,117,198,155,124,29]},"announce":[],"urlList":[]}}