{"title":"Callinaz - Lite som du vill  2015","uid":12513017,"size":97268808,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8ab415ea7e5bcf54268dddc5381f5a5dfa665f6b&amp;dn=Callinaz+-+Lite+som+du+vill++2015&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"RoffeTheCoolMan","files":13,"time":1443608501,"description":"Få band kan mäta sig med Callinaz när det gäller de nya unga dansbanden... Carolina och hennes grabbar i bandet har gjort hela fyra plattor sedan debuten &quot;Från mörker till ljus&quot; i september 2011. Dessutom vann de förra året Sveriges Radios prestigefyllda pris på Guldklaven som går till band som för den svenska dansbandsmusiken framåt vilket sannerligen Callinaz var väl värda att vinna. För det har och gör verkligen bandet. De står för att spela traditionell dansbandsmusik men samtidigt så tittar de framåt och har en hunger som få band kan mäta sig med. Lägg till Carolinas karismatiska röst och starquality och vi har svaret till den framgång bandet har ute på dansbanorna runtom i Sverige. På nya skivan har dessutom deras nisch att blanda in mer 50-talsaktig musik med ståbas och charmiga arrangemang fått ännu fler folk till dansbanorna då det visat sej vara ett vinnande koncept. Något som även hörs på nya plattan. \r\n\r\nNya skivan ja... Den innehåller som vanligt när det gäller Callinaz inte minst ett antal nya starka originalspår även ett antal covers som bandet gjort till sina &quot;egna&quot; med arrangemang som passar bandet perfekt. Callinaz lyssnar på sin publik och får tips på låtar som de sedan spelat in. Så det är inte konstigt att skivorna går hem hos publiken.\r\n\r\nPå fjärde albumet &quot;Lite som du vill&quot; kommer Callinaz ta ännu större plats på dansbandsscenen och de klassas redan idag som ett av de mest etablerarde banden i genren med kvinnliga sångerskor.\r\n\r\n\r\nLÅTLISTA\r\n\r\n1. Det ska regna i morgon\r\n2. Lite som du vill\r\n3. Mississippi\r\n4. Det känns så skönt\r\n5. Will you still love me tomorrow\r\n6. På andra sidan stan\r\n7. Nu smet katten in till grannen igen\r\n8. En enda natt\r\n9. Om Himlen och Österlen\r\n10. Blue Bayou (duett med Claes Lövgren)\r\n11. Min gamla stad\r\n12. Backa tiden","torrent":{"xt":"urn:btih:8ab415ea7e5bcf54268dddc5381f5a5dfa665f6b","amp;dn":"Callinaz+-+Lite+som+du+vill++2015","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ab415ea7e5bcf54268dddc5381f5a5dfa665f6b","infoHashBuffer":{"type":"Buffer","data":[138,180,21,234,126,91,207,84,38,141,221,197,56,31,90,93,250,102,95,107]},"announce":[],"urlList":[]}}