{"title":"Avira Premium Security Suite With  Key Valid 25.12.2011 by SuDHi","uid":6561271,"size":62814613,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:8b2ebf2464e47cf4428cf17b68b575b22a6e2983&amp;dn=Avira+Premium+Security+Suite+With++Key+Valid+25.12.2011+by+SuDHi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sudhir108","files":-1,"time":1311488191,"description":"-------------------------------------------------------------------------\nProtects you in a comprehensive way against the dangers from the Internet\n-------------------------------------------------------------------------\n\nDo you surf on the Internet, make online purchases, communicate by email, or make bank transactions on your PC?\n\nThe Avira Security Suite was designed to protect you and has an extra FireWall as well as an AntiSpam and a backup function in addition to the award-winning virus protection.\n\nIn a user-defined installation or a modification installation, the following installation modules can be selected, added or removed.\n\nPremium Security Suite\nThis module contains all components required for successful installation of Avira Premium Security Suite.\n\nAntiVir Guard\n-------------\nThe AntiVir Guard runs in the background. It monitors and repairs, where necessary, files during operations such as open, write and copy in on-access mode. Whenever a user carries out a file operation (e.g. load document, execute, copy), Avira Premium Security Suite automatically scans the file. Renaming a file does not trigger a scan by AntiVir Guard.\n\nAntiVir MailGuard\n-----------------\nMailGuard is the interface between your computer and the email server from which your email program (mail client) downloads the emails. MailGuard is connected as a so-called proxy between the email program and the email server. All incoming emails are routed through this proxy, scanned for viruses and unwanted programs and forwarded to your email program. Depending on the configuration, the program processes the affected emails automatically or asks the user for a certain action. In addition, the MailGuard can reliably protect you against spam emails.\n\nAntiVir WebGuard\n----------------\nWhen surfing the internet, you are using your web browser to request data from a web server. The data transferred from the web server (HTML files, script and image files, Flash files, video and music streams, etc) will normally be moved directly into the browser cache for display in the web browser, meaning that an on-access scan as performed by AntiVir Guard is not possible. This could allow viruses and unwanted programs to access your computer system. WebGuard is what is known as an HTTP proxy which monitors the ports used for data transfer (80, 8080, 3128) and scans the transferred data for viruses and unwanted programs. Depending on the configuration, the program may process the affected files automatically or prompt the user for a specific action.\n\nAvira Firewall\n--------------\nAvira Firewall controls communication to and from your computer. It permits or denies communications based on security policies.\n\nRootkit Detection\n-----------------\nThe Rootkit Detection checks whether software is already installed on your computer that can no longer be detected with conventional methods of malware protection after penetrating the computer system.\n\nShell Extension\n---------------\nThe Avira Premium Security Suite Shell Extension generates an entry Scan selected files with AntiVir in the context menu of the Windows Explorer (right-hand mouse button). With this entry you can directly scan files or directories.\n\nBackup\n------\nThe Backup component lets you create mirror backups of your data manually and automatically.\n\nHere are some key features of &quot;Avira Premium Security Suite&quot;:\n\n=&gt;AntiVir stops all types of viruses\n=&gt;AntiAd/Spyware eliminates ad/spyware\n=&gt;AntiPhishing proactive protection against phising\n=&gt;AntiRootkit against hidden rootkit threats\n=&gt;AntiDrive-by prevents against downloading viruses when surfing\n=&gt;AntiBot prevents dangerous bot networks\n=&gt;EmailScannerEnhanced email protection\n=&gt;WebGuard protection against malicious websites\n=&gt;RescueSystem create a bootable rescue CD\n=&gt;BackupSystem configurable data backup solution\n=&gt;AntiSpam filters out unwanted emails\n=&gt;FireWall protection against hackers\n=&gt;GameMode uninterrupted game play\n=&gt;QuickRemoval eliminate viruses at the push of a button\n=&gt;NetbookSupport for laptops with low resolution\n=&gt;ParentalControl block websites unsuitable for children\n\n=&gt;Screenshot\n------------\n &lt;a href=&quot;\nhttp://i1228.photobucket.com/albums/ee442/sudhir0939/screenshot_3-5.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i1228.photobucket.com/albums/ee442/sudhir0939/screenshot_3-5.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://i1228.photobucket.com/albums/ee442/sudhir0939/screenshot_2-9.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i1228.photobucket.com/albums/ee442/sudhir0939/screenshot_2-9.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://i1228.photobucket.com/albums/ee442/sudhir0939/screenshot_1-12.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i1228.photobucket.com/albums/ee442/sudhir0939/screenshot_1-12.jpg&lt;/a&gt;\n\n\nRequirements:\n\n=&gt;At least 100 MB of free hard disk memory space\n=&gt;At least 192 MB RAM under Windows 2000/XP\n=&gt;At least 512 MB RAM under Windows Vista\n=&gt;For all installations: Windows Internet Explorer 6.0 or higher\n=&gt;Administrator rights are required for the installation\n\n\n\nUpload by SuDHiR","torrent":{"xt":"urn:btih:8b2ebf2464e47cf4428cf17b68b575b22a6e2983","amp;dn":"Avira+Premium+Security+Suite+With++Key+Valid+25.12.2011+by+SuDHi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b2ebf2464e47cf4428cf17b68b575b22a6e2983","infoHashBuffer":{"type":"Buffer","data":[139,46,191,36,100,228,124,244,66,140,241,123,104,181,117,178,42,110,41,131]},"announce":[],"urlList":[]}}