{"title":"Cado.Dalle.Nubi.2009.iTALiAN.TELESYNC.XviD-SiLENT","uid":5192443,"size":734029414,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8bcdf2d87137fe34489da568483415e205c5d899&amp;dn=Cado.Dalle.Nubi.2009.iTALiAN.TELESYNC.XviD-SiLENT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"xianodon","files":1,"time":1259772144,"description":"Checco e un giovane cantante pugliese che sogna il grande successo nel mondo dello spettacolo e, per mantenersi, lavora come muratore nella ditta dello zio a Polignano a mare. E' fidanzato con Angela, parrucchiera, che lo lascia perche desidera avere accanto un uomo con un lavoro piu stabile, con il quale costruire una famiglia. Per Checco e una doccia fredda: triste e amareggiato lascia la Puglia per Milano, sperando che la moderna metropoli del nord gli possa spalancare le porte del successo nel mondo discografico. A Milano Checco viene ospitato da suo cugino Alfredo che divide l'appartamento con Manolo: i due stanno insieme da dieci anni ma Alfredo non l'ha ancora detto ai genitori che vivono in Puglia e che, ogni volta che lo vanno a trovare, lo trovano accanto a splendide &quot;fidanzate&quot; come Luisa. La strada che porta al successo e lunga e difficile, ma l'incontro inaspettato con una ragazza cambiera la vita di Checco: Marika una ragazza meravigliosa e piena di qualita, convince Checco a dare lezioni di chitarra ai ragazzi disagiati della parrocchia di Don Livio. Unico neo: i genitori di Marika sono leghisti convinti e pieni di pregiudizi nei confronti dei meridionali. Checco, affranto da una serie di rifiuti, si convince che non riuscira mai a sfondare ed e pronto a tornare a Polignano, quando finalmente Roberto, un importante discografico, lo trova dopo averlo cercato per tutta Milano, convinto che il talento canoro e quello comico possano trasformare Checco in un vero e proprio fenomeno musicale.\n","torrent":{"xt":"urn:btih:8bcdf2d87137fe34489da568483415e205c5d899","amp;dn":"Cado.Dalle.Nubi.2009.iTALiAN.TELESYNC.XviD-SiLENT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8bcdf2d87137fe34489da568483415e205c5d899","infoHashBuffer":{"type":"Buffer","data":[139,205,242,216,113,55,254,52,72,157,165,104,72,52,21,226,5,197,216,153]},"announce":[],"urlList":[]}}