{"title":"Solar Cells - Research and Application Perspectives","uid":14540787,"size":25441028,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8c9ac4a7dbe8d2b204aab7afeddf350b18f64928&amp;dn=Solar+Cells+-+Research+and+Application+Perspectives&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1462519992,"description":"Solar Cells - Research and Application Perspectives - Arturo Morales-Acevedo (InTech, 2013).pdf\r\n\r\nOver the last decade, photovoltaic (PV) technology has shown the potential to become a major source of power generation for the world - with robust and continuous growth even during times of financial and economic crisis. That growth is expected to continue in the years ahead as worldwide awareness of the advantages of PV increases. However, cost remains as the greatest barrier to further expansion of PV-generated power, and therefore cost reduction is the prime goal of the PV and solar cell investigation. This book intends to contribute to such a purpose by covering a wide range of modern research topics in the solar cell physics and technology fields. The already established -1st generation- silicon solar cell technology, the 2nd generation thin film and the 3rd generation dye sensitized solar cells, including new technologies with very high perspectives for reducing the cost of solar electricity such as CZTS, organic polymer and tandem solar cells based on III-V compounds -under concentrated sunlight- are studied in this book by experts in the field from around the world. At the end, two chapters are also dedicated to the systems engineering, providing a complete PV energy research and application perspectives panorama","torrent":{"xt":"urn:btih:8c9ac4a7dbe8d2b204aab7afeddf350b18f64928","amp;dn":"Solar+Cells+-+Research+and+Application+Perspectives","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c9ac4a7dbe8d2b204aab7afeddf350b18f64928","infoHashBuffer":{"type":"Buffer","data":[140,154,196,167,219,232,210,178,4,170,183,175,237,223,53,11,24,246,73,40]},"announce":[],"urlList":[]}}