{"title":"Speed Fan","uid":6299639,"size":2067936,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:8cb90d07961de1f980af45e9f67d20926d8e0da1&amp;dn=Speed+Fan&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dvelukumar","files":2,"time":1302113481,"description":"SpeedFan allows you to have a deeper view of the status of your computer. Almost every computer includes support for hardware monitoring. Accessing digital temperature sensors is really useful. If you are trying to figure out why your pc hangs when under heavy load or after some hours of usage, SpeedFan might help you to find the real cause. Very often it is a poor power supply, or an improperly installed heatsink that lead to behaviours that we tend to associate with errors from the operating system, but that are not. SpeedFan automatically searches your computer for interesting chips: the hardware monitor chips. SpeedFan can expose voltages, fan speeds and temperatures. On rare occasions, the BIOS doesn't activate such features. SpeedFan tries to enable them as long as this is a safe thing to do. Not only the motherboard is searched, but also some video cards and almost every recent hard disk. SpeedFan can access status info from EIDE, SATA and even SCSI drives, showing, in a consistent way, internal data that can be used to diagnose current and future hard disk failures. This is known as S.M.A.R.T. (Self-Monitoring Analysis and Reporting Technology). At the lowest level, SpeedFan is a hardware monitor software that can access digital temperature sensors, but its main feature is that it can control fan speeds according to the temperatures inside your pc, thus reducing noise. ","torrent":{"xt":"urn:btih:8cb90d07961de1f980af45e9f67d20926d8e0da1","amp;dn":"Speed+Fan","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8cb90d07961de1f980af45e9f67d20926d8e0da1","infoHashBuffer":{"type":"Buffer","data":[140,185,13,7,150,29,225,249,128,175,69,233,246,125,32,146,109,142,13,161]},"announce":[],"urlList":[]}}