{"title":"Yes - Roundabout (Live)","uid":4479735,"size":219609092,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:8dc5e4ec2cabb3f42950d76767e614545de3bec9&amp;dn=Yes+-+Roundabout+%28Live%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1225509956,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;Roundabout&quot; is the track which opens the 1971 album Fragile produced by British progressive rock band Yes. In 1972, an edited version of the song was released as a single with &quot;Long Distance Runaround&quot; on the B side. The single has been listed at #15 on one list of 1972s best songs, and &quot;Roundabout&quot; has become one of the best-known songs by Yes. Live versions of the song are found on the albums Yessongs, Keys to Ascension, House of Yes: Live from House of Blues, and Live at Montreux 2003. &quot;Roundabout&quot; was written by Jon Anderson and Steve Howe.\n\nAlthough the song&amp;#039;s cryptic lyrics are believed by some to have philosophical themes, Anderson says that the words simply came to him while driving to the studio one early morning.\n\nHowe&amp;#039;s use of octave harmonics on the acoustic guitar introduction of the song, plucking the four notes that would comprise an Em chord on an open guitar, has become one of his signature pieces of guitar work.\n\nIn the film School of Rock, Fragile is given to the keyboardist Lawrence as he is told to listen to the keyboard solo on &quot;Roundabout&quot;.\n\n&quot;Roundabout&quot; was also used in the 1999 film &quot;Outside Providence&quot; as it is heard through a sequence of two scenes.\n\nAn acoustic arrangement of &quot;Roundabout&quot; was recorded for The Ultimate Yes: 35th Anniversary Collection.\n\nFragile is the fourth album by British progressive rock band Yes. It is best known for the song &quot;Roundabout&quot;, which was released in an edited version as a U.S. single and became one of the band&amp;#039;s best-known songs. This was Rick Wakeman&amp;#039;s first album with Yes and also their first trans-atlantic Top 10 release.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:8dc5e4ec2cabb3f42950d76767e614545de3bec9","amp;dn":"Yes+-+Roundabout+%28Live%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8dc5e4ec2cabb3f42950d76767e614545de3bec9","infoHashBuffer":{"type":"Buffer","data":[141,197,228,236,44,171,179,244,41,80,215,103,103,230,20,84,93,227,190,201]},"announce":[],"urlList":[]}}