{"title":"Mafia Portable - [Espera]","uid":6411000,"size":1591241196,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8e01803fe29d549a37da1ed1b998970c59b031b1&amp;dn=Mafia+Portable+-+%5BEspera%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"MKanister","files":2,"time":1305975633,"description":"    //   / /                                            \n   //____     ___      ___      ___      __      ___    \n  / ____    ((   ) ) //   ) ) //___) ) //  ) ) //   ) ) \n //          \\ \\    //___/ / //       //      //   / /  \n//____/ / //   ) ) //       ((____   //      ((___( (   \n\n                     Presents\n\nINSTRUCTIONS\n1.Unrar\n2.Run &quot;REG1.exe&quot;\n3.Run &quot;Mafia 1 Click.exe&quot;\n4.Enjoy\n\n\nWarning this is a PORTABLE verision of the game.\nAll portable versions brought to you by us most probably \nWILL NOT work with x64 versions of Windows, only with the x86 versions.\n\n\nMafia: The City of Lost Heaven is a third-person shooter video game initially made for PC and released in 2002. It was later made available for PlayStation 2 and Xbox in 2004. It was developed by a Czech based company Illusion Softworks, published by Gathering of Developers and written as well as directed by Daniel Vavra. The game allows the player to take on the role of a criminal who has to accomplish various missions in order to advance in the game. It received strong critical reaction and continued to maintain a loyal cult following. As of March 12, 2008, Mafia has sold 2 million copies according to Take-Two Interactive. IGN gave it a rating of 9.2/10 while Gamespot stated in their review: &quot;Quite simply, Mafia is one of the best games of the year.&quot; and rated it at 9.3/10.\n\nOn August 21, 2007, Take-Two Interactive announced Mafia II at the 2007 Leipzig Games Convention, under development by Illusion Softworks, and was eventually released in August 2010.\n\nThe bulk of Mafia's storyline gameplay consists of driving, mostly for general travel between game locales, as well as car chases and races; the remaining portions of the game consist of on-foot third-person exploration and shooting, similar in style to the Grand Theft Auto series. In addition to the entire city of Lost Heaven and countryside, several detailed interior levels were also included for many of the on-foot levels, including the city's airport and museum, a church, a hotel, an abandoned prison, a restaurant, and Don Salieri's bar. Weather and night effects are also available in the game.\n\nThere is also a Free Ride mode, where you can earn money and can do pretty much anything you want, even though you don't have space to hide all your weapons at first.\n\nMafia offers players the opportunity to drive a total of 51 classic cars based on real-life counterparts, in addition to another 19 bonus vehicles (including five classic racing models) available for unlocking in a new mode upon completion of the game's storyline. Unlike the Grand Theft Auto series, however, cars are introduced progressively through time in the storyline, with 1920s models available earlier on during the storyline, while newer varieties from the 1930s appear later. In addition, the players must &quot;learn&quot; how to steal a car by acquiring such knowledge from experts or experience, as opposed to the Grand Theft Auto series, where players are free to acquire any type of vehicle, superior or otherwise. \n\nSystem Requirements\n\n    Operating system: 98 ME XP\n    CPU: 500MHz\n    Graphics: 14MB\n    HD space: 1.8GB\n    CDROM: 16 speed\n    Directx: 8.1\n    Multiplayer: no\n    RAM: 96MB\n    Input: Mouse and Keyboard\n    Sound: Directx 8.1 Sound  ","torrent":{"xt":"urn:btih:8e01803fe29d549a37da1ed1b998970c59b031b1","amp;dn":"Mafia+Portable+-+%5BEspera%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e01803fe29d549a37da1ed1b998970c59b031b1","infoHashBuffer":{"type":"Buffer","data":[142,1,128,63,226,157,84,154,55,218,30,209,185,152,151,12,89,176,49,177]},"announce":[],"urlList":[]}}