{"title":"Robert Anton Wilson Explains Everything (2001)","uid":3992820,"size":381446144,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:8e3e683c77fc9d29e164d4c486fdbb15e8dc66a0&amp;dn=Robert+Anton+Wilson+Explains+Everything+%282001%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"buddhawithagun","files":7,"time":1201139940,"description":"Robert Anton Wilson Explains Everything (Or Old Bob Exposes His Ignorance)\n[2001]\n\n\nFrom the author of the legendary underground classic The Illuminatus! Trilogy and many other works comes an unprecedented event: a once-in-a-lifetime meeting with Robert Anton Wilson captured live on audio. Robert Anton Wilson Explains Everything (or Old Bob Exposes His Ignorance) brings us face to face with one of the most unconventional and brilliant writers of our time, affording listeners an inside view of this enigmatic (and sometimes misunderstood) novelist, visionary, and &quot;stand-up comic for the mystically inclined.&quot;\n\nIn four engrossing sessions of conversation, Robert Anton Wilson delves into such topics as futurist psychology, the paranormal, God, political conspiracies (real and imagined), the Eight Stages of Consciousness and how to obtain them, life extension and space migration, the origins of language, guerrilla ontology, and much more. Wilson also offers a rare glimpse into his early years growing up in an Irish-American ghetto of New York, his friendship with Timothy Leary, his investigations into various magicks plus a mind-expanding exploration of Wilson's newest insights into the state of the human predicament.\n\nThis Collectors Edition also includes three classic Robert Anton Wilson lectures: The Acceleration of Knowledge, The New Inquisition, and Religion for the Hell of It.","torrent":{"xt":"urn:btih:8e3e683c77fc9d29e164d4c486fdbb15e8dc66a0","amp;dn":"Robert+Anton+Wilson+Explains+Everything+%282001%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e3e683c77fc9d29e164d4c486fdbb15e8dc66a0","infoHashBuffer":{"type":"Buffer","data":[142,62,104,60,119,252,157,41,225,100,212,196,134,253,187,21,232,220,102,160]},"announce":[],"urlList":[]}}