{"title":"Terence McKenna - December 21st, 2012 - Timewave Zero","uid":4218873,"size":609827807,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:8f83c51ed53199ef88497f735698d3ff006706bc&amp;dn=Terence+McKenna+-+December+21st%2C+2012+-+Timewave+Zero&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"geogaddi00","files":12,"time":1212451885,"description":"\n\nTerence McKenna - December 21st, 2012 - Timewave Zero\n\n---------------------------------\n\nFractal Time software a.k.a. Timewave Zero ( by Peter Meyer, from Hermetic Systems: http://www.hermetic.ch/frt/frt.htm )\n\nThis software illustrates a theory of time, history and the end of history as first described in the book The Invisible Landscape by Terence and Dennis McKenna. As related by Terence McKenna in his book True Hallucinations, the theory of Timewave Zero was revealed to him in the wake of an unusual psychedelic experiment conducted deep in the Amazon jungle in Colombia in 1971, which led to his being instructed in certain transformations of numbers, derived from the King Wen Sequence of I Ching hexagrams, relating to the occurrence of temporal phenomena. This led eventually to a mathematical description of &quot;the timewave&quot;, which allegedly correlates time and history with the ebb and flow of something called Novelty, claimed to be a quality intrinsic to the temporal structure of the universe.\n\nA peculiarity of this correlation is that at a certain point a singularity is reached which is the end of history ? or at least a transition to a supra-historical order in which our ordinary conceptions of reality will be radically transformed. The date of this point was chosen by McKenna to be December 21, 2012, the date of the winter solstice of that year and also the end of the current era of 13 baktuns in the Maya Calendar (according to the Goodman-Martinez-Thompson correlation 584,283).\n\nA remarkable quality of the timewave is that it is a fractal (although this was not fully revealed until the late 1980s). Once a part of the wave is displayed the software allows you to expand any smaller part. This usually reveals a complexity of structure which persists however much the wave is magnified, a property typical of fractals. The idea that time has a fractal structure (in contrast to the Newtonian conception of time as pure, unstructured, duration) was first proposed by Terence McKenna. It is certainly an intriguing idea worthy of further consideration by physicists. \n\nAn interesting part of the theory of Timewave Zero is the notion of historical periods &quot;in resonance&quot; with each other, in which the events of the earlier period are in some sense repeated in the later. The software permits graphical display of different regions of the timewave that are in resonance with each other, and includes the ability to graph the so-called trigrammatic resonances in addition to the major resonances. This Fractal Time software thus permits a proper examination of Terence McKenna&amp;#039;s claim to have discovered a property of time in terms of which historical phenomena can be explained and even predicted.\n\n( You can order your own copy of Fractal Time software (Version 7.10) from: http://www.hermetic.ch/frt/frt.htm )\n\n\n---------------------------------\n\n\nTimewave Zero  ( text from http://fusionanomaly.net/ )\n\nTerence McKenna&amp;#039;s software plotting the fractals of &quot;novelty&quot; over many thousands of years of earth&amp;#039;s history, up to 2012 C.E., at which point novelty will reach the state of infinite fulmination. He defines novelty, of course, as &quot;the density of connectedness&quot; or the &quot;degree of complexity.&quot; The I Ching says that Time is a series of identifiable elements in flux. There are 64 of these &quot;elements.&quot; He also believes that what we today call the I Ching is but a tiny fragment of a once immense device, now forever lost. \n\nLooking at the I Ching from a quantum physics perspective, Terence and his brother Dennis discovered a wave pattern in the ordering of the Tarot&amp;#039;s trigrams and hexagrams that suggested time could be mapped. One of the oldest &quot;structured abstractions&quot; known, the I Ching has been found scratched on the 6,000 year-old shoulder bone of a sheep. Since the I Ching is particularly concerned with the dynamic relationships and transformations that archetypes undergo, McKenna intuited that the I Ching must also be deeply involved with the nature of time as the necessary condition for the manifestation of archetypes as categories of experience. \n\nCentering his attention on examining the King Wen sequence of sixty four hexagrams, McKenna&amp;#039;s search for the ordering principles that lay behind it managed to translate what was essentially a mystical diagram into a rationally apprehensible, mathematical model. Working with Peter Meyer, McKenna developed a personal computer software package that takes his discoveries concerning the I Ching and creates time maps based upon them.  These time maps, or novelty maps, show the ebb an flow of connectedness, or novelty, in any span of time from a few days to tens of millennia. \n\nIn McKenna&amp;#039;s novelty map, when the graph line moves downward, novelty is assumed to be increasing. When there is movement away from the base line, novelty is assumed to be decreasing in favor of habitual forms of   activity. According to this graph, one trend toward greater novelty reached its culmination around 2700 B.C.,   precisely at the height of the Old Kingdom pyramid-building phase. Perhaps most remarkable of all McKenna&amp;#039;s  discoveries was the fact that the only point in the entire wave that has a quantified value of zero is December 21, 2012 A.D. -- the same date that has been interpreted as the Mayan Calendar&amp;#039;s end of time. \n\nThe Timewave zero model shows the past 1,500 years to have been highly novel times that have oscillated at  levels of novelty very close to the horizontal axis, the maximized &quot;zero state.&quot; When the zero point is reached, the   wave passes out of the past and into the future. We are approaching a point, says McKenna, &quot;when the rational  and acausal tendencies inherent in time may again reverse their positions of dominance.&quot; \n\nMcKenna views history, with it&amp;#039;s hunger for completion, as &quot;an anomaly... a complete fluke,&quot; in which &quot;all ideas  of salvation, enlightenment, or utopia may be taken to be expressions in consciousness of the drive of energy to  free itself from the limitations of three-dimensional space.&quot; As history races toward it&amp;#039;s denouement, evolution is  carried out of strictly biological confines and into the mental realm where language and other abstractions begin to pull us together toward &quot;a complex attractor that exists ahead of us in time.&quot; This&quot;concrescence,&quot; says  McKenna is now so close that it can be felt in the sense of accelerating time and complexity. \n\nMcKenna discusses the repercussions of our collective approach to Timewave Zero and how psychedelics can be used to condition ourselves for our upcoming move into of the body of eternity and out of three-dimensional time and space. \n\n--------------------------------------------------------------------------------\n\nWell, who was it? Oscar Wilde, or somebody said, &quot;Consistency is the hobgoblin of small minds.&quot; Reality is inherently paradoxical. \n\nAnd the beginning of intellectual maturity is to be able to simultaneously hold two contradictory ideas in your mind at the same time. People ask me if I believe in the 2012 prediction. I don&amp;#039;t believe in anything. My anti-ideological stance makes it very important to believe nothing. I regard Timewave Zero as a fascinating model of a previously unmodelled system - which is human history. The fact that it seems to deliver interesting data... for instance, I predicted a very deep plunge into novelty this past summer. Just as it was at its deepest, the Martian meteorite chock full of fossils arrived - along with a lot of email demanding to know where was the miracle I had predicted. [laughter] I like the word models. What we&amp;#039;re trying to do is build models. By saying the word &amp;#039;models&amp;#039;, we make it very clear that this is not &amp;#039;Truth&amp;#039;, and that there will be a better model, and we&amp;#039;ll swap the old for the new. So at the moment Timewave Zero is simply a better model of history than the idea that there is no model at all, which is what&amp;#039;s taught in the Academy. The definition of history, if you study history in the Academy, is: it&amp;#039;s a trendlessly fluctuating process. If true, it&amp;#039;s the only trendlessly fluctuating process ever to be observed in this universe. So obviously it&amp;#039;s not true, it&amp;#039;s just that we lack a model. So people say... like, Toynbee&amp;#039;s model was that &amp;#039;God is waiting&amp;#039;, somebody else had a &amp;#039;Great Man&amp;#039; model, Marx believed it was all driven by class struggle, and Freud that it was all libido. Well, these are just opinions. Those aren&amp;#039;t theories, those are opinions. A theory has an ability to make predictions, and refine itself, so that&amp;#039;s what I offer with Timewave Zero. \n\n- Terence McKenna \n\n---------------------------------\n\nThis torrent contains:\n\nTerence and Dennis McKenna - The Invisible Landscape - Mind, Hallucinogens &amp; the I Ching.pdf\n\nTerence McKenna &amp; Friends - The Invisible Landscape (peer review) &lt; 6 mp3 files; includes Francis Huxley, Barbara Smith, Jose Arguelles, Ralph Abraham and Kat Harrison )\n\nTerence McKenna - December 21st, 2012 - Timewave Zero.avi ( DVD-Rip &lt;640x480 XviD, 128kbps mp3, 458mb&gt; from classic 24min Sound Photosynthesis video from 1995 )\n\nTerence McKenna - Eros &amp; The Eschaton.mp3 ( poignant and articulate lecture from Seattle, 1994- one of Terence&amp;#039;s best, detailing novelty theory )\n\nTerence McKenna - True Hallucinations.pdf ( an ebook about Terence McKenna&amp;#039;s exciting journey of discovery in 1971 in the Amazon, which resulted in an epiphany that led to his formulation of novelty theory and Timewave Zero )\n\nTimewave Zero software v7.10 ( the latest incarnation of Terence McKenna&amp;#039;s fractal time software, by Peter Meyer! )\n\n---------------------------------\n \nSpecial related multimedia links:\n\nTerence McKenna - True Hallucinations ( classic Sound Photosynthesis talking book), archived here: \n-\n &amp; here\n-\n\nTerence McKenna on Future-Hi Media: \n- http://www.futurehi.net/media.html\n\nTerence McKenna audio archive:\n- http://www.lancerules.com/terence/\n\nDennis McKenna, co-author of The Invisible Landscape (multimedia collection torrent):  - http://conspiracycentral.net:6969/stats.html?info_hash=e8b2406c1e0388f41aef01990707bc5b442c01e4\n\nTerence McKenna on Sightings TV program about 2012:\n-\n\n---------------------------------\n","torrent":{"xt":"urn:btih:8f83c51ed53199ef88497f735698d3ff006706bc","amp;dn":"Terence+McKenna+-+December+21st%2C+2012+-+Timewave+Zero","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f83c51ed53199ef88497f735698d3ff006706bc","infoHashBuffer":{"type":"Buffer","data":[143,131,197,30,213,49,153,239,136,73,127,115,86,152,211,255,0,103,6,188]},"announce":[],"urlList":[]}}