{"title":"Voice Recorder: HD Audio Sound (Dictaphone) Android app","uid":11628787,"size":1492643,"categoryP":"applications","categoryS":"android","magnet":"?xt=urn:btih:900d1fa53a9e2932dbf5d1a33b408f12e2326f17&amp;dn=Voice+Recorder%3A+HD+Audio+Sound+%28Dictaphone%29+Android+app&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"j.walsh2014","files":1,"time":1417655563,"description":"App FREE download at Google Play: https://play.google.com/store/apps/details?id=com.vinternete.recorder\nOfficial Voice Recorder app website: http://vinternete.com\n\nDownload Voice Recorder for the easy, simple and reliable high quality long time audio and speech, sound recording. Record school classes, university study lectures, personal notes, diaries, memories, remarkable events, journalist interviews, business conferences and meetings, night sleep talks (or snoring), your babysitter day, remember how you sing or play the music instruments, - in any situation Voice Recorder proofs reliability and credibility, with no time limits. Use powerful Voice Recorder with super simple and comfortable user interface everywhere you need. Download for free!\n\nVoice Recorder main features:\nâ˜… Live microphone audio gain (sensitivity) indicator\nâ˜… Auto the best quality encoding (MPEG4/AAC)\nâ˜… Recording in background and also when the display is off\nâ˜… Record with a Bluetooth microphone\nâ˜… Play/Stop/Auto save recording process control\nâ˜… Auto SD-card storage by default\nâ˜… Remaining recording time and space showed on home screen in megabytes, limited only by available space on your SD-card storage\nâ˜… Manage your recordings, rename, delete with easy to use and convenient audio recordings list\n\nHave fun with Voice Recorder and many more enhancements, additions, and new features are to come in the next version!\n\nPlease feel free to leave your feedback at the Google Play and your wishes for the next version for the features like:\nBackup, share and manage recordings via cloud storages, like DropBox, send by email, Skype, Viber, WhatsApp, etc.; Save and set your recording as the ringtone, alarm or notification in one tap; Control the recorder with a home screen widget; Integration with Tasker and Locale; Record in stereo; Boost input volume with microphone software gain; Skip silent parts; Manage and organize your recordings with folders; Switch to the camcorder microphone for louder and clearer recordings; Control the recorder from anywhere using the status bar; Pin recordings to the status bar; and much more you would like to have - your requests drive the app development!","torrent":{"xt":"urn:btih:900d1fa53a9e2932dbf5d1a33b408f12e2326f17","amp;dn":"Voice+Recorder%3A+HD+Audio+Sound+%28Dictaphone%29+Android+app","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"900d1fa53a9e2932dbf5d1a33b408f12e2326f17","infoHashBuffer":{"type":"Buffer","data":[144,13,31,165,58,158,41,50,219,245,209,163,59,64,143,18,226,50,111,23]},"announce":[],"urlList":[]}}