{"title":"Metasploit Penetration Testing Cookbook 2E, 2013 [PDF]","uid":9301238,"size":7479928,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:91adef689d49e2f07f3de15bf65f821a238d633d&amp;dn=Metasploit+Penetration+Testing+Cookbook+2E%2C+2013+%5BPDF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"F1restorm","files":-1,"time":1386244213,"description":"Metasploit Penetration Testing Cookbook- Second Edition\nAuthors: Monika Agarwal and Abhinav Singh\nPublished: October 25, 2013\nPublisher: Packt Publishing\nISBN: 9781782166788\nFormat: Retail PDF\nReader Required: Adobe Reader, Adobe Digital Editions\n\nThe book details how to install and use Metasploit on various OS's, including Windows and Ubuntu. Please keep in mind that Metasploit is pre-installed on Kali Linux (replaced BackTrack).\nTested on the above readers with no problems. Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nEnjoy! :D\n___________________________________________________________________________________\n\nOver 80 recipes to master the most widely used penetration testing framework\n\nOverview\nSpecial focus on the latest operating systems, exploits, and penetration testing techniques for wireless, VOIP, and cloud\nThis book covers a detailed analysis of third party tools based on the Metasploit framework to enhance the penetration testing experience\nDetailed penetration testing techniques for different specializations like wireless networks, VOIP systems with a brief introduction to penetration testing in the cloud\n\nIn Detail\nMetasploit software helps security and IT professionals identify security issues, verify vulnerability mitigations, and manage expert-driven security assessments. Capabilities include smart exploitation, password auditing, web application scanning, and social engineering. Teams can collaborate in Metasploit and present their findings in consolidated reports. The goal of the software is to provide a clear understanding of the critical vulnerabilities in any environment and to manage those risks.\n\nMetasploit Penetration Testing Cookbook, Second Edition contains chapters that are logically arranged with an increasing level of complexity and thoroughly covers some aspects of Metasploit, ranging from pre-exploitation to the post-exploitation phase. This book is an update from version 4.0 to version 4.5. It covers the detailed penetration testing techniques for different specializations like wireless networks, VOIP systems, and the cloud.\n\nMetasploit Penetration Testing Cookbook, Second Edition covers a number of topics which were not part of the first edition. You will learn how to penetrate an operating system (Windows 8 penetration testing) to the penetration of a wireless network, VoIP network, and then to cloud.\n\nThe book starts with the basics, such as gathering information about your target, and then develops to cover advanced topics like building your own framework scripts and modules. The book goes deep into operating-systems-based penetration testing techniques and moves ahead with client-based exploitation methodologies. In the post-exploitation phase, it covers meterpreter, antivirus bypass, ruby wonders, exploit building, porting exploits to the framework, and penetration testing, while dealing with VOIP, wireless networks, and cloud computing.\n\nThis book will help readers to think from a hacker's perspective to dig out the flaws in target networks and also to leverage the powers of Metasploit to compromise them. It will take your penetration skills to the next level.\n","torrent":{"xt":"urn:btih:91adef689d49e2f07f3de15bf65f821a238d633d","amp;dn":"Metasploit+Penetration+Testing+Cookbook+2E%2C+2013+%5BPDF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91adef689d49e2f07f3de15bf65f821a238d633d","infoHashBuffer":{"type":"Buffer","data":[145,173,239,104,157,73,226,240,127,61,225,91,246,95,130,26,35,141,99,61]},"announce":[],"urlList":[]}}