{"title":"A-NEXT (1998-1999) and AVENGERS NEXT (2007) plus More &amp;ndash; RE","uid":8033011,"size":375956505,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:9362f63aa302ceeef29341bca1151493ce1a59cc&amp;dn=A-NEXT+%281998-1999%29+and+AVENGERS+NEXT+%282007%29+plus+More+%26ndash%3B+RE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"STFmaryville","files":-1,"time":1358461582,"description":"This torrent fills a request by jccman33.\n\nI loved the A-Next series when it first came out, although it wasn't as good as the Busiek/Perez run on Avengers that started the same year. For giving MC2 several &quot;last chances,&quot; I have to praise Marvel under Joe Quesada: they kept it going a lot longer than other companies / editorial regimes would have! Stephen Wacker, for calling Arana &quot;the new Spider-Girl,&quot; you can kiss my ass! I'm glad her series flopped.\n\nThis torrent contains:\n\nA-Next 01-12 (1998-1999)\n\nLast Hero Standing 01-05 (2005)\n\nLast Planet Standing 01-05 (2006)\n\nAvengers Next 01-05 (2007)\n\n------\n\nFrom Wikipedia, on the now-defunct MC2 line of Marvel Comics:\n\nMC2 (Marvel Comics 2) is an imprint from Marvel Comics whose comic books depict an alternative future timeline for the Marvel Universe. The imprint was created out of the events of What If? #105, which was the first appearance of the character Spider-Girl, Spider-Man's daughter from an alternative future.\n\nThe MC2 Universe was conceived by writer/editor Tom DeFalco as a possible alternate future for the Marvel Universe, which is set in the present day, with the first appearances of most Marvel heroes having taken place fifteen years earlier than in main continuity. The goal of the line was to produce comic books that were more accessible to a wider audience than Marvel's main line of books and weren't entrenched in years of continuity, which was later repeated with the Ultimate Marvel imprint.\n\nDeFalco explained in an interview his views on the MC2 imprint:\n\nTHE PULSE: &quot;A lot of people characterize the MC2 universe as having an 'old school' feel. Why do you think 'modern' comic readers want to read something that feels like the best of the Silver Age?&quot;\n\nDEFALCO: &quot;We are 'old school' because A) our heroes act like heroes ... B) we don't believe in decompression ... C) we tell single issue stories with subplots that build from issue to issue ... and D) there's a lot of action and angst in every issue.&quot;\n\n------\n\nFrom Wikipedia, on A-Next:\n\nThe new team comes together after an attack by Asgardian trolls on Avengers Museum, formerly Avengers Mansion, commanded by Loki, prompts the museum's caretaker, former butler Edwin Jarvis, to send out a distress signal.\n\nThe summons is responded to by several heroes including Thunderstrike (Kevin Masterson, son of the original Thunderstrike, who was visiting the mansion at the time of the attack); Stinger (Scott Lang's daughter Cassie Lang, now an entomologist, who was testing Ant-Man's old uniform); Mainframe (a mysterious armored individual); J2 (Zane Yama, high school student and teenage son of the Juggernaut) and the adult Speedball, Jubilee and Jolt.\n\nThe heroes are transported to Asgard by Loki, who wants to retrieve the Thunderstrike mace's powers for himself, but Kevin disrupts the spell, absorbing the mace into himself and transforming into a new Thunderstrike in the process. Loki and the trolls are then defeated by the heroes, with assistance from Thor, now the King of Asgard. Thunderstrike, Stinger, J2 and Mainframe decide to stay together as the new Avengers.\n","torrent":{"xt":"urn:btih:9362f63aa302ceeef29341bca1151493ce1a59cc","amp;dn":"A-NEXT+%281998-1999%29+and+AVENGERS+NEXT+%282007%29+plus+More+%26ndash%3B+RE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9362f63aa302ceeef29341bca1151493ce1a59cc","infoHashBuffer":{"type":"Buffer","data":[147,98,246,58,163,2,206,238,242,147,65,188,161,21,20,147,206,26,89,204]},"announce":[],"urlList":[]}}