{"title":"Sway - Kat Spears","uid":11972857,"size":350932,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:94ad644a8794438406b920dae4f97bd5599ed038&amp;dn=Sway+-+Kat+Spears&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1432900427,"description":"In Kat Spears's hilarious and often poignant debut, high school senior Jesse Alderman, or &quot;Sway,&quot; as he's known, could sell hell to a bishop. He also specializes in getting things people want---term papers, a date with the prom queen, fake IDs. He has few close friends and he never EVER lets emotions get in the way. For Jesse, life is simply a series of business transactions.\n\nBut when Ken Foster, captain of the football team, leading candidate for homecoming king, and all-around jerk, hires Jesse to help him win the heart of the angelic Bridget Smalley, Jesse finds himself feeling all sorts of things. While following Bridget and learning the intimate details of her life, he falls helplessly in love for the very first time. He also finds himself in an accidental friendship with Bridget's belligerent and self-pitying younger brother who has cerebral palsy. Suddenly, Jesse is visiting old folks at a nursing home in order to run into Bridget, and offering his time to help the less fortunate, all the while developing a bond with this young man who idolizes him. Could the tin man really have a heart after all?\n\nA Cyrano de Bergerac story with a modern twist, Sway is told from Jesse's point of view with unapologetic truth and biting humor, his observations about the world around him untempered by empathy or compassion---until Bridget's presence in his life forces him to confront his quiet devastation over a life-changing event a year earlier and maybe, just maybe, feel something again","torrent":{"xt":"urn:btih:94ad644a8794438406b920dae4f97bd5599ed038","amp;dn":"Sway+-+Kat+Spears","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94ad644a8794438406b920dae4f97bd5599ed038","infoHashBuffer":{"type":"Buffer","data":[148,173,100,74,135,148,67,132,6,185,32,218,228,249,123,213,89,158,208,56]},"announce":[],"urlList":[]}}