{"title":"Your Creative Brain Seven Steps to Maximize Imagination, Product","uid":7461113,"size":1895682,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:94ae02dab752682f54ef43ebb74e6c838ab106c4&amp;dn=Your+Creative+Brain+Seven+Steps+to+Maximize+Imagination%2C+Product&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cowboy1966","files":-1,"time":1342818418,"description":"Shelley Carson, \n\n&quot;Your Creative Brain: Seven Steps to Maximize Imagination, Productivity, and Innovation in Your Life&quot;\n\nISBN: 0470547634 | 2010 | EPUB | 384 pages | 1.8 MB\n\nFilled with research-based techniques for expanding creativity and increasing productivity\n \nThis provocative book reveals why sitting in front of a light box can increase your creativity more than listening to a Bach concerto as example. The author Shelley H. Carson, a Harvard psychologist, explains that creativity isn't something only scientists, investors, artists, writers, and musicians enjoy; in fact, all of us use our creative brains every day at home and at work. Each of us has the ability to increase our mental functioning and creativity by learning to move flexibly among several brain states.\n \nExplains seven brain states or &quot;brainsets&quot; and their functions as related to creativity, productivity, and innovation. These include Connect, Reason, Envision, Absorb, Transform, Evaluate, and Stream brainsets.\n Provides quizzes, exercises, and self-tests to activate each of these seven brainsets to unlock our maximum creativity. \n\nThis book is a Harvard Health Publication that offers helpful suggestions that can be applied in both your personal and professional life. \n\nPlease seed and share","torrent":{"xt":"urn:btih:94ae02dab752682f54ef43ebb74e6c838ab106c4","amp;dn":"Your+Creative+Brain+Seven+Steps+to+Maximize+Imagination%2C+Product","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94ae02dab752682f54ef43ebb74e6c838ab106c4","infoHashBuffer":{"type":"Buffer","data":[148,174,2,218,183,82,104,47,84,239,67,235,183,78,108,131,138,177,6,196]},"announce":[],"urlList":[]}}