{"title":"Heroes of a Broken Land v1.8","uid":10959346,"size":39066716,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:94c76efe3594bd6e4c72710993cae5d99cf98cc5&amp;dn=Heroes+of+a+Broken+Land+v1.8&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Nimbleton","files":-1,"time":1409703775,"description":"Heroes of a Broken Land v1.8\n\nInstall with exe &amp; play!\n\n\nHeroes of a Broken Land is a turn-based, dungeon crawling, town management RPG.\n\nExplore procedurally generated worlds and dungeons with multiple parties of heroes. Ally with other towns to recruit new and more powerful heroes. Explore and loot countless dungeons on your quest to save the world.\n\nA Broken Land, shattered by the Wizards of old, the Fragments of the Old World are adrift in the Void. You must visit and restore each Fragment of the Void, only then can the World be rebuilt. However you are trapped in a crystal body, unable to act alone.\n\nYou must gather and recruit the many Heroes of each Fragment to act for you. You must explore each Fragment of the World. Delve into every dungeon to gather the resources and power needed to purify each Fragment. Expand your outpost to train and equip your heroes. Make allies with the other towns and settlements, convince them to join in your quest. \n\nKey Features:\n\n    First person, turn-based dungeon crawling action\n    Manage multiple 6 parties of up to 6 heroes each to explore the word\n    Manage towns, constructing buildings to upgrade your heroes and kingdom\n    Recruit heroes from the realm and turn novices into powerful adventurers\n    Each game is a unique world unto itself, with countless worlds and dungeons\n    Choose the size of your world: explore a small Fragment for quick adventure, or an enormous one for an epic quest ","torrent":{"xt":"urn:btih:94c76efe3594bd6e4c72710993cae5d99cf98cc5","amp;dn":"Heroes+of+a+Broken+Land+v1.8","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94c76efe3594bd6e4c72710993cae5d99cf98cc5","infoHashBuffer":{"type":"Buffer","data":[148,199,110,254,53,148,189,110,76,114,113,9,147,202,229,217,156,249,140,197]},"announce":[],"urlList":[]}}