{"title":"Surrogate Mother (aka Final Vendetta).mp4","uid":11703033,"size":1905844975,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:94d58f75e57a815af4c34de6ff0c03f1f9f87f34&amp;dn=Surrogate+Mother+%28aka+Final+Vendetta%29.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"MoofieMan","files":1,"time":1423997068,"description":"This suspense film is the tale of a yuppie couple unable to conceive and desperate for a child. They enlist the services of Jennifer to act as surrogate mother. Unbeknownst to the couple, Jennifer has an ulterior motive to this union - to exact revenge for a childhood tragedy which has had a deep, malevolent effect on her. Jennifer moves in with the couple, and during her pregnancy, will allow nothing (or no one) to stop her in her quest for a &quot;final vendetta.&quot; (written by Fred Goodridge on IMDB) \n\nI ripped this classic 'B' movie from DVD, giving it quite solid bitrate on the video (2300kbps x264), and remastered the audio (compressed for voice, levelled then amplified to -1dB). I rendered the audio at 448 kbps (AC3) after the remaster to preserve the new characteristics of the audio (to render it at a low bitrate would wipe out the effect of the remaster). It's contained in MP4 format.\n\nI often find that movies are mixed so that the voices are hard to hear while I get blown out of my seat by the music and SFX, particularly in stereo soundtracks, where you don't have any flexibility in the mix. With 5.1 or 7.1, individual speakers can be increased or decreased in volume to achieve more audible voice, but stereo doesn't afford this luxury. I remaster soundtracks with a view to countering these problems.\n\nGetting back to the movie, it's a worthwhile telemovie that features some good actors (including Peter Boyle in a support role), some very believable acting from most of the cast, and a surprisingly plausible storyline. There is a distictly Japanese flavour about the style of the movie that leads me to believe it may have been inspired by one of several Asian films about child surrogacy that were released around the same time. This one's a pretty clean rip, rendered at full 752x576 (4:3) resolution and a remastered soundtrack.\n\nThanks to all who seed - you are the lifeblood of the system. I'm not a release group and am on limited bandwidth. I can't sustain uploading at higher speeds indefinitely, so all help is greatly appreciated.\n\nCheers,\nMoofieMan","torrent":{"xt":"urn:btih:94d58f75e57a815af4c34de6ff0c03f1f9f87f34","amp;dn":"Surrogate+Mother+%28aka+Final+Vendetta%29.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94d58f75e57a815af4c34de6ff0c03f1f9f87f34","infoHashBuffer":{"type":"Buffer","data":[148,213,143,117,229,122,129,90,244,195,77,230,255,12,3,241,249,248,127,52]},"announce":[],"urlList":[]}}