{"title":"Harumi - Harumi (1968) [FLAC]","uid":6331642,"size":412759455,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:957d0d1c7370277de085f846df52f09265a66682&amp;dn=Harumi+-+Harumi+%281968%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zibbik","files":20,"time":1303305680,"description":"Artist: Harumi\nTitle: Harumi\nGenre: Acid Psychedelic Rock\nOrigin: Japan\n\nTracks:\n\n1. Talk About It\n2. First Impressions\n3. Don'T Know What I'M Gonna Do\n4. Hello\n5. Sugar In Your Tea\n6. Caravan\n7. Hunters Of Heaven\n8. Hurry Up Now\n9. What A Day For Me\n10. We Love\n11. Fire By The River\n12. Twice Told Tales Of The Pomegranate Forest\n13. Samurai Memories\n\nRecorded by Tom Wilson (who else?) for Verve in 1967 and 1968 in New York, this set originally appeared on a double LP (which has been reissued on both vinyl and CD by Fallout). This is one of the wildest and most unbelievably ambitious recordings to come from the psychedelic era. Harumi (a mystery man who recorded one more album before vanishing into the ether) could write pop songs and sing them.\nHe also sounds like he did a lot of acid. Harumi (who sings and speaks in English), Wilson, arrangers Harvey Vinson and Larry Fallon, and engineer Gary Kellegren assembled a tripped-out collection of pop, Eastern folk, and experimental music and production techniques, with sounds, textures, and atmospheres that incorporated everything from strings and horns to Japanese folk instruments to vibraphones and (of course) plenty of guitars and drums and organ. Of the 13 cuts here, 11 are of conventional length and are utterly seductive in their hypnotic power and pop brilliance.\nThe last two, &quot;Twice Told Tales of the Pomegranate Forest&quot; and &quot;Samurai Memories,&quot; are 24 minutes and 18 minutes long, respectively. These two have plenty of cosmic spoken word by Wilson (Rosko) and Harumi, and on the past by his parents and his sister. The first of these, the longer one, is a bit difficult to take with its slow pace, minimal orchestration, and nearly nonsensical story (that's what the remote is for). The second one, with its discotheque go-go boots beat and orchestration, phased sounds, and Japanese language, is an exotic masterpiece. \n","torrent":{"xt":"urn:btih:957d0d1c7370277de085f846df52f09265a66682","amp;dn":"Harumi+-+Harumi+%281968%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"957d0d1c7370277de085f846df52f09265a66682","infoHashBuffer":{"type":"Buffer","data":[149,125,13,28,115,112,39,125,224,133,248,70,223,82,240,146,101,166,102,130]},"announce":[],"urlList":[]}}