{"title":"The Comsat Angels - Renascent Studio Album Remasters [FLAC]","uid":10145786,"size":2453357407,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9615bfaee1640277caa5e94b1a023c3125959f03&amp;dn=The+Comsat+Angels+-+Renascent+Studio+Album+Remasters+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rudown78","files":155,"time":1400051409,"description":"Comsat Angels - The Renascent Studio Album Remasters [FLAC]\n\n\nErroneously regarded as a synth pop band -- and, every now and then, as a band that peaked with a song placed in a scene of Real Genius -- the Comsat Angels were one of the finest bands of the post-punk/new wave era. Often as moody if less dramatic than Joy Division, their first and best albums -- 1980's Waiting for a Miracle, 1981's Sleep No More, and 1982's Fiction -- featured abstract pop songs with spare instrumentation, many of which were bleak and filled with some form of heartache. The albums were almost unrelentingly sullen, but they were always transfixing. The band then fell prey to various commercial pressures for several years. In the '90s they resurfaced with a pair of powerful albums that resembled logical extensions of their earliest work, and then they vanished again.\n\nAfter numerous incarnations and name changes, the Sheffield-based Radio Earth -- guitarist and vocalist Stephen Fellows, drummer Mik Glaisher, keyboardist Andy Peake, bassist Kevin Bacon -- found themselves opening for Pere Ubu in Newcastle. After the gig, the quartet realized that they had been blown off the stage and intimidated by the headliners' sense of focus and ability to confuse. Following a rethink, they came back as the less self-conscious Comsat Angels (the name referenced a short story by J.G. Ballard). They took a loan from Glaisher's father to record and release the Red Planet EP in 1979; BBC DJ John Peel, who was sent a copy, liked what he heard, requested a few more copies and booked the band for one of his famous Peel Sessions.\n\nAn unintrusive deal with Polydor allowed the band to make three stunning albums and pay back Mr. Glaisher, but the label didn't know how to handle the band and the more influential music journalists shied away for whatever reason, though the coverage the band did receive tended to be glowing. Only &quot;Independence Day,&quot; from the first album, managed to chart in the U.K. The albums were not distributed in the States, but the band did support Gang of Four during some 1982 dates and were shocked at the reception they received -- the result of spins on college radio stations.\n\nThe Comsats left Polydor for Jive. 1983's Land, produced by Mike Howlett, was a marked departure and a conscious aim for the top of the charts. It backfired. 1985's 7 Day Weekend, produced by Miles Davis associate and funk-pop producer extraordinaire James Mtume, fared worse. (A parallel: imagine a fourth Wire album that resembles Level 42 much more than Wire.) 1986's Chasing Shadows, released on Island, came to life with some help from high-profile fan Robert Palmer; it too was second-rate compared to the first three albums, despite being less compromised, and the band was pleased enough to refer to it as their fourth album. Fire on the Moon, finished the following year and not released until 1990, was the band's lowest point, a very bland hard rock album credited to Dream Command.\n\nAt this point, The Comsats came to a full realization that their efforts at pleasing others -- label heads and consumers alike -- had been fruitless. They signed with RPM/Thunderbird in the U.K. and Caroline in the States, and released 1992's My Mind's Eye, a toughened updated of the 1979-1982 period. Unsurprisingly, it was met with commercial indifference and spotty critical praise. Kevin Bacon, who had started to produce other artists, left the band after its release. Terry Todd came in as Bacon's replacement on bass, and Simon Anderson was added as second guitarist. In 1995, the band issued The Glamour, their hardest album. It would also be their last.\n\nFellows released an album of ambient guitar instrumentals in 1997 and also managed Gomez. Bacon produced more (Finley Quaye, Longpigs, Ziggy Marley) and put together some of his own electronic material. Glaisher and Peake continued to work together sporadically. The first three Comsat Angels albums were issued on CD in 1995 but went out of print shortly thereafter; Renascent, a heroic independent label in the U.K. that had previously updated the catalog of the Sound, remedied the matter in 2006. Land and 7 Day Weekend were issued on CD by Connoisseur in 2001. \n\n\n1980 - Waiting for a Miracle [2006 Remaster]\n1981 - Sleep No More [2006 Remaster]\n1982 - Fiction [2006 Remaster]\n1992 - My Mind's Eye [2007 Remaster]\n1995 - The Glamour [2007 2-CD Remaster]\n\n\nAlbum artwork and rip logs are also included. Enjoy!!!!!!!!!!!!!!!!!!!!!!!!","torrent":{"xt":"urn:btih:9615bfaee1640277caa5e94b1a023c3125959f03","amp;dn":"The+Comsat+Angels+-+Renascent+Studio+Album+Remasters+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9615bfaee1640277caa5e94b1a023c3125959f03","infoHashBuffer":{"type":"Buffer","data":[150,21,191,174,225,100,2,119,202,165,233,75,26,2,60,49,37,149,159,3]},"announce":[],"urlList":[]}}