{"title":"Democracy Now - 28 feb 2012","uid":7064055,"size":451209169,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:96559e2ad01dd7c086bce5c4d8184a55780b002a&amp;dn=Democracy+Now+-+28+feb+2012&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1330448469,"description":"An alternative daily newschannel. One hour with news as you do not see it elsewhere.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n\nHeadlines for Feb 28, 2012\n\n- Report: Israel Won't Warn U.S. Before Striking Iranian Nuclear Sites\n- Syria: 20 Killed in Hama, 2 Journalists Smuggled to Safety\n- Police Dismantle Occupy London, Arrest 20 Activists\n- Workers in India Launch 24-Hour Strike to Demand Rights\n- Supreme Court Hears Case on Corporate Liability for Rights Abuses Abroad\n- TransCanada to Build Oil Pipeline From Oklahoma to Texas\n- General Electric Paid 2.3% Tax Rate on Tens of Billions in Profits\n- Murdoch Reporters Traded Cash for Info From Police, Officials\n- Judge Rejects Suit Against Agro Giant Monsanto\n- Rights Groups Fight Tennessee Bill Banning Talk of Homosexuality\n- Report: Japan Concealed Full Dangers of Fukushima Nuclear Disaster\n- 2 Dead, 3 Injured in Ohio School Shooting\n- Colombia: FARC Vows to Free Hostages, End Kidnappings\n- Voters in Michigan and Arizona Head to Polls For GOP Primary\n- California: City of Stockton Verging on Bankruptcy\n\n\nSpecial reports\n\n- Report From Kabul: Deadly Protests Over U.S. Koran Burning May Be Turning Point For U.S. Occupation\n\nThe U.S.-led NATO occupation in Afghanistan is facing a storm of violence and outrage over the burning of copies of the Koran by U.S. troops at the Bagram Air Base last week. Retaliatory attacks and public protests have swept Afghanistan, leaving more than 40 Afghans dead. On Sunday, six U.S. soldiers were injured in northern Afghanistan when a demonstrator threw a grenade at a U.S. base. Two senior U.S. Army officers were shot dead on Friday inside the Afghan Interior Ministry. In private, U.S. officials are expressing worry about the situation in Afghanistan. We go to Kabul to speak with John Wendle, a reporter for TIME and photographer for Polaris Images. &quot;I think we're going to continue to see attacks,&quot; Wendle says. &quot;[This] makes it difficult for the United States to pull out and achieve the one goal that it's kind of set for itself - which is training the Afghan security forces so they can stand on their own two feet and provide security in this country.&quot;\n\n\n- WikiLeaks: Leaked Emails Expose Inner Workings of Private Intelligence Firm Stratfor, a &quot;Shadow CIA&quot;\n\nThe whistleblowing website WikiLeaks has begun publishing what it says are 5.5 million emails obtained from the servers of Stratfor, a private U.S.-based intelligence-gathering firm known to some as a &quot;shadow CIA&quot; for corporations and government agencies. The emails were reportedly obtained by the hackers group, Anonymous. WikiLeaks founder Julian Assange said the files implicate some of the world's largest firms in corporate espionage. Firms with ties to Stratfor include Coca-Cola, Goldman Sachs, Dow Chemical, and sectors of the U.S. government - including the Department of Homeland Security, the Marines Corps and the Defense Intelligence Agency. Coke asked Stratfor to keep tabs on the protest plans of the group, People for the Ethical Treatment of Animals. &quot;We've only seen the tip of the iceberg when it comes to the stories. It will come out in the next coming days and weeks,&quot; said Kristinn Hrafnsson, a WikiLeaks spokesperson who has been a key member of the project to release the Stratfor emails. &quot;What we were doing yesterday was introducing the project: The nature of Stratfor and how they operate, and their ties.&quot;\n\n\n- WikiLeaks: &quot;Private Spies&quot; Stratfor Helped Dow Chemical Monitor Bhopal Activists, The Yes Men\n\nEmails leaked by WikiLeaks from the private intelligence firm Stratfor reveal the chemical industrial giant Dow Chemical closely followed the work of activists around the 25th anniversary of the Bhopal chemical disaster, the 1984 gas leak that killed anywhere between 3,500 and 25,000 people. Of particular interest to Dow was the group, The Yes Men - the anti-corporate pranksters who pulled off a famous 2004 hoax that led the world to believe Dow had finally taken responsibility for the Bhopal tragedy. &quot;With us, they were carefully paying attention to every move that we were making publicly, especially anything to do with Dow and Bhopal,&quot; said Andy Bichlbaum of The Yes Men. &quot;What surprised us in those emails, though, was that we would have assumed that Dow would be really concerned with the exact issue of Bhopal and Dow's responsibility, stuff that could directly impact their bottom line. But, what they, what Stratfor seems to be really a bit obsessed with is whether we or other organizations are going to draw this into a bigger critique of corporate power.&quot;\n\n\n- Senegal Faces Run-Off Election After Youth-Led Protests Against Abdoulaye Wade's Bid For Third Term\n\nSenegal appears headed to a run-off election after a heated first round of voting and a year of protests against President Abdoulaye Wade's decision to seek third term, despite a constitutional two-term limit.\nThe protests are &quot;the most bloody and blood-filled campaign that the country has ever known,&quot; says Arame Tall, a Senegalese analyst. Over the past year, a movement led by a number of Senegalese rappers has helped mobilize the country's youth against Wade, joining the main opposition and civil society group, the June 23 Movement, or M23. &quot;The reference is not really the Arab Spring here, but rather, the history of renaissance in Africa and the history of political change, which we've started, but now we really need to substantiate,&quot; Tall says. We also speak with Ken Silverstein, a contributing editor at Harper's magazine, a fellow at the Open Society Institute and investigative journalist with the group Global Witness.\n &lt;a href=&quot;\nhttp://www.democracynow.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.democracynow.org&lt;/a&gt;\n","torrent":{"xt":"urn:btih:96559e2ad01dd7c086bce5c4d8184a55780b002a","amp;dn":"Democracy+Now+-+28+feb+2012","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"96559e2ad01dd7c086bce5c4d8184a55780b002a","infoHashBuffer":{"type":"Buffer","data":[150,85,158,42,208,29,215,192,134,188,229,196,216,24,74,85,120,11,0,42]},"announce":[],"urlList":[]}}