{"title":"Night Fisher","uid":8673013,"size":59978808,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:9706c9413f1183a66d20644bac8fc0d96bdd35b6&amp;dn=Night+Fisher&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LeonardTSpock","files":-1,"time":1373533647,"description":"'Night Fisher'\n\nFantagraphics Books, 2005, 144 pages\n\nWritten and Illustrated by R. Kikuo Johnson\n\nAn intimate, compelling drama of young men on the cusp of adulthood. Johnson explores his characters' relationships with natural ease; his unsentimental portrait of late adolescence is a mature depiction of immature lives.\n\nR. Kikuo Johnson has created an intimate and compelling graphic novel-length drama of young men on the cusp of adulthood. First-rate prep school, S.U.V., and a dream house in the heights: This was the island paradise handed to Loren Foster when he moved to Hawaii with his father six years ago. Now, with the end of high school just around the corner, his best friend, Shane, has grown distant. The rumors say it's hard drugs, and Loren suspects that Shane has left him behind for a new group of friends. What sets Johnson's drama apart is the naturalistic ease with which he explores the relationships of his characters. It is at once an unsentimental portrait of that most awkward period between adolescence and young adulthood and that rarest of things: a mature depiction of immature lives. Visually, Johnson captures the languid tropical climate and strip mall tackiness of Hawaii in a rich chiaroscuro style reminiscent of Milton Caniff combined with the sensual ink work of Paul Pope or Jessica Abel.\n\n2006 Russ Manning Most Promising Newcomer Award Winner; 2006 Harvey Award Winner, Best New Talent. Black-and-white comics throughout","torrent":{"xt":"urn:btih:9706c9413f1183a66d20644bac8fc0d96bdd35b6","amp;dn":"Night+Fisher","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9706c9413f1183a66d20644bac8fc0d96bdd35b6","infoHashBuffer":{"type":"Buffer","data":[151,6,201,65,63,17,131,166,109,32,100,75,172,143,192,217,107,221,53,182]},"announce":[],"urlList":[]}}