{"title":"MATMOS / WOBBLY / PEOPLE LIKE US / &quot;WIDE OPEN SPACES&quot;","uid":3418358,"size":58502091,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:977acd1ebb23fa271b5e22cb48fabf2c42049a17&amp;dn=MATMOS+%2F+WOBBLY+%2F+PEOPLE+LIKE+US+%2F+%5C%22WIDE+OPEN+SPACES%5C%22&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"DoctorAIR","files":16,"time":1133924869,"description":"Recorded live, October 5th, 2002 at the San Francisco Art Institute. Limited to 1500 copies.\n\n WOBBLY / PEOPLE LIKE US / MATMOS &quot;WIDE OPEN SPACES&quot;\n\nThe hour long performance on this disc was captured live on October 5th 2002 when Wobbly, \nPeople Like Us and Matmos circled their wagons in the lecture hall of the San Francisco Art \nInstitute. Having mutually agreed upon a country and western theme, Vicki Bennett (PLU), \nJon Leidecker (Wobbly), and Drew Daniel and M. C. Schmidt (Matmos) pored over their \narchives of honky tonk classics, chopping and dicing Nashville's finest almost beyond \nrecognition, and collectively restitching the mangled shreds in a kind of crazed digital \nquilting bee. Several tense rehearsals and strong pots of tea later, the foursome shuffled \non stage and delivered the goods: from panoramic twangfests to offkilter waltzes to barn \nburning stompers. Flickering and tranquil one moment, and wildly slapstick the next, Wide \nOpen Spaces hits the sweet spot between song forms and improvisation, and showcases the \nqualities that all three collaborating artists share: absurdist humor, baroque sample \nmanipulation, and stuttering rhythmic frameworks that lurch and sway. While the presence of \nfive samplers, four laptops, three CD players and a pedal steel guitar on one stage could \nhave led to a tediously ego-driven &quot;jam&quot; or simply cacophany, the results feel lushly \ndetailed but not cluttered, and swing naturally between structure and freedom. It's an \ninternational media magpie summit where country's chick-a-boom meets tech house's \nboom-tschak, and tearjerking sentiment and patriotic hokum are subjected to a dense shower \nof coughs, sputters and rude noises. Listening back to the recorded results, all three\nmusical units agreed that this concert was mighty fine, and worth sharing.\n\n01 - Morning\n02 - Dolly Pardon\n03 - Clawing Your Eyes Out Down To Your Throat\n04 - Shenandoah\n05 - Holler\n06 - Tremble Valley Peady\n07 - Chicken Legs\n08 - Cattle Call\n09 - Unshackled\n10 - Arkansas Explorer\n11 - Calling\n12 - I Must Die\n13 - Wide Open Space","torrent":{"xt":"urn:btih:977acd1ebb23fa271b5e22cb48fabf2c42049a17","amp;dn":"MATMOS+%2F+WOBBLY+%2F+PEOPLE+LIKE+US+%2F+%5C%22WIDE+OPEN+SPACES%5C%22","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"977acd1ebb23fa271b5e22cb48fabf2c42049a17","infoHashBuffer":{"type":"Buffer","data":[151,122,205,30,187,35,250,39,27,94,34,203,72,250,191,44,66,4,154,23]},"announce":[],"urlList":[]}}