{"title":"Therapy? - Nurse","uid":4188666,"size":58208377,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:97bc8f4fb26674357311a59a94a11b5f35f1d95f&amp;dn=Therapy%3F+-+Nurse&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"billy_stretcher","files":11,"time":1210814744,"description":"Therapy?\nNurse\nRock/Metal\n1993\n192Kbps\n\n1.Nausea  \n2.Teethgrinder   \n3.Disgracelands   \n4.Accelerator     \n5.Neck Freak  \n6.Perversonality   \n7.Gone   \n8.Zipless   \n9.Deep Sleep    \n10.Hypermania  \n\nFront Cover Included.\n\n\nAn expanded recording budget does wonders for Therapy? for their first proper studio record, released by new label A&amp;M. But rather than record with a label-approved producer, the Irish band opted to go with their soundman to provide a grunge tinge to their punishing noise. So the band&amp;#039;s fans rested easily knowing that Nurse was more than their band being courted off by the fairy princess, only to return a mutated band for the worse. Nurse expands on the basic gist of the Caucasian Psychosis compilation, benefiting from further focus on Michael McKeegan&amp;#039;s bass and Fyfe Ewing&amp;#039;s drumming. It still sounds dark and insular, but it casts off the lo-fi sludge factor that hampered the preceding EPs. Andy Cairns&amp;#039; lyrics don&amp;#039;t develop a great deal, remaining straightforward and sometimes awkward. Aside from the line &quot;Forget Columbus/Lost your culture,&quot; &quot;Disgraceland&quot; fails in societal commentary with its topical namedropping. But overall, the underlying theme of the record is &quot;You&amp;#039;re messed up, but I&amp;#039;m in worse shape.&quot; Everything tends to steam by, most notably on the &quot;Ace of Spades&quot;-like drive of &quot;Accelerator.&quot; But where Nurse really hits its stride is when the trio doesn&amp;#039;t play on top of each other, like on the screeching insomniac dub of &quot;Deep Sleep,&quot; one of Therapy?&amp;#039;s best overall moments. Since Nurse is somewhere between the amateurish early compilation and the polished sounding, more melodic Troublegum, some Therapy? fans would argue that this is their best overall record. \n\nEnjoy! :)\n","torrent":{"xt":"urn:btih:97bc8f4fb26674357311a59a94a11b5f35f1d95f","amp;dn":"Therapy%3F+-+Nurse","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"97bc8f4fb26674357311a59a94a11b5f35f1d95f","infoHashBuffer":{"type":"Buffer","data":[151,188,143,79,178,102,116,53,115,17,165,154,148,161,27,95,53,241,217,95]},"announce":[],"urlList":[]}}