{"title":"A Carrier at War-on Board the USS Kitty Hawk in the Iraq War {BB","uid":7503866,"size":3657560,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:97c631350a2986df910216f4a4032bb7d4bc72d9&amp;dn=A+Carrier+at+War-on+Board+the+USS+Kitty+Hawk+in+the+Iraq+War+%7BBB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"bigbluesea","files":-1,"time":1344104024,"description":"What distinguishes Richard F. Miller's A Carrier at War is its focus on individual officers and sailors and shipboard morale as distinct from the usual &quot;bomb and bullet&quot; reporting. The USS Kitty Hawk's mission paralleled the tortuous course of events leading up to the Iraq War. Originally stationed in the northern Persian Gulf to enforce the Southern No-Fly Zone, the Kitty Hawk became one of the lead elements in the campaign to &quot;shock and awe&quot; the Iraqi armed forces, from the moment her battle group launched twelve of some forty Tomahawk cruise missiles in the first effort to kill Saddam Hussein to the round-the-clock sorties of fighter jets launched from her deck once hostilities began. The author, who was present before, during, and after the beginning of the war, interviewed the ship's captain, chaplains, aviators, the ship psychologist, doctors, the dentist, and the chief of security. He visited the brig, interviewed the jailors, ate with both officers and enlisted men and women, and, on the brink of war, attended both Christian and Jewish religious services.\n\nPerhaps of greatest importance, owing to his cigar habit, he spent many hours in the one place on board where the real face of life at sea can be observed-the enlisted personnel's smoking sponson. Here the crew relaxed and proved honest enough to enable the author to make his most surprising discoveries about the modern military.\n\n\n# Paperback: 272 pages\n# Publisher: Potomac Books Inc. (February 15, 2005)\n# Language: English\n# ISBN-10: 1597970476\n# ISBN-13: 978-1597970471","torrent":{"xt":"urn:btih:97c631350a2986df910216f4a4032bb7d4bc72d9","amp;dn":"A+Carrier+at+War-on+Board+the+USS+Kitty+Hawk+in+the+Iraq+War+%7BBB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"97c631350a2986df910216f4a4032bb7d4bc72d9","infoHashBuffer":{"type":"Buffer","data":[151,198,49,53,10,41,134,223,145,2,22,244,164,3,43,183,212,188,114,217]},"announce":[],"urlList":[]}}