{"title":"Tribulation DVD NL (dvd5)(Nl subs) RETAIL TBS B-SAM","uid":6984438,"size":4412427774,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:98c7cb9e3761c2d32695a84ec13c762d0f3aaff6&amp;dn=Tribulation+DVD+NL+%28dvd5%29%28Nl+subs%29+RETAIL+TBS+B-SAM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Sammynet","files":-1,"time":1327518016,"description":"Tribulation (2000)\n\nNederlands\nHet leven van rechercheur Tom Canboro verandert in ÃƒÂ©ÃƒÂ©n nacht dramatisch.\nHij raakt verstrikt in een geheime groepering met angstaanjagende duivelse machten, die zich tegen hem en zijn gezin richten.\nMaar voordat hij hen kan waarschuwen, botst Tom frontaal tegen een vrachtwagen...\nNa jaren in coma ontwaakt hij in een ziekenhuis.\nNiets is meer wat het was en de schokkende waarheid dringt tot Tom door:\nde bijbelse profetie is uitgekomen.\nMiljoenen mensen zijn verdwenen, en de overgeblevenen herinneren zich niet eens dat zij bestaan.\nHet teken van het beest is overal.\nAls blijkt dat Tom's vrouw bij het verzet zit, moet hij haar kost wat het kost vinden.\nTegengewerkt door duivelse machten moet hij een 200 jaar oud raadsel oplossen met het gewicht van miljoenen zielen op zijn schouders...\n\nEnglish\nTom Canboro is a police detective with a Christian sister, Eileen, a brother, Calvin, a wife, Susan, and eccentric brother-in-law, Jason.\nOne night, Jason seemingly goes insane and tries to kill Eileen, calling her a &quot;hater&quot;.\nTom soon realises this may be a conspiracy going as far as devil worship, but as he speeds in his car to get help, he suddenly looses control and crashes.\nWaking up in a strange hospital, he finds years have passed and people all over the world are wearing the mark of 666 on their right hands,\nand all those who don't are being killed off.\nFranco Macalusso, the believer in world peace Jason was fond of, now controls the world,\nand is trying to bring the world together as it was at the tower of Babel.\nMeanwhile, the &quot;Haters&quot; or Christians are hiding out and airing TBN tapes on the air for people to realise the Messiah is really the Antichrist,\nbut their leader, Helen Hannah, is arrested... \n\nSpotinformatie\n\nCategorie     : Beeld\nFormaat       : DVD5\nBron          : Retail\nMenu          : Ja\nAudio         : Engels\nOndertitels   : Nederlands\nCover &amp; label : Ja\nGenre         : Drama / Thriller\nTime          : 91 minuten","torrent":{"xt":"urn:btih:98c7cb9e3761c2d32695a84ec13c762d0f3aaff6","amp;dn":"Tribulation+DVD+NL+%28dvd5%29%28Nl+subs%29+RETAIL+TBS+B-SAM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98c7cb9e3761c2d32695a84ec13c762d0f3aaff6","infoHashBuffer":{"type":"Buffer","data":[152,199,203,158,55,97,194,211,38,149,168,78,193,60,118,45,15,58,175,246]},"announce":[],"urlList":[]}}