{"title":"Placebo, How the devil and demons work.","uid":7675636,"size":29081698,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:9904440f034a8a77bc21324ba8f9c5a3800dd452&amp;dn=Placebo%2C+How+the+devil+and+demons+work.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pdfbible","files":1,"time":1348687589,"description":"Placebo How devil and demons work \n\n &lt;a href=&quot;\nhttp://divinerevelations.info/dreams_and_visions/placebo_howard_pittman.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://divinerevelations.info/dreams_and_visions/placebo_howard_pittman.htm&lt;/a&gt;\n\nWebster's Dictionary defines &quot;placebo&quot; as &quot;a medication prescribed more for the mental relief of a patient than for the actual effect on his disorder, or something tending to soothe.&quot;\nThe doctors tell us that if we know we are being treated with a placebo, it does not work. In our minds we must think that it is a real medication and has the strength or power to heal. If the patient believes this, then the treatment has been known to work wonders in many cases that otherwise could not have been treated. Placebo treatment is, in fact, nothing of substance, but in the mind of the patient it is real. In order for this kind of treatment to work, the doctor must convince the patient of the work of the medication.\nMy friend, I declare unto you that this is the exact &quot;treatment&quot; that most &quot;mouth-professing&quot; Christians are using today. The doctor administering this &quot;medication&quot; is satan himself. He gives the &quot;patient&quot; a sugar-coated religion, a shallow experience, and whispers half-truths into his ears. He then tells the &quot;patient&quot; that it is real and that it is all the &quot;patient&quot; needs. The &quot;patient&quot;, having been taken in by satan, believes this and goes on his merry way declaring to all that he has been born again, his salvation is real, and this experience is all that he needs. Doctor satan will allow his &quot;patient&quot; to continue to go to church and will allow him to take part in any church, that is, singing, leading in prayer, teaching Sunday School, and even preaching. He will allow the &quot;patient&quot; to make any kind of statement in connection with his &quot;mouth-professing&quot; religion, even to the point of the saving power of Jesus. Yes, he will allow the &quot;patient&quot; to do all and say all with one exception. That exception is that the &quot;patient&quot; will not be allowed to live the life that he confesses with his mouth .","torrent":{"xt":"urn:btih:9904440f034a8a77bc21324ba8f9c5a3800dd452","amp;dn":"Placebo%2C+How+the+devil+and+demons+work.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9904440f034a8a77bc21324ba8f9c5a3800dd452","infoHashBuffer":{"type":"Buffer","data":[153,4,68,15,3,74,138,119,188,33,50,75,168,249,197,163,128,13,212,82]},"announce":[],"urlList":[]}}