{"title":"Private Tropical - Puerto Rican Affairs (DVD.xvid) - anal + DP","uid":5079283,"size":1468583936,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:9919d5e43c4f3958b4905cc05848d0280ac8c6de&amp;dn=Private+Tropical+-+Puerto+Rican+Affairs+%28DVD.xvid%29+-+anal+%2B+DP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"pure_screens","files":1,"time":1252147611,"description":"Private Tropical 18: Puertorican Affairs\n\n\n\nscreens (+ DVD-covers): &lt;a href=&quot;\nhttp://www.cmylink.com/PuertoRicanAffairs&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.cmylink.com/PuertoRicanAffairs&lt;/a&gt;\n\n\n\nAgainst the breathtaking scenery of the Caribbean, a famous movie producer seduces a hot and horny woman. This new Private Tropical movie takes you to seductive white beaches, hardcore scenes packed with hot babes, anal sex under the tropical sun.\n\n\nActresses\n\n    * Angel Dark                       [Anal Facial DP]\n    * Jennifer Stone (as Jennifer)     [Facial]\n    * Lara Stevens                     [Anal Facial]\n    * Madelin Crox                     [Bald IR]\n    * Maria Bellucci                   [Anal Facial DP]\n    * Nikki Rider (as Nikky Rider)     [Anal Facial DP]\n    * Tera Bond                        [Facial]\n\n\nAngel Dark, Lara Stevens, Madelin Crox, Maria Bellucci, Nikki Rider, Tera Bond \n\n   \nScene Breakdowns\n\n    * Scene 1. Horst Baron, Madelin Crox\n    * Scene 2. Kevin Long, Tera Bond\n    * Scene 3. Jennifer Stone, Kevin Long, Lauro Giotto, Nikki Rider\n    * Scene 4. Francesco Malcom, George Uhl, Maria Bellucci, Tera Bond\n    * Scene 5. Angel Dark, George Uhl, Horst Baron\n    * Scene 6. Lara Stevens, Philippe Dean, Tera Bond\n\n\n\nLength: 1 hrs. 31 mins.\nRating: XXX\nRelease Date: 10/4/2005\nProduction Year: 2005\nStudio: Private\nDirector: Max Bellocchio (as Alessandro Del Mar)\n\n\n\nREVIEW:\n\nScene 1:\nMadelin Crox, Horst Baron.\n\nMadelin is a dark-skinned girl with short red hair. Her natural breasts are a little on the National Geographic side, and her face does nothing for me. Horst is an older-looking guy with a goatee and short blonde hair. They're outside on a deck near a pool and she starts to blow him, missionary, doggy, reverse cowgirl, spoon, then he jerks off on her left buttcheek. Very much a quick, throwaway scene. Well-shot, but not an attractive pair, though Horst can be a decent performer.\n\n\nScene 2:.\nTera Bond, Guy.\nFacial.\n\nTera is our covergirl, a very attractive girl with long black hair and large natural breasts. The guy is dressed like a gift-store pirate but thankfully strips off quickly, and his muscular frame provides a nicer counterpoint to Tera's body then his silly looking clothes.\n\nThey get off a boat and onto the shore of an island, across a small channel. Tera strips down and goes down on the guy, sucking and jerking him off, then rides him reverse cowgirl, cowgirl, spoon, doggy, then she jerks him off into her face.\n\nThe scene is well-shot outdoors, and with a nice natural background, and was otherwise good. But the scene only went for about eight minutes, so it looks like he's cutting the sex to make room for pornstars talking and trying to act. The scene score would be higher, but eight minutes just doesn't cut it these days..\n\n\nScene 3:\nNiki Ryder, Jennifer Stone, guy, guy.\nDP, Facials.\n\nNiki is an absolutely gorgeous raven-haired girl with mesmerising green eyes, a tongue piercing, a tailbone tattoo and implants. Jennifer is a blonde who has a very pretty face and natural breasts, but unfortunately her hair is pulled back. The scene is shot on the edge of a pool.\n\nWe open with Niki getting eaten from behind by a guy who is in the pool, he comes out of the water and she goes down on him. Jennifer is laying on some deck chairs and being eaten out and fingered by the other guy. Soon Niki and her guy walk over to Jennifer, and both girls suck on their partners' dicks, then swap guys to suck on back and forth as well as kissing each other. Cut to the guys lay back on the deck chairs and the girls in reverse cowgirl, which only lasts for about 10 seconds (!) before the girls get off, kiss, and swap guys, this time riding them cowgirl. Cut to Niki being DPed as she fingers then licks Jen (while mostly looking at the camera). Cut to Niki being DPed RC-style for 30 seconds as Jen looks on and rubs her clit, then suddenly the girls are jerking the guys off onto their mouths and chests. Huh? The girls kiss each other and we fade out.\n\nWell, Niki definately floats my boat and I've never seen her give a bad performance yet, but this scene again was cut down way too far. Although this scene went for 13 minutes compared to the eight or so the others got, the over-editing was visible as some positions only got a few seconds of footage. The scene was still better than average, but would have been great if it had not been so heavily edited down.\n\n\nScene 4:\nLara Stevens, Maria Bellucci, George Uhl, Francesco Malcolm.\nFacials, Anal, DP.\n\nLara has black hair pulled back in a ponytail, largish natural breasts and wears a short red dress, while Maria has long brown hair and implants.\n\nThe four of them are in a lounge room, hanging out on a couch when both girls decide to make out with George and each other. Maria's breasts quickly make an appearance, and just as quickly we cut to both girls blowing a guy each, making much eye contact with the camera. Both girls blow Francesco while George eats and fingers Maria from behind. He fucks her doggy while Lara rides the Francesco reverse cowgirl. Both girls suck their guys, Lara gives some not-very-likely tit-fucking, then the girls swap guys, and Lara rides George cowgirl and Maria does RC on Francesco, before switching to spoon. They both suck George, Maria rides Francesco in RAC as Lara sucks George, then the guys DP Maria briefly in RC then in cowgirl. Then Francesco jerks off and the George gets jerked off onto the girls' faces for quite a decent pair of facials, the girls lick and kiss one another for a little while, pose for the camera and we're finished.\n\nAgain the scene felt a little shortened and would definately garnered a higher score if we got to see for example more than the 40 seconds of Maria in DP that we got.\n\n\nScene 5:\nAngel Dark, George Uhl, Horst Baron.\nDP, Anal, Facials.\n\nAngel Dark is one of the most beautiful women to grace porn in the last few years, with her gorgeous face, large, natural breasts, toned body, olive skin and long dark hair. Unfortunatelty, she is usually a bit of a sedate performer. She wears a powder-blue bikini and is down on a beautiful tropical palm-lined beach with a couple of the guys. Naturally, they stop to fuck.\n\nThe guys each lick one of Angel's breasts then we cut right to her sitting down on a log and alternately sucking both guys. She bends over and sucks George while Horst fucks her from behind. Next Angel rides George's cock in some well-shot reverse cowgirl while jerking and sucking on Horst's cock. They move off of the log and onto the beach and Angel this time does RAC on George while sucking Horst's cock until he moves down and DPs her, firstly in the RC position and then cowgirl. At this point, to quote South Park I'd be worried about getting sand in my vagina if I were Angel, but instead the guys plow away. We cut to Angel kneeling as she jerks both guys off on her tits and face, complete with unneccesary reaction shots of the guys' faces.\n\nA pretty decent scene with Angel who showed slightly more enthusiasm than usual. Horst isn't great looking but can perform well, and George is a solid performer.\n\n\nScene 6:\nLara Stevens, Tera Bond, Philippe Dean.\nP2OGM, Anal, Facials .\n\nThe three of them are on an oversized chair at night. Both girls are attractive with lack hair, Lara wearing a black dress while Tera (the covergirl) wears a red-and-white floral dress. The girls both kiss Philippe and Tera quickly goes down on him while he plays with her pussy, then she plays with her own pussy while Lara goes down on him. Lara climbs on board in reverse cowgirl, with her panties pulled to the sirde and one breast exposed while Tera strips down to her bra (which she pulls down) and panties, Tera does some P2OGM while Lara rides Philippe's cock, then Lara changes to anal, for RAC. Spoon anal for Lara, cowgirl anal, a massive gape, more cowgirl anal, then Philippe jerks his load over Lara's breasts, leaving me confused, as Tera was not even fucked in this short scene. The girls kiss and lick on Philippe's cock for a minute or so as we fade out.\n\nWell, with the exception of Tera not actually being fucked and the scene seeming short, this was actually a decent scene. Due to the negatives though, I have to mark it down.\n\n\nThe first scene was awful, and the following couple and final scenes were good but cut way too short. The entire DVD was technically very proficient, whoever shoots Alessandro's videos is a talented videographer. Alessandro alsop has a habit of getting the girls to continue to suck the guys after they come, as well as kiss and generally look pretty for a good minute after the cumshot instead of fading to black as quickly as possible. If the sex had not been cut short so often, then this disc would easily have rated higher.\n\n\n\n\nGeneral\nComplete name                    : Private Tropical 18 - Puerto Rican Affairs.avi\nFormat                           : AVI\nFormat/Info                      : Audio Video Interleave\nFile size                        : 1.37 GiB\nDuration                         : 1h 31mn\nOverall bit rate                 : 2 147 Kbps\n\nVideo\nFormat                           : MPEG-4 Visual\nFormat settings, BVOP            : Yes\nFormat settings, QPel            : No\nFormat settings, GMC             : No warppoints\nFormat settings, Matrix          : Default\nCodec ID                         : DX50\nCodec ID/Hint                    : DivX 5\nDuration                         : 1h 31mn\nBit rate                         : 1 948 Kbps\nWidth                            : 624 pixels\nHeight                           : 368 pixels\nDisplay aspect ratio             : 1.696\nFrame rate                       : 25.000 fps\nResolution                       : 24 bits\nColorimetry                      : 4:2:0\nScan type                        : Progressive\nBits/(Pixel*Frame)               : 0.339\nStream size                      : 1.24 GiB (91%)\nWriting library                  : DivX 5.2.1 (WaffleDay) (UTC 2004-09-08)\n\nAudio\nFormat                           : AC-3\nFormat/Info                      : Audio Coding 3\nCodec ID                         : 2000\nDuration                         : 1h 31mn\nBit rate mode                    : Constant\nBit rate                         : 192 Kbps\nChannel(s)                       : 2 channels\nChannel positions                : L R\nSampling rate                    : 48.0 KHz\nStream size                      : 125 MiB (9%)\nAlignment                        : Aligned on interleaves\nInterleave, duration             : 96 ms (2.40 video frames)\nInterleave, preload duration     : 96 ms\n\n\n.","torrent":{"xt":"urn:btih:9919d5e43c4f3958b4905cc05848d0280ac8c6de","amp;dn":"Private+Tropical+-+Puerto+Rican+Affairs+%28DVD.xvid%29+-+anal+%2B+DP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9919d5e43c4f3958b4905cc05848d0280ac8c6de","infoHashBuffer":{"type":"Buffer","data":[153,25,213,228,60,79,57,88,180,144,92,192,88,72,208,40,10,200,198,222]},"announce":[],"urlList":[]}}