{"title":"Indian Ocean with Simon Reeve  (BBC 2012 - Complete)","uid":8690936,"size":3030641982,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:999b2ed3fe35fd695ff79e284ea58be309fce6b9&amp;dn=Indian+Ocean+with+Simon+Reeve++%28BBC+2012+-+Complete%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"Robin1966","files":10,"time":1373883873,"description":"NATURE: Indian Ocean with Simon Reeve\nOn: BBC HD    \n\n\nSouth Africa to Zanzibar. Episode 1\nIn a new six-part series, Simon Reeve travels around the edge of the Indian Ocean in an exotic journey that takes him from the paradise islands of the Maldives to the front line of the war against piracy and terror on the streets of Mogadishu. This first leg takes him from the rugged coast of South Africa, where he joins the fight against wildlife poachers, through Mozambique, and on to the tropical island of Zanzibar. On the way, he swims with sharks, meets the refugees who have found shelter in a luxury beachfront hotel, and travels on a huge container ship fortified against the constant threat of pirates.\n\n\nMadagascar to the Seychelles. Episode 2\nSimon Reeve visits the tropical Indian Ocean Islands of Madagascar, Mauritius and the Seychelles on the second leg of his journey. Amid the paradise of coral reefs and jungles full of spectacular wildlife, Simon witnesses some of the threats to the Ocean. Off the coast of Madagascar, he goes spear fishing with the Vezo people, whose lifestyle is at risk from their own population growth, and in Mauritius, he sees the vast industrial tuna trawlers unloading their catch. In the Seychelles, Simon meets an eccentric Englishman who is fighting back by turning his private paradise island into the world's smallest national park - largely populated by giant tortoises who start their life in his bedroom. But there is no escaping the problems of the world even here, and Simon joins Dutch special forces training to board ships on the high seas controlled by pirates.\n\n\nKenya to Somaliland. Episode 3\nSimon Reeve travels from the coral coast of Kenya to the troubled Horn of Africa on the third leg of his Indian Ocean journey. On the stunning and remote island of Kiwayu, he meets women who make a living from making handicrafts from the mountains of plastic pollution that fetches up on their beach. But this is also the site of the tragic murder of British tourist David Tebbutt and the kidnapping of his wife Judith by Somali pirates. In war torn Mogadishu, capital of Somalia and source of the piracy epidemic in the Indian Ocean, Simon travels with the African peace keeping force AMISOM. On the frontline, with bullets flying around, Simon learns that these underfunded Ugandan soldiers are actually fighting a bloody war with al Shabaab, a violent Islamist militia linked to al Qaeda. In neighbouring Somaliland Simon meets some of the thousands of Somalis fleeing the fighting and famine as well as some of the pirates, locked up in prison.\n\n\nOman to the Maldives. Episode 4\nThis stage of Simon Reeve's journey around the spectacular Indian Ocean takes him from Oman to the Maldives. He starts in the remote and otherworldly Musandam peninsula on the Strait of Hormuz, one of the most strategically important waterways in the world, where oil from the Persian Gulf is shipped through the narrow channel out into the Indian Ocean. The journey takes him on to Mumbai, the Indian Ocean's biggest port, and the seething festival of Ganesh, and then on to the Maldives - perhaps the most beautiful collection of tropical coral islands in the world. The fragile underwater environment is a barometer for the changing nature of the ocean, and Simon witnesses the impact of coral bleaching, which has damaged the beautiful coral reefs. But nothing can prepare him for the sight of the Maldives' rubbish island - a stinking landfill where the rubbish from the thriving tourist industry ends up.\n\n\nSri Lanka to Bangladesh. Episode 5\nThis stage of Simon Reeve's journey around the spectacular Indian Ocean takes him from Sri Lanka to Bangladesh. On the island of Sri Lanka, the Chinese are building a huge new port in the south, and their money has helped the Sri Lankan government bring a 30-year war to an end. Simon also visits the north of the island - the scene of vicious battles between fighters from the Tamil minority and the Sri Lankan army. Heading north, Simon investigates one of the Indian Ocean's fastest growing industries - providing prawns for the West. In Bangladesh, huge prawn farms flood the fertile land with salt water, which also causes concern for the environment. This leg of the journey ends with one of the most amazing sights of the whole Indian Ocean: the ship-breaking beaches of Chittagong, where dozens of huge tankers and container ships are beached before being broken up for scrap by vast armies of low-paid Bangladeshi workers living in terrible conditions.\n\n\nIndonesia to Australia. Episode 6\nThe last leg of Simon Reeve's journey begins on the northern tip of Sumatra, near the epicentre of the 2004 tsunami, and takes him to the south western corner of Australia. In Banda Aceh, Sharia law is in force and Simon joins the local vice and virtue squad who patrol the streets and beaches. In the Indonesian capital of Jakarta, Simon investigates the shocking trade in exotic pets and encounters the group attempting to save one of the country's most bizarre species, the slow loris. Next stop is Bali, where Simon joins a family of seaweed farmers who cultivate great areas of sea to provide a new protein source that some hail as a miracle crop. Australia is the last of 16 countries of this Indian Ocean journey, and site of one of the world's greatest wildernesses, the Kimberley. On a Barramundi fish farm, Simon meets a real life crocodile hunter, and ends up hauling a three metre crocodile onto the boat. The journey ends at Cape Leeuwin, at the south west tip of Australia.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:999b2ed3fe35fd695ff79e284ea58be309fce6b9","amp;dn":"Indian+Ocean+with+Simon+Reeve++%28BBC+2012+-+Complete%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"999b2ed3fe35fd695ff79e284ea58be309fce6b9","infoHashBuffer":{"type":"Buffer","data":[153,155,46,211,254,53,253,105,95,247,158,40,78,165,139,227,9,252,230,185]},"announce":[],"urlList":[]}}