{"title":"Coast to Coast AM February 25 2013","uid":8195064,"size":55935425,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:99c49574a55e827957ba308f92f4c95d6427dc4b&amp;dn=Coast+to+Coast+AM+February+25+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"runcdfirst","files":5,"time":1361898649,"description":"#we.are.some.of.the.leaders.on.the.motherpla.net\n\nDate: \t02-25-13\nHost: \tGeorge Noory\nGuests: \tEd Ozosky, Jeffrey Simon\n\nMember of the prestigious Rhine Research Center and 30-year veteran of paranormal research, Ed Ozosky discussed spontaneous psychokinesis, reincarnation, and evidence for ghosts as well as his experiences working with legends like J.B. Rhine and Ian Stevenson. &quot;My life has been one big paranormal adventure,&quot; he reflected, tracing his encounters with the paranormal all the way back to the age of two, when he had an encounter with a &quot;shadow ghost&quot; at his crib. According to Ozosky, the entity convinced him to climb upon the railing of the crib, leading him to tumble out and crack his head open upon hitting the floor. In light of this early experience, he marveled that &quot;I was recruited into the paranormal.&quot;\n\nBased on his research of supernatural phenomena, Ozansky stressed that &quot;80%, if not higher,&quot; of hauntings are from a departed loved one. Additionally, he suggested that ghosts may be frustrated because they retain their consciousness, but have no body and, thus, cannot 'speak' to the living. &quot;Consequently, they tend to use all six of our senses to communicate with us,&quot; he said, &quot;it could be anything from a smell to a dream.&quot; While pop culture depicts haunted houses as turbulent and frightening locations, Ozansky opined that, in most situations where a ghost is present in a home, the living family peacefully coexists with the spirit in their midst.\n\nOver the course of the evening, he also recalled his friendships with legendary parapsychologist J.B. Rhine as well as groundbreaking reincarnation researcher Ian Stevenson. Ozansky called Rhine a &quot;true gentleman,&quot; who took time out of his busy schedule to advise him on his research. However, he also noted that Rhine could be stubborn and was often faced with having to finding a balance between the interests of his financial backers and his own concepts. Ozansky explained that the financers were focused specifically on &quot;life after death,&quot; while Rhine argued that, in order to prove such a concept, &quot;we need to find something to show that some part of us exists outside the body.&quot;\n'Lone Wolf' Terrorists\n\nIn the first hour, terrorism expert Jeffrey Simon discussed the dangers of 'lone wolf' terrorists. He defined these individuals as simply terrorists who work alone, but can cause as much chaos and destruction as organized terror groups. Simon said these people also have agendas which can encompass a variety of causes and span the political spectrum, such as the notorious Unabomber. He noted that their solitary nature makes them far more difficult to apprehend or stop and that the Internet is a &quot;game changer&quot; since it allows for 'lone wolves' to access dangerous information and become &quot;self-radicalized&quot; without leaving the home. He also cautioned against categorizing all lone wolves as &quot;dumb and inept and crazy,&quot; because some can be very rational, smart, and dangerous.\n\nNews segment guests: Catherine Austin Fitts &amp; Christian Wilde\nWebsite(s):\n\n    hauntingsresearch.com\n    futureterrorism.com\n\nBook(s):\n\n    Lone Wolf Terrorism\n\n","torrent":{"xt":"urn:btih:99c49574a55e827957ba308f92f4c95d6427dc4b","amp;dn":"Coast+to+Coast+AM+February+25+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99c49574a55e827957ba308f92f4c95d6427dc4b","infoHashBuffer":{"type":"Buffer","data":[153,196,149,116,165,94,130,121,87,186,48,143,146,244,201,93,100,39,220,75]},"announce":[],"urlList":[]}}