{"title":"109 East Palace by Jennet Conant","uid":9715958,"size":3418500,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9b1ecd3171a6bc1edba78d1625c65110cf8989d9&amp;dn=109+East+Palace+by+Jennet+Conant&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"PirateBook","files":2,"time":1394160251,"description":"\n109 East Palace: Robert Oppenheimer and the Secret City of Los Alamos by Jennet Conant\n\nThey were told as little as possible.\n\nTheir orders were to go to Santa Fe, New Mexico, and report for work at a classified Manhattan Project site, a location so covert it was known to them only by the mysterious address: 109 East Palace. There, behind a wrought-iron gate and narrow passageway just off the touristy old plaza, they were greeted by Dorothy McKibbin, an attractive widow who was the least likely person imaginable to run a front for a clandestine defense laboratory. They stepped across her threshold into a parallel universe--the desert hideaway where Robert Oppenheimer and a team of world-famous scientists raced to build the first atomic bomb before Germany and bring World War II to an end.\n\nBrilliant, handsome, extraordinarily charismatic, Oppenheimer based his unprecedented scientific enterprise in the high reaches of the Sangre de Cristo mountains, hoping that the land of enchantment would conceal and inspire their bold mission. Oppenheimer was as arrogant as he was inexperienced, and few believed the thirty-eight-year-old theoretical physicist would succeed.\n\nJennet Conant captures all the exhilaration and drama of those perilous twenty-seven months at Los Alamos, a secret city cut off from the rest of society, ringed by barbed wire, where Oppenheimer and his young recruits lived as virtual prisoners of the U.S. government. With her dry humor and eye for detail, Conant chronicles the chaotic beginnings of Oppenheimer's by-the-seat-of-his-pants operation, where freshly minted secretaries and worldly scientists had to contend with living conditions straight out of pioneer days. \n\nDespite all the obstacles, Oppie managed to forge a vibrant community at Los Alamos through the sheer force of his personality. Dorothy, who fell for him at first sight, devoted herself to taking care of him and his crew and supported him through the terrifying preparations for the test explosion at Trinity and the harrowing aftermath of Hiroshima and Nagasaki.\n\nLess than a decade later, Oppenheimer became the focus of suspicion during the McCarthy witch hunts. When he and James B. Conant, one of the top administrators of the Manhattan Project (and the author's grandfather), led the campaign against the hydrogen bomb, Oppenheimer's past left-wing sympathies were used against him, and he was found to be a security risk and stripped of his clearance. Though Dorothy tried to help clear his name, she saw the man she loved disgraced.\n\nIn this riveting and deeply moving account, drawing on a wealth of research and interviews with close family and colleagues, Jennet Conant reveals an exceptionally gifted and enigmatic man who served his country at tremendous personal cost and whose singular achievement, and subsequent undoing, is at the root of our present nuclear predicament.\n\nMeet the Author:\n\nJennet Conant is a journalist who has written profiles for Vanity Fair, Esquire, GQ, Newsweek, and The New York Times. She is the author of the bestselling Tuxedo Park and 109 East Palace. Conant lives in New York City and Sag Harbor, New York, with her husband and son.\n\nGenre: Non-Fiction / History / WWII / The Bomb","torrent":{"xt":"urn:btih:9b1ecd3171a6bc1edba78d1625c65110cf8989d9","amp;dn":"109+East+Palace+by+Jennet+Conant","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b1ecd3171a6bc1edba78d1625c65110cf8989d9","infoHashBuffer":{"type":"Buffer","data":[155,30,205,49,113,166,188,30,219,167,141,22,37,198,81,16,207,137,137,217]},"announce":[],"urlList":[]}}