{"title":"The Most Amazing Chess Moves of All Time by John Emms...pdf","uid":8930553,"size":5420166,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9b49810df40c4a0e2dbb20915a8cfbdbee888500&amp;dn=The+Most+Amazing+Chess+Moves+of+All+Time+by+John+Emms...pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Djofullinn","files":-1,"time":1379461134,"description":"Very occasionally, a chess move is played that astonishes the whole world. It may be a move of astounding complexity, unearthly beauty, deep paradox...or all three. The move is discussed and analyzed around the world as chess-players attempt to fathom both why the move works, and how on earth anyone thought of it in the first place. In this book, John Emms has selected, from hundreds of candidates, the 200 most amazing chess moves of all time. In each case, the reader is given the chance to try to find the move for himself -- making this one of the most challenging chess puzzle books ever published. He provides full solutions, focusing on what can be learned from each Amazing Move, and what made it so hard to see. These moves are not, on the whole, completely beyond the comprehension of ordinary players. A standard reaction to these Amazing Moves is &quot;Of course! Why didn't I see that!&quot; By studying this book, you will both improve your chess, and increase your chances of becoming the proud player of an Amazing Move, rather than being the dumbfounded victim.\t","torrent":{"xt":"urn:btih:9b49810df40c4a0e2dbb20915a8cfbdbee888500","amp;dn":"The+Most+Amazing+Chess+Moves+of+All+Time+by+John+Emms...pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b49810df40c4a0e2dbb20915a8cfbdbee888500","infoHashBuffer":{"type":"Buffer","data":[155,73,129,13,244,12,74,14,45,187,32,145,90,140,251,219,238,136,133,0]},"announce":[],"urlList":[]}}