{"title":"BombSquad","uid":7244789,"size":40571761,"categoryP":"games","categoryS":"mac","magnet":"?xt=urn:btih:9be59c806cf401a04d4903eaf89388793f6e85ff&amp;dn=BombSquad&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"WinterGale","files":1,"time":1336246041,"description":"Take on the computer alone or with friends in campaign mode, or challenge said friends to a tournament of mini-games including Capture-the-Flag, King-of-the-Hill, Bomber-Hockey, and of course Epic-Slow-Motion-Elimination.\n\nLaugh gleefully as you land a perfectly-thrown sticky-bomb squarely on an opponent's face, or freeze them with an ice bomb and shatter them to bits with a punch; BombSquad's rag doll physics based gameplay ensures that every confrontation leads to a unique (and often hilarious) outcome.\n\nUp to 8 players can get in on the action on a single Mac through BombSquad's support of keyboards, USB gamepads, Wiimotes, PS3 controllers, and XBox 360 controllers. You can even use iPhones, iPod Touches, and iPads as controllers via 'BombSquad Remote', a free app available on the iOS App Store.\n\nTo victory!\n\n\n-----------------------------------------------------------------------------------\n\nFixed in 1.2.4:\n- fixed a bug where arrow keys wouldn't work properly when assigned to actions\n- fixed an issue where music could stop playing if the computer is under heavy load\n- fixed several very obscure bugs in team tournament games (thanks to the folks who turned on auto-bug-reporting!)\n\nIntroduced in 1.2.3:\n- Added Quick-Play Onslaught and Runaround games with infinite randomly generated waves of enemies.\n- The first few levels of the campaign are now much easier to complete.\n- Scores are now shown even on losses in co-op games, and *all* scores now count on Onslaught training.\n- Elimination games now show how many lives you have remaining when you spawn.\n- Added opt-in automatic bug reporting to keep BombSquad as bug-free as possible in the future.\n- Polished up the custom-soundtrack functionality a bit.","torrent":{"xt":"urn:btih:9be59c806cf401a04d4903eaf89388793f6e85ff","amp;dn":"BombSquad","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9be59c806cf401a04d4903eaf89388793f6e85ff","infoHashBuffer":{"type":"Buffer","data":[155,229,156,128,108,244,1,160,77,73,3,234,248,147,136,121,63,110,133,255]},"announce":[],"urlList":[]}}