{"title":"A Dramarama Collection (reup mp3 128)","uid":3927800,"size":310210560,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9d494968b54bacdcdbdcc03bdd22f506e9b4c959&amp;dn=A+Dramarama+Collection+%28reup+mp3+128%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"torcano","files":162,"time":1197225556,"description":"by Mark Deming\n\nBlending hard rock wallop, alternative rock smarts, power pop songcraft, and punk rock urgency, Dramarama was a band who seemed on the verge of a major commercial breakthrough several times during their 11-year career. Puzzlingly, it never arrived, though the band developed a potent following in their native New Jersey as well as the West Coast; their almost-hit, &quot;Anything Anything (I&amp;#039;ll Give You),&quot; was cited by L.A.&amp;#039;s KROQ-FM, arguably America&amp;#039;s most influential alternative rock outlet, as the most requested song in the station&amp;#039;s history. Formed in Wayne, NJ, by vocalist and songwriter John Easdale in 1983, Dramarama self-released a single and a five-song EP before a French label commissioned a full-length album from the band, which recycled material from both previous releases. The result, 1985&amp;#039;s Cinema Verite, featured &quot;Anything Anything,&quot; which began scoring airplay after the album was picked up by Chameleon Records in the United States. The group relocated to California in time for their second LP, Box Office Bomb, which earned enthusiastic reviews but not significantly greater sales. As the band was completing their fourth studio album, Vinyl, in 1991, Chameleon Records went bankrupt, and as the band scrambled to come up with the cash to finish the project, the elusive major-label deal finally materialized when Elektra picked up the project. However, while the success of Nirvana in 1991 would seemingly have broken open radio for bands as adventurous as Dramarama, their sound was too far from grunge to capitalize on the new openness, and the band&amp;#039;s 1993 album, Hi-Fi Sci-Fi, failed to make an impact outside the band&amp;#039;s devoted cult following. Dramarama called it a day after a farewell show at Asbury Park&amp;#039;s the Stone Pony in 1994; four years later, John Easdale returned to the music business with a solo album. The group was featured on the popular VH1 reality series Bands Reunited in 2004, prompting the collective?minus bassist Chris Carter?to reform around material originally intended for an Easdale solo record. Dramarama relased Everybody Dies in 2005. \n \n","torrent":{"xt":"urn:btih:9d494968b54bacdcdbdcc03bdd22f506e9b4c959","amp;dn":"A+Dramarama+Collection+%28reup+mp3+128%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d494968b54bacdcdbdcc03bdd22f506e9b4c959","infoHashBuffer":{"type":"Buffer","data":[157,73,73,104,181,75,172,220,219,220,192,59,221,34,245,6,233,180,201,89]},"announce":[],"urlList":[]}}