{"title":"4Media MP3 WAV Converter","uid":7162356,"size":28721282,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:9da2e261187f0a0c8b9cd1c25f84f328df02fb29&amp;dn=4Media+MP3+WAV+Converter&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"proffcom","files":-1,"time":1333657126,"description":"4Media MP3 WAV Converter program is designed to convert between MP3 format and WAV format, you can convert WAV music file to MP3 format to reduce the file size and vice versa, change MP3s to WAV format files for playback with CD quality. You can also convert other popular audio formats to MP3/WAV format like WMA, AAC, WAV, OGG, APE, M4A, MP2, AIFF, VQF and SUN AU and extract MP3/WAV audios from AVI, MPEG, MPG, MPEG-1, MPEG-2, MPEG-4, WMV videos.\n\nFeatures:\n1.Support MP3 to WAV and WAV to MP3 batch processing to save you from tedious repeated operations.\n2.Clip as many segments as you like from the source and output them to separated files to keep interested parts.\n3.The practical splitting function helps you to split a large file into several smaller parts before output to perfectly fit the capacity of your device.\n4.Versatile effects can be added to enrich the output like fade-in/fade-out, Normalize, Band Pass, Chorus, Flanger, Echo, all at your hand to create the most customized output.\n5.Get a better audio visual effect by Bitrate, Sampling Rate and Channels and other professional parameters.\n6.Edit ID3 information for music files to distinguish them from others.\n7.This converter is not only a superb MP3 to WAV and WAV to MP3 converter but also a very fine MP3/WAV player.\n8.Set audio conversions to run at the background and save CPU resources for other applications.\n9.English, German, Spanish, Italian, French, Japanese, Simplified and Traditional Chinese interface languages are available.","torrent":{"xt":"urn:btih:9da2e261187f0a0c8b9cd1c25f84f328df02fb29","amp;dn":"4Media+MP3+WAV+Converter","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9da2e261187f0a0c8b9cd1c25f84f328df02fb29","infoHashBuffer":{"type":"Buffer","data":[157,162,226,97,24,127,10,12,139,156,209,194,95,132,243,40,223,2,251,41]},"announce":[],"urlList":[]}}