{"title":"Innovations in Green Chemistry and Green Engineering","uid":12479992,"size":6071123,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a24bfb7c5050683ecfdc1f5987e789b581d350b4&amp;dn=Innovations+in+Green+Chemistry+and+Green+Engineering&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1443037257,"description":"Innovations in Green Chemistry and Green Engineering (Springer, 2013).pdf\n\nISBN 978-1-4614-5816-6\n\nProcesses that meet the objectives of green chemistry and chemical engineering minimize waste and energy use, and eliminate toxic by-products. Given the ubiquitous nature of products from chemical processes in our lives, green chemistry and chemical engineering are vital components of any sustainable future. Gathering together ten peer-reviewed articles from the &quot;Encyclopedia of Sustainability Science and Technology,&quot; &quot;Innovations in Green Chemistry and Green Engineering &quot;provides a comprehensive introduction to the state-of-the-art in this key area of sustainability research. Worldwide experts present the latest developments on topics ranging from organic batteries and green catalytic transformations to green nanoscience and nanotoxicology. An essential, one-stop reference for professionals in research and industry, this book also fills the need for an authoritative course text in environmental and green chemistry and chemical engineering at the upper-division undergraduate and graduate levels","torrent":{"xt":"urn:btih:a24bfb7c5050683ecfdc1f5987e789b581d350b4","amp;dn":"Innovations+in+Green+Chemistry+and+Green+Engineering","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a24bfb7c5050683ecfdc1f5987e789b581d350b4","infoHashBuffer":{"type":"Buffer","data":[162,75,251,124,80,80,104,62,207,220,31,89,135,231,137,181,129,211,80,180]},"announce":[],"urlList":[]}}