{"title":"Paths of Glory 1957 DVDRip Sonata Premiere","uid":9781491,"size":734247418,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a2ee5ad1090ec73490579ed0e826e0c3a4cf2599&amp;dn=Paths+of+Glory+1957+DVDRip+Sonata+Premiere&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"klinho","files":2,"time":1395105066,"description":"Adapting Humphrey Cobb's novel to the screen, director Stanley Kubrick and his collaborators Calder Willingham and Jim Thompson set out to make a devastating anti-war statement, and they succeeded above and beyond the call of duty. In the third year of World War I, the erudite but morally bankrupt French general Broulard (Adolphe Menjou) orders his troops to seize the heavily fortified &quot;Ant Hill&quot; from the Germans. General Mireau (George MacReady) knows that this action will be suicidal, but he will sacrfice his men to enhance his own reputation. Against his better judgment, Colonel Dax (Kirk Douglas) leads the charge, and the results are appalling. When, after witnessing the slaughter of their comrades, a handful of the French troops refuse to leave the trenches, Mireau very nearly orders the artillery to fire on his own men. Still smarting from the defeat, Mireau cannot admit to himself that the attack was a bad idea from the outset: he convinces himself that loss of Ant Hill was due to the cowardice of his men. Mireau demands that three soldiers be selected by lot to be executed as an example to rest of the troops. Acting as defense attorney, Colonel Dax pleads eloquently for the lives of the unfortunate three, but their fate is a done deal. Even an eleventh-hour piece of evidence proving Mireau's incompetence is ignored by the smirking Broulard, who is only interested in putting on a show of bravado. A failure when first released (it was banned outright in France for several years), Paths of Glory has since taken its place in the pantheon of classic war movies, its message growing only more pertinent and potent with each passing year (it was especially popular during the Vietnam era). \n\n\nLanguages: English / German","torrent":{"xt":"urn:btih:a2ee5ad1090ec73490579ed0e826e0c3a4cf2599","amp;dn":"Paths+of+Glory+1957+DVDRip+Sonata+Premiere","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a2ee5ad1090ec73490579ed0e826e0c3a4cf2599","infoHashBuffer":{"type":"Buffer","data":[162,238,90,209,9,14,199,52,144,87,158,208,232,38,224,195,164,207,37,153]},"announce":[],"urlList":[]}}