{"title":"Valkyrie(2008)DVDRip.AC3(ENG)-DROCK","uid":6803450,"size":733293809,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a43baa50b33e0669307cb82e9d994704e4d80258&amp;dn=Valkyrie%282008%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"drock232","files":-1,"time":1320771495,"description":"At the absolute height of World War II, German generals hatch a daring plan to assassinate Adolf Hitler and effectively render the German war machine impotent. Directed by Bryan Singer, Valkyrie stars Tom Cruise as Colonel Claus von Stauffenberg, the real-life mastermind behind the elaborate plot known as Project Valkyrie: a plan to assassinate Hitler and overthrow his government from the inside. Stauffenberg has been a loyal soldier and an asset to the Reich for his entire military career, but after losing an eye, a hand, and three fingers in an Allied bombing, he reaches a breaking point. The destructive madness that his country is unleashing on the world has become too terrible for the colonel to stand silent. He joins the resistance movement -- a treasonous act, punishable by death -- and risks his life and the life of his family for the chance to change history. Comprised of high-ranking officials working in secret, the German Resistance has access to the inner workings of the government and military, putting them in the perfect position to dispatch the dictator and then use his own official contingency plan to seize power -- before the army, the S.S., and loyal party members can put someone just as diabolical in the FÃƒÂ¼hrer's place. \n\nRipped with Handbrake.\n\nLength: 2 Hours\n\nFile Type: MP4\n\nFrame Width: 624\n\nFrame Height: 352\n\nFrame Rate: 29fps\n\nAudio\n\nBit Rate: 159kbps","torrent":{"xt":"urn:btih:a43baa50b33e0669307cb82e9d994704e4d80258","amp;dn":"Valkyrie%282008%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a43baa50b33e0669307cb82e9d994704e4d80258","infoHashBuffer":{"type":"Buffer","data":[164,59,170,80,179,62,6,105,48,124,184,46,157,153,71,4,228,216,2,88]},"announce":[],"urlList":[]}}