{"title":"Vegan Life - November 2015 (gnv64)","uid":12590072,"size":25644610,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a49a3f98746c46b1f5c9ced9b9ca695572dab6b6&amp;dn=Vegan+Life+-+November+2015+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gnv65","files":3,"time":1445087864,"description":"Vegan Life - November 2015\r\nEnglish | 116 pages | PDF | 24.4 mb\r\n\r\nON THE COVER\r\n54 Ocean Warriors - Sea Shepherd: saving the seas\r\n74 Dying planet - Is veganism the answer to climate change?\r\n84 Emptying every cage - Animal testing has hit the headlines again\r\n44 Fat Gay Vegan - How Sean O’Callaghan conquered the blogging scene\r\n\r\nSPECIAL FEATURES\r\n8 Vegan news All the latest stories\r\n26 Human v Carnivore - Are human bodies designed to eat meat?\r\n42 Comfort drinks - Wrap yourself up with our selection of warming and comforting drinks\r\n48 Meet the chef - We catch up with Aine Carlin\r\n60 Food focus - Weapons of mash destruction\r\n\r\nRECIPES\r\n22 Easy greens - This simple dish is bursting with goodness\r\n32 Lookbook Cookbook - Fashion takes a starring role in this unique compilation of recipes\r\n46 Hear me raw - Hearty raw recipes that pack a punch\r\n50 Aine Carlin’s signature dish - Taking tofu to flavourful new heights\r\n52 On the cover - Cold nights are perfect for this cosy dish\r\n56 Eat like a pirate - These tasty recipes come straight from Sea Shepherd’s ships\r\n64 Potato power - These recipes showcase the versatility of spuds\r\n69 Recipes from a Masterchef - Jackie Kearney shares some of her recipes with us\r\n80 Sensory overload - Chocolate and salt make the perfect flavour combination\r\n92 Club Mexicana - This South American staple is versatile and delicious\r\n100 Date Night - Feed your sweet tooth with natural sugar\r\n108 All wrapped up - This healthy wrap makes a hearty lunch\r\n\r\nVegan Inspiration\r\n20 Vegan people - Celebrating the vegan community\r\n30 Veganism changed my life - One man’s crusade to ‘vegucate’ the public\r\n35 Brains behind - Clothing company You’re So Vegan\r\n66 Tales of a Masterchef - How one cook is making vegan food for all\r\n78 May contain...The cross contamination debate\r\n96 Battle of the squirrels - Why the grey variety should not be sacrificed for the red\r\n102 Surreal Reality - Life, death, and veganism on canvas\r\n114 Somebody to love - Cats looking to meet humans online\r\n\r\nLIFESTYLE, HEALTH AND NUTRITION\r\n23 What’s new? The latest vegan products for you to try\r\n36 Will’s way - Cruelty-free living should not be a barrier to style\r\n38 Veg’s in fashion - Eco-style is no longer an oxymoron\r\n62 Top Taters - Easy vegan versions of classic potato dishes\r\n72 House of cannabis - These eco-builders have found innovative uses for hemp\r\n76 Keep calm and date a vegan - Rachel Kerry on vegan dating\r\n82 How to veganise cream - A guide to cream for those who’ve ditched the dairy\r\n88 Winter wellness - A look at the healing power of your diet\r\n106 Vegan city - Nathan Hudson explores a plant-based paradise\r\n\r\nRESOURCES\r\n6 Your feedback - Letters from you\r\n16 Vegan diary - Dates for your diary\r\n18 Vegan planet - Updates from around the world!\r\n24 Subscription offer - Subscribe and receive a free gift\r\n40 Eat and drink: vegan style - Fortify Cafè in Kent\r\n94 The accidental vegan - A selection of great products that are vegan by chance\r\n99 Giveaways\r\n109 Vegan pages\r\n \nhttp://s30.postimg.org/43hdlvfdd/Vegan_Life_November_2015.jpg","torrent":{"xt":"urn:btih:a49a3f98746c46b1f5c9ced9b9ca695572dab6b6","amp;dn":"Vegan+Life+-+November+2015+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a49a3f98746c46b1f5c9ced9b9ca695572dab6b6","infoHashBuffer":{"type":"Buffer","data":[164,154,63,152,116,108,70,177,245,201,206,217,185,202,105,85,114,218,182,182]},"announce":[],"urlList":[]}}