{"title":"Grateful Dead - American Beauty in DTS 5.1 - masterpiece!!!","uid":3569656,"size":4136362165,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a585394976d2fd06335cce925f9dafaf2012d57c&amp;dn=Grateful+Dead+-+American+Beauty+in+DTS+5.1+-+masterpiece%21%21%21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"mito2005","files":28,"time":1165125091,"description":"Greatful Dead - American Beauty in DTS 5.1 - A MASTERPIECE!!!!!!!!\n\n    * Interviews with Mickey Hart and Bob Weir\n    * A photo gallery\n    * Lyrics to all songs\n\nHistory\n\nThe band began recording American Beauty only a few months after the release of Workingman&amp;#039;s Dead. An odd occurrence was that the band recorded the album without their sound crew, which was out on the road as part of the Medicine Ball Caravan tour (of which the Dead were originally scheduled to join), and this led to staff engineer Steve Barncard replacing Bob Matthews as producer -- &quot;a move that irks Matthews to this day.&quot; Barncard mused that &quot;I had heard bad stories about engineers&amp;#039; interactions with the Dead ... but what I found were a bunch of hardworking guys.&quot;[1]\n\nBoth Workingman&amp;#039;s Dead and American Beauty were extremely innovative at the time for their fusion of bluegrass, rock and roll, folk music and, especially, country music. Like Workingman&amp;#039;s Dead, the album did not include any guitar solos from Jerry Garcia. It was during the recording of this album that Garcia would first collaborate with mandolinist David Grisman. &quot;I just bumped into Jerry at a baseball game in Fairfax, and he said, &quot;Hey, you wanna play on this record we&amp;#039;re doing?&quot; commented Grisman.[2] In fact, there were many big names in the &quot;San Francisco scene&quot; rotating in and out of the same studio. Lesh, in his autobiography, commented &quot;the magnetism of the scene at Wally Heider&amp;#039;s recording studio made it a lot easier for me to deal with Dad&amp;#039;s loss and my new responsibilies. Some of the best musicians around were hanging there during that period; with Paul and Grace from the [Jefferson] Airplane, the Dead, Santana, Crosby, Nash, and Neil Young working there, the studio became jammer heaven ... Thank the Lord for music; it&amp;#039;s a healing force beyond words to describe.&quot;[3]\n\n&quot;Truckin&amp;#039;&quot;/&quot;Ripple&quot; was released as a single and the songs &quot;Sugar Magnolia&quot; and &quot;Friend of the Devil&quot; also became &quot;instant radio favorites.&quot; In his book on Garcia, Blair Jackson noted that &quot;if you liked rock&amp;#039;n&amp;#039;roll in 1970, but didn&amp;#039;t like the Dead, you were out of luck, because they were inescapable that summer and fall.&quot;[2] American Beauty peaked at #30 on Billboard&amp;#039;s Pop Albums chart (North America), while the single, &quot;Truckin&amp;#039;&quot;, peaked at #64 on the Pop Singles chart and achieved considerable FM rock radio airplay. It is the final album with Mickey Hart until his return to the band four years later in 1975.\n\nThe highly-ranked Kelley-Mouse Studios album cover can also read American Reality.\n\nNote:  I apologize Jerry Garcia for doing this, but I believe you wouldn&amp;#039;t mind.\n","torrent":{"xt":"urn:btih:a585394976d2fd06335cce925f9dafaf2012d57c","amp;dn":"Grateful+Dead+-+American+Beauty+in+DTS+5.1+-+masterpiece%21%21%21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a585394976d2fd06335cce925f9dafaf2012d57c","infoHashBuffer":{"type":"Buffer","data":[165,133,57,73,118,210,253,6,51,92,206,146,95,157,175,175,32,18,213,124]},"announce":[],"urlList":[]}}