{"title":"G.I.JANE..DVDrip(vice)","uid":5022198,"size":589272254,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a6cf77fa2da07088cfcec8299975aa35ff580112&amp;dn=G.I.JANE..DVDrip%28vice%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"vicerock","files":-1,"time":1248480648,"description":"G.I.JANE DVDrip\n\nCODEC-xvid\nFRAME SIZE-320x240\nVIDEO BITRATE-768\nVIDEO FRAMERATE-768\n\nAUDIO CODEC-mp3\nAUDIO BITRATE-128\nSAMPLE RATE-44100\nAUDIO CHANNEL-2\n\nThe film begins with the public interview, by the Senate Armed Services Committee, of a candidate for the position of Secretary of the Navy. Senator Lillian DeHaven (Anne Bancroft) from Texas criticizes the fact that the Navy is not gender-neutral. Behind the curtains, a deal is struck: If women compare favorably with men in a series of test cases, the military will integrate women fully into all branches of the Navy. The first test case is for the training course of the U.S. Navy Combined Reconnaissance Team (similar to U.S. Navy SEAL BUD/S). Senator DeHaven hand-picks Lt. Jordan O'Neil (Demi Moore), because she is physically more feminine than the other, more &quot;butch&quot; candidates.\n\nTo make the grade, Jordan has to survive a grueling selection process, often called &quot;hell week,&quot; in which 60 percent of all candidates wash out. The enigmatic Command Master Chief John Urgayle (Viggo Mortensen) runs the brutal training program that involves 20-hour days of grueling physical tasks designed to wear down recruits' physical and mental strength, running, marching, and crawling through obstacle courses under the worst weather conditions while carrying landing rafts - not to mention eating out of a garbage can during breaks. O'Neil must repeatedly ask to be held to the same standard as the male trainees. Along with the best of the men, O'Neil handles the brutal training, including a vicious beating from Master Chief during SERE training, during which he tries to convince the other trainees that the presence of a woman will make them more vulnerable during actual combat. O'Neil fights back against the Master Chief and wins the respect of her team.\n\nOthers, also confident that a woman would quickly drop out, becomes concerned as Jordan's ability to handle training becomes evident. The situation becomes even more awkward as the civilian media learns about Jordan's training and how well she is doing, thus becoming a sensation known as &quot;G.I. Jane.&quot; Soon she must contend with trumped-up charges that she is a lesbian, and is fraternizing with women. O'Neil is told that she will be given a desk job during the investigation and, if cleared, will need to repeat training to earn SEAL status. She decides to &quot;ring out&quot; (she rings the bell three times, signaling her voluntary withdrawal from training) than accept the desk job. It is later revealed that the evidence of her fraternization came from Senator DeHaven's office, who never intended for O'Neil to succeed, but only pushed for her training to use her as a bargaining chip to prevent military base closings. Jordan threatens to expose DeHaven, who then restores O'Neil's SEAL trainee status.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0119173/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0119173/&lt;/a&gt;\n\nPLEASE SEED AND ENJOY","torrent":{"xt":"urn:btih:a6cf77fa2da07088cfcec8299975aa35ff580112","amp;dn":"G.I.JANE..DVDrip%28vice%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a6cf77fa2da07088cfcec8299975aa35ff580112","infoHashBuffer":{"type":"Buffer","data":[166,207,119,250,45,160,112,136,207,206,200,41,153,117,170,53,255,88,1,18]},"announce":[],"urlList":[]}}