{"title":"Paris - Paris [1976][320 KBPS][RMSTD]","uid":8053746,"size":136286578,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a8581a265307110b980fc589ee318caf4c1a507f&amp;dn=Paris+-+Paris+%5B1976%5D%5B320+KBPS%5D%5BRMSTD%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LameDuck69","files":13,"time":1358911555,"description":"Paris - Paris [1976]\n\n\n\n\n\n01. Black Book  \n02. Religion  \n03. Starcage  \n04. Beautiful Youth  \n05. Nazarene  \n06. Narrow Gate [La Porte Etroite]  \n07. Solitaire  \n08. Breathless  \n09. Rock Of Ages\n10. Red Rain \n\n\n\n\n\n320 KBPS\n\nCover Art\n\n\n\n\n\n\nFrom Wikipedia:\n\n\n\nParis was an American rock music power trio formed in 1975 by guitarist and vocalist Bob Welch, who had just left Fleetwood Mac, bass player Glenn Cornick, formerly of Jethro Tull, and drummer Thom Mooney who had been a member of Nazz with Todd Rundgren. The group released two albums for Capitol Records, but was largely unsuccessful and split in 1977. After the first album, Mooney was replaced by Hunt Sales, who had also played with Rundgren.\n\nInitially the band's sound was rock-oriented, but later developed towards funk, and represented a departure from Welch's work with Fleetwood Mac. A third album was planned, but Sales fell ill and the band split. Songs from the aborted third Paris album were used for Welch's first solo album, French Kiss, and the deal with Capitol was converted into a solo album deal for Welch.\n\nAfter Paris split up, Welch launched a successful solo career, and Sales worked with Iggy Pop and later Tin Machine with David Bowie. British-born Cornick moved to the US where, after a decade out of the music business, he reformed his band Wild Turkey in the 1990s.\n\n-----------------------------------------------------------------------------------\n\nParis was an eponymous album, the first of the two albums recorded by the power trio Paris, which was active from 1975-1977.\n\nParis comprised guitarist Bob Welch, formerly with Fleetwood Mac, bassist Glenn Cornick, formerly of Jethro Tull and drummer Thom Mooney, formerly of Nazz. It was the only album recorded by this line up, as Mooney left shortly afterwards.\n\nThe songs were all written by Bob Welch and are a major contrast to the songs he wrote with Fleetwood Mac, particularly the &quot;wistful romanticism of such songs as &quot;Sentimental Lady&quot;.\n\nThe album was not critically acclaimed, and sold modestly, reaching 103 on the Billboard pop album chart.\n\n","torrent":{"xt":"urn:btih:a8581a265307110b980fc589ee318caf4c1a507f","amp;dn":"Paris+-+Paris+%5B1976%5D%5B320+KBPS%5D%5BRMSTD%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a8581a265307110b980fc589ee318caf4c1a507f","infoHashBuffer":{"type":"Buffer","data":[168,88,26,38,83,7,17,11,152,15,197,137,238,49,140,175,76,26,80,127]},"announce":[],"urlList":[]}}