{"title":"Mysticum- Lost Masters of the Universe [Compilation]  2004 ","uid":11544310,"size":95162432,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a85dd1c734cab9b467ac4f62a7e5849e375be0f4&amp;dn=+Mysticum-+Lost+Masters+of+the+Universe+%5BCompilation%5D++2004+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"analogkid6103","files":17,"time":1416704848,"description":"\nTracks 1-7 taken from the &quot;Wintermass&quot; demo.\nTracks 8-11 taken from the &quot;Medusa's Tears&quot; demo.\nTrack 12 taken from the Mysticum / Ulver split.\nTrack 13 taken from the &quot;Piss Off&quot; promo.\nTrack 14 taken from &quot;Nordic Metal - A Tribute to Euronymous&quot;.\nTrack 15 taken from &quot;A Tribute to Hell - Satanic Rites&quot;.\nTrack 16 taken from the Audiopain / Mysticum split.\n\nReview:\nQuote:\nThe sum of their achievements - 95%\n\nI've been a fan of Mysticum for years and at this point I'm pretty familiar with everything they've ever released so I have no trouble saying that their only album is basically worthless.\n\nI say this because their two demos were totally awesome (with the exception of &quot;Father Beyond&quot; and &quot;The Grave of Petrified Souls&quot; which were total snoozers) and &quot;In the Streams of Inferno&quot; only ruined what was perfect to begin with.\n\nWhat killed their only full-length was the production. All the cool riffs were reduced to a constant unmusical distorted treble &quot;hiss&quot; and the drums ended up sounding like boring, lifeless techno beats. The drums on &quot;Wintermass&quot; and &quot;Medusa's Tears&quot; sounded like midi, but that's cool because it fit and their heaviness as far as bass is concerned gave them a very &quot;in your face&quot; kind of feel. Onward... The rest of the tracks are pretty cool, but &quot;Black Magic Mushrooms&quot; is the best.\n\nCLASSIC FUCKING MYSTICUM. My only complaint with this release is the sound quality of track 12 because it sounds like they were too lazy to hunt down the master tapes and just used the inferior vynil version. Come on guys, I know you didn't go into the studio and record directly to wax...?!? Oh well... The &quot;Wintermass&quot; version was a little better anyway and this gives me an excuse to not listen to what is essentially the same song. That said, this is really the only Mysticum CD you'll ever need unless they come out with a new one.\n\nSadly that may never happen and one of black metal's most unique bands (uniqueness, a rare quality in this genre) will go almost entirely unnoticed and fade away into obscurity... Tragic.\n\n\n\nMysticum @ MySpace\n\nQuote:\nMysticum plays pure fucking INDUSTRIAL BLACK METAL!! We started up in 1991 and was first signed by Euronmous's (R.I.P) label DEATH'LIKE SILENCE PRODUCTIONS, but because of his death there was no realease by us there.... We do not play any of that fake forest worshipping nature black metal! -We are representing total destruction of civilisations and human minds, cause we are the true worshippers of the black cosmos and the ones that will guide you to PLANET SATAN collecting your souls... DAMN YOU ALL!! HAIL SATAN!!\n\n\n\n\n\nLast known line-up\nPrime Evil (Ravn/Svartravn/Necrocum) - Vocals, Guitar (Amok (Nor), Aborym)\nCerastes (Der General) - Vocals, Guitar\nDr. Best (Robin &quot;Mean&quot; Malmberg) - Bass, Programming (Ulver (session))\n\nEnjoy\nGenre:\tBlack\nSubgenre:\tIndustrial Black Metal\nBitrate:\t192 k\nSize:\t90.75 MB\nShow/Hide Files: \t\n17 files","torrent":{"xt":"urn:btih:a85dd1c734cab9b467ac4f62a7e5849e375be0f4","amp;dn":"+Mysticum-+Lost+Masters+of+the+Universe+%5BCompilation%5D++2004+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a85dd1c734cab9b467ac4f62a7e5849e375be0f4","infoHashBuffer":{"type":"Buffer","data":[168,93,209,199,52,202,185,180,103,172,79,98,167,229,132,158,55,91,224,244]},"announce":[],"urlList":[]}}