{"title":"Pat Benatar - Love Is A Battlefield (Live-Beat Club) (2nafish)","uid":5242358,"size":134852612,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:a9112728a03aab686c99f7b4c8c253afe1258eac&amp;dn=Pat+Benatar+-+Love+Is+A+Battlefield+%28Live-Beat+Club%29+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1261787141,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Love Is a Battlefield&quot; is a song written by Holly Knight and Mike Chapman, after Pat Benatar asked Chapman to write her a hit song. It was released as a single from Benatar's album Live from Earth, which was popular in 1983 and 1984. The single has been certified gold and is her highest charting single in the United States, as it topped Billboard's Mainstream Rock Tracks chart for four weeks and made number five on the Billboard Hot 100. It topped the Australian singles chart for five weeks in 1984. The song was finally released in the United Kingdom in March 1985 and reached #17.\n\nThe music video, which depicted Benatar as a teenage runaway trying to survive the mean streets of New York City, was nominated for an MTV Video Music Award for Best Female Video and was viewable on the DVD for the movie 13 Going on 30. The single was unlike most of Benatar's previous work, as it featured an electronic dance element, but guitars and drums were still present. The song won Benatar a Grammy Award for Best Female Rock Vocal Performance.\n\nLive from Earth is the first live album from Pat Benatar and was released in 1983. It also contains two studio tracks, &quot;Love Is a Battlefield&quot; and &quot;Lipstick Lies&quot;, and these were produced by Neil Giraldo and Peter Coleman. The album peaked at #13 on Billboard's Top 200 albums chart and sold more than a million copies. A VHS concert titled &quot;Pat Benatar in Concert&quot; was released the same year but has different track listing, this was later released on DVD as &quot;Live from New Haven.&quot;\n\nPat Benatar (born January 10, 1953) is a four-time Grammy Award-winning American singer best known for her mezzo-soprano vocal range and establishing herself as one of rock's top vocalists and one of music's top-selling female artists with hit songs such as &quot;Love Is a Battlefield&quot;, &quot;Hit Me with Your Best Shot&quot;, &quot;We Belong&quot; and &quot;Heartbreaker&quot;.\n\nBenatar is one of the top-selling female artists of all-time, and one of the 1980s Top Platinum Album Recipients, according to the Recording Industry Association of America with two RIAA-certified Multi-Platinum albums and five RIAA-certified Platinum albums, plus three RIAA-certified Gold albums and 19 Top 40 singles to her credit.\n\nIn addition, Benatar is the first female artist featured on MTV, and her music video, You Better Run, is the second video aired by the network following its debut with The Buggles' &quot;Video Killed the Radio Star&quot;.\n\n\nMy Videos: &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:a9112728a03aab686c99f7b4c8c253afe1258eac","amp;dn":"Pat+Benatar+-+Love+Is+A+Battlefield+%28Live-Beat+Club%29+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a9112728a03aab686c99f7b4c8c253afe1258eac","infoHashBuffer":{"type":"Buffer","data":[169,17,39,40,160,58,171,104,108,153,247,180,200,194,83,175,225,37,142,172]},"announce":[],"urlList":[]}}