{"title":"Devitt-Concentration Camps in South Africa(British camps for Boe","uid":5167094,"size":198902,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a945eccda4fe42018e8f68eb35929077fd6e8f20&amp;dn=Devitt-Concentration+Camps+in+South+Africa%28British+camps+for+Boe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"red_gonzo","files":1,"time":1258471658,"description":"This is Napier Devitt's shocking booklet The Concentration Camps in South Africa During the Anglo-Boer War of 1899-1902 (1941) which was a blatant part of the 2nd World war propaganda effort to minimize the role of British concentration camps that were forced upon the Boers in South Africa over a hundred years ago. By using tables and statistics the author claims that the tragedies of massive Boer deaths in the Anglo-Boer war camps in remote locations like Mafeking were unavoidable and that the deaths were caused by &quot;the military strategy of the Boer leaders&quot; and the measles epidemic. Although the role of diseases in any such camps throughout history can't be underestimated, one somehow gets the feeling that the camps were justified and that there is nothing wrong by setting them up in the first place. It is interesting that today there are some people claiming exactly same on the part of the Nazi camps thus justifying the locking up of &quot;problematic&quot; people in such closed areas. And while all this goes on, similar camps (named detention centers) are being set up all over USA by the fascist globalists. Will someone in 50 years again write such a book downplaying the horrors that will probably be experienced by Americans who will be sent to these camps? It is the more unusual that Devitt became the first criminal magistrate in Johannesburg at about this time and should have some sense of justice but it seems loyalty always comes first. This very rare booklet documents for the purposes of propaganda the first concentration camps of the 20th century which - ironically - were set up not by Nazis nor Soviets but by the Allies (British) themselves - with catastrophic results for the population. 50 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:a945eccda4fe42018e8f68eb35929077fd6e8f20","amp;dn":"Devitt-Concentration+Camps+in+South+Africa%28British+camps+for+Boe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a945eccda4fe42018e8f68eb35929077fd6e8f20","infoHashBuffer":{"type":"Buffer","data":[169,69,236,205,164,254,66,1,142,143,104,235,53,146,144,119,253,110,143,32]},"announce":[],"urlList":[]}}