{"title":"Rothkugel-Geheimnis der Wahren Raumfahrt-Secret Space Program(20","uid":4675313,"size":70426624,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aa86aecb5b1ff906a324a984ea1fa9292c8b42c1&amp;dn=Rothkugel-Geheimnis+der+Wahren+Raumfahrt-Secret+Space+Program%2820&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"red_gonzo","files":1,"time":1232883729,"description":"For english-only speaking:\nThis book is in german language. English title would be: The Secret of Real Space Explorations - The Secret Space Program (2004). Klaus-Peter Rothkugel's banned and mindboggling installment of original research into power groups and super technology behind the real and absolutely secret space program from 3rd Reich onwards. From rocket-driven to electrogravitic saucer designs and their possible use for space explorations with sinister political agendas behind it. Contains probably the best material that is available on this topic. Together with 2-part book, the archive also includes additional bonus material, a short SF novel and a web compilation of odd pictures taken from space. Over 1000 pages, many pictures. A must read for everyone.\n\nFur Deutschsprachige:\nKlaus-Peter Rothkugel's verbotenes Fortsetzungsband zum ersten Buch (Das Geheimnis der deutschen Flugscheiben). Die wichtigsten elektromagnetischen Antriebe (&quot;Electrostatic Propulsion&quot;, &quot;Thermionic Propulsion&quot;, &quot;Electron Impact&quot;, &quot;Dipolar Force Field Propulsion&quot;, Plasma-Antriebe, &quot;MHD-By-Pass&quot; und &quot;Magnetic Energy Propulsion&quot;) werden detailliert besprochen (basierend auf offizielle, zumeist US-amerikanische Patent-Dokumente). Ob die bereits zuvor angesprochene heimliche Raumfahrt der &quot;B.I.S.&quot;, sowie RaumfahrtaktivitÃƒÂ¤ten anderer geheimer Raumfahrtorganisationen, auf dieser Welt stattfanden, oder einer anderen, mag der Leser fÃƒÂ¼r sich selbst entscheiden, wenn er das Ende von Teil II des Buches &quot;Das Geheimnis der Wahren Raumfahrt&quot; gelesen hat. Stichworte sind hier &quot;Zeitdilatation, Hologramme und kÃƒÂ¼nstl. Computer-generierte Parallelwelt&quot;. Wieso kehrten Raumschiffe, die mit beinahe Lichtgeschwindigkeit reisten, auf eine Erde im Altertum zurÃƒÂ¼ck, wenn sie doch gemÃƒÂ¤ÃƒÅ¸ der Zeitdehnung in der Zukunft hÃƒÂ¤tten ankommen mÃƒÂ¼ÃƒÅ¸en? Dazu auch Bonusmaterial und ein SF-Kurzroman &quot;Zeitdehnung&quot;. Die besten Informationen zum Thema UFOs, die zur Zeit verfÃƒÂ¼gbar sind. Uber 1000 Seiten, viele Abbildungen.\nInhalt:\nTeil I\n1. Kapitel: Die AnfÃƒÂ¤nge der (wirklichen/wahren) Raumfahrt \n2. Kapitel: Geheime Luftfahrttechnik und Entwicklungen wÃƒÂ¤hrend des Zweiten Weltkrieges und deren weltweite Weiterentwicklungen nach dem Kriege \nTeil II\n3. Kapitel: Elektrostatische und elektrokinetische Antriebe in der Luft- und Raumfahrt \n4. Kapitel: Nichts scheint so wie es ist \n","torrent":{"xt":"urn:btih:aa86aecb5b1ff906a324a984ea1fa9292c8b42c1","amp;dn":"Rothkugel-Geheimnis+der+Wahren+Raumfahrt-Secret+Space+Program%2820","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa86aecb5b1ff906a324a984ea1fa9292c8b42c1","infoHashBuffer":{"type":"Buffer","data":[170,134,174,203,91,31,249,6,163,36,169,132,234,31,169,41,44,139,66,193]},"announce":[],"urlList":[]}}