{"title":"This I Believe","uid":7848945,"size":174841365,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:ac12472ed4ce9956494f88e2463399127967140b&amp;dn=This+I+Believe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cloak-and-dagger","files":-1,"time":1353542897,"description":"An inspiring collection of the personal philosophies of a group of remarkable men and women\n \nBased on the National Public Radio series of the same name, This I Believe features eighty essayists--from the famous to the unknown--completing the thought that begins the book's title. Each piece compels readers to rethink not only how they have arrived at their own personal beliefs but also the extent to which they share them with others.\n \nFeaturing a well-known list of contributors--including Isabel Allende, Colin Powell, Gloria Steinem, William F. Buckley Jr., Penn Jillette, Bill Gates, and John Updike--the collection also contains essays by a Brooklyn lawyer; a part-time hospital clerk from Rehoboth, Massachusetts; a woman who sells Yellow Pages advertising in Fort Worth, Texas; and a man who serves on the state of Rhode Island's parole board.\n \nThe result is a stirring and provocative trip inside the minds and hearts of a diverse group of people whose beliefs--and the incredibly varied ways in which they choose to express them--reveal the American spirit at its best.","torrent":{"xt":"urn:btih:ac12472ed4ce9956494f88e2463399127967140b","amp;dn":"This+I+Believe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac12472ed4ce9956494f88e2463399127967140b","infoHashBuffer":{"type":"Buffer","data":[172,18,71,46,212,206,153,86,73,79,136,226,70,51,153,18,121,103,20,11]},"announce":[],"urlList":[]}}