{"title":"Brainwashing Manual","uid":4601590,"size":133829,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ac24a3831efb9538e0f940c4a13e57201b371028&amp;dn=Brainwashing+Manual&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Protocol22","files":2,"time":1230239095,"description":"\nBRAIN-WASHING \n\nSynthesis of the Russian Textbook on Psychopolitics\n\nPSYCHOPOLITICS - the art and\nscience of asserting and maintaining\ndominion over the thoughts and\nloyalties of individuals, officers,\nbureaus, and masses, and the effecting\nof the conquest of enemy\nnations through &quot;mental healing.&quot;\n\n\n\nThis book is a synthesis of information gathered through observation, discussion,\ninvestigation and experience over the last ten years.\nI cannot entirely vouch for its authenticity. Disclosure of the sources from which it is drawn would undoubtedly lead to great difficulties for them. And in matters of this kind the Soviet is not accustomed to the issuance of validations.\nHaving compiled this volume I did not easily discover any method of distributing it since my own facilities and finances are, as is customary with professors, necessarily limited.\n\nFurther, the placement of this volume in anyone's hands constituted to some degree a considerable risk to myself until I realized that there actually were two American groups in the field of mental science who were entirely above suspicion, particularly since they were often mentioned as Soviet targets by my informers and were mentioned in the actual text of this book as being antipathetic to this Soviet programme. These two groups were the Christian Scientists and the Dianeticists.\n\nChristian Science is an American Religion,intensely patriotic. Dianetics is the only entirely American development in the field of the human mind.\nKnowing from my information sources that Dianetics and Christian Science and their\npeople have experienced years of mauling and defamation at Communist hands, I am\nsubmitting to these organizations this work. I wish to express here my appreciation for their bold resistance to Communism through the years.\nI wish also to express my confidence in the future of the free nations of earth. Although the soviet has found a chink in the armour of individual liberty, it is certain that Democratic processes can mend it. That only the individual himself can protest against assault and injury to him before law, joined with the fact that the insane have no rights before law, has permitted in itself this deep ingress into our country's security. So long as this legal hole exists, there is then no law against driving anyone insane, even though this\nTHE BRAINWASHING MANUAL action deals as finally with a person as does murder. \nThe existence today of highly efficient drugs such as LSD, one-millionth of an ounce of which can create insanity,brings this legal loophole into focus. By enacting legislation permitting a friend or next ofkin to bring charges in case of assault, and by quickly placing all treatment of and institutions for the insane in the hands of ministers, taking it entirely out of the hands of European indoctrinated practitioners, the entire effort of psychopolitics can be nullified at once.\n\nIf you care to check this subject of psychopolitics against current occurrences in the American scene you will discover the urgency of such measures.\n\nCharles Stickley, New York City, 1955.","torrent":{"xt":"urn:btih:ac24a3831efb9538e0f940c4a13e57201b371028","amp;dn":"Brainwashing+Manual","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac24a3831efb9538e0f940c4a13e57201b371028","infoHashBuffer":{"type":"Buffer","data":[172,36,163,131,30,251,149,56,224,249,64,196,161,62,87,32,27,55,16,40]},"announce":[],"urlList":[]}}