{"title":"Anyone Can Play Harmonica An Easy Guide to Getting Started ","uid":4026353,"size":369009840,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:ad613c5410129affd010d37b371b90b7b3508b73&amp;dn=Anyone+Can+Play+Harmonica+An+Easy+Guide+to+Getting+Started+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"badboyroy","files":1,"time":1202936968,"description":"\t\n\t\n\nOk!\nHere is my first attempt to add a torrent.\nI hope I have done this correctly.\nIf not! I?m sure you will let me know.\n\nAnyone Can Play Harmonica\n\nAn Easy Guide to Getting Started \n\nHere?s a lesson for people of any age who want to play the harmonica. This pocket-size instrument has been a favorite for generations, and there?s no easier way to get started than this basic lesson. All you need is a 10-hole harmonica in the key of C (see our special offer below) and you?ll be playing in no time. \nPeter Madcat Ruth starts by showing you how to simply inhale and exhale to make sounds on the harmonica, and then turns this into a basic ?train rhythm? exercise. By narrowing your lips to get single notes, you?ll quickly be playing the easiest of all harmonica songs, Oh! Susanna. Refining your basic technique further, Madcat demonstrates the proper way to hold the instrument so you can achieve good tone, vibrato and ?wah wah? sounds that are typical of good harmonica playing. \nAfter learning the major scale, you are ready to play a number of songs, and Madcat teaches popular campfire favorites: Go Tell Aunt Rhody, Shenandoah, Down in the Valley, On Top of Old Smoky, Polly Wolly Doodle and Camptown Races. Moving on to the ?tonguing? method, he demonstrates how to combine melody notes with chord accompaniment and octaves to create more advanced sounds on your harmonica. \nOnce you?ve worked your way through this very easy and enjoyable lesson, the world of harmonica playing will be open to you, and you?ll be well on your way to more advanced styles and techniques.\n \n","torrent":{"xt":"urn:btih:ad613c5410129affd010d37b371b90b7b3508b73","amp;dn":"Anyone+Can+Play+Harmonica+An+Easy+Guide+to+Getting+Started+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad613c5410129affd010d37b371b90b7b3508b73","infoHashBuffer":{"type":"Buffer","data":[173,97,60,84,16,18,154,255,208,16,211,123,55,27,144,183,179,80,139,115]},"announce":[],"urlList":[]}}