{"title":"Heavy Metal Kids - Heavy Metal Kids (@256k)","uid":3988985,"size":78678144,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ae2343c3dd012bd522e45c487cdfc34ab2491bf3&amp;dn=Heavy+Metal+Kids+-+Heavy+Metal+Kids+%28%40256k%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Rezz1","files":10,"time":1200948174,"description":"The Heavy Metal Kids never became stars, never won any readers polls, never had a hit record. But, if you could roll back time to that moment in 1974 when the very first needle hit the very first pressing of their eponymous debut album, it would be impossible to predict that sordid fate. Quite frankly, Heavy Metal Kids rises so far above the rest of the period pack that -- Sparks and Cockney Rebel notwithstanding -- there was no more exciting proposition to be found on the new-release shelves. Part unrepentant boogie band, part pub rock leviathan, and part good-time distillation of the best of Slade and the Faces, fronted by the utterly irresistible cackle of singer Gary Holton, the Kids&amp;#039; flash, slash, and sashay assault had a cosmic energy that could transform even the ballads (&quot;It&amp;#039;s the Same,&quot; &quot;Nature of My Game&quot;) into fists-in-the-air anthems. A decade later, the band could have so rewritten the notion of the power ballad that suffering through the 1980s might never have been necessary; a decade earlier, the British Invasion could have been the new prog. Imagine Jim Steinman producing Them, and you&amp;#039;re close to the majesty of Heavy Metal Kids. As it is, the only people who seem to have truly noted what the Kids were doing were the Rolling Stones -- the laconic reggae of &quot;Run Around Eyes&quot; is a dry run for the Stones&amp;#039; later romp through &quot;Cherry Oh Baby.&quot; Heavy Metal Kids hits so many peaks -- &quot;Ain&amp;#039;t It Hard,&quot; &quot;Always Plenty of Women,&quot; &quot;Hangin&amp;#039; On&quot; -- that the end of the album comes so quickly that even they seemed to be taken by surprise. The closing &quot;Rock n&amp;#039; Roll Man,&quot; heralded by one of the most triumphant roars in rock history, is followed not by the sound of needle scraping label, but by a violent reprise for what remains the Kids&amp;#039; finest hour: the stomping, storming &quot;We Gotta Go.&quot; And that is not only a juxtaposition that will have you talking Cockney for the rest of the day, it also tells you everything you need to know about the Heavy Metal Kids. Nothing can be taken for granted -- and nothing was. Including the fame and glory that this album still demands. [allmusic.com]\n\n01. Hangin&amp;#039; On - 3.13\n02. Ain&amp;#039;t It Hard - 3.02\n03. It&amp;#039;s The Same - 5.53\n04. Run Around Eyes - 3.02\n05. We Gotta Go - 4.56\n06. Always Plenty Of Woman - 3.30\n07. Nature Of My Game - 3.39\n08. Kind Woman - 4.26\n09. Rock&amp;#039;n Roll Man - 7.40\n10. We Gotta Go (Reprise) - 1.32","torrent":{"xt":"urn:btih:ae2343c3dd012bd522e45c487cdfc34ab2491bf3","amp;dn":"Heavy+Metal+Kids+-+Heavy+Metal+Kids+%28%40256k%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae2343c3dd012bd522e45c487cdfc34ab2491bf3","infoHashBuffer":{"type":"Buffer","data":[174,35,67,195,221,1,43,213,34,228,92,72,124,223,195,74,178,73,27,243]},"announce":[],"urlList":[]}}