{"title":"GI JOE - The Rise of Cobra (H264) Ipod by LukeScooto.mp4","uid":6529012,"size":663218609,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b06d620b46cd2ba75ab8944e469819e5dbc96eef&amp;dn=GI+JOE+-+The+Rise+of+Cobra+%28H264%29+Ipod+by+LukeScooto.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LukeScooto","files":1,"time":1310258621,"description":"Two soldiers stationed in Kazahkstan (Captain Duke Hauser and his partner &quot;Ripcord&quot;) are ordered to transport special warheads created by MARS, an arms' manufacturer controlled by James McCullen. When they are attacked by thieves (led by Anastasia DeCobray, with whom Duke has history), they are saved by a top secret, international special forces unit known as &quot;G.I. Joe&quot;. The leader of G.I. Joe, General Abernathy (or Hawk) is on the trail of the thieves: an evil organization called &quot;Cobra&quot;. While Duke and Ripcord train to join the Joes, McCullen (&quot;Destro&quot;) is secretly working for Cobra and plotting to recapture his metal-eating &quot;Nanomite&quot; warheads. Duke and Ripcord (with help from Heavy Duty, Snake Eyes, and the rest of the Joes) must prove that they are Real American Heroes -- by stopping the launch of these warheads before Cobra uses them to take over the world. \n\nIm new to torrents, so ill upload the best I can. All my rips are top quality MP4\\\\\\'s, read to go on your ipod, ipad, play on your PC, stream to a tv, or copy to disc. Everything is dvd exact quality. Some of my upcoming rips are in IPAD format, because I just got an ipad 2 and want to have movies read to watch. Im new to everything, so please comment on any tips or things im doing wrong. ENJOY!\t","torrent":{"xt":"urn:btih:b06d620b46cd2ba75ab8944e469819e5dbc96eef","amp;dn":"GI+JOE+-+The+Rise+of+Cobra+%28H264%29+Ipod+by+LukeScooto.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b06d620b46cd2ba75ab8944e469819e5dbc96eef","infoHashBuffer":{"type":"Buffer","data":[176,109,98,11,70,205,43,167,90,184,148,78,70,152,25,229,219,201,110,239]},"announce":[],"urlList":[]}}