{"title":"888 Miniature Studies (Genrikh Kasparian)","uid":9106680,"size":59771705,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b09429e8ea31b752875d48dfc129d65bc8571654&amp;dn=888+Miniature+Studies+%28Genrikh+Kasparian%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"OmeGa15","files":-1,"time":1382894994,"description":"By IM Neboisa Illijin (from the introduction to the book):\n\nThe book presented here by G. Kasparian is one of the books that deserve to be greatly appreciated. Its technical value can be useful for all studies lovers and especially for practical chess players, in preparation. Not once it was proved that studies can be extremely useful for chess players, because they not only deÂ­velop their imagination and creativity, but face them with unusual situations that may appear on the chess board, sometimes seemingly impossible to be solved.\n\nCompared to the first version of this wonderful work, this edition brings addiÂ­tions that grow, not only numerically, but especially its quality. As a coach, who commonly used the first edition of this work, &quot;555 miniature studies&quot;, I can appreciate, without the fear to be wrong, that we are dealing with a complex maÂ­terial, very useful for coaches who want to put &quot;to work&quot; their students, in preparÂ­ing them for high performance. For these reasons I consider that such a book must have its place in every coach`s library and, probably, in any chess lover`s library.\n\n\n-- About the author --\n\nGenrikh Moiseyevich Kasparian (1910-1995) is considered one of the greatest composers of chess endgame studies. As a player, Kasparian won the Armenian championship ten times (including two ties with future World Champion Tigran Petrosian), and the Tiflis championship three times. He reached the USSR Championship finals on four occasions.\n\nKasparian is best known for his compositions. He started with chess problems, mainly three-movers, but soon discovered that his best field was in endgame studies. He wrote and composed several books and collections, and composed about 600 studies, winning 57 first prizes. He won the USSR Composing Championship several times.","torrent":{"xt":"urn:btih:b09429e8ea31b752875d48dfc129d65bc8571654","amp;dn":"888+Miniature+Studies+%28Genrikh+Kasparian%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b09429e8ea31b752875d48dfc129d65bc8571654","infoHashBuffer":{"type":"Buffer","data":[176,148,41,232,234,49,183,82,135,93,72,223,193,41,214,91,200,87,22,84]},"announce":[],"urlList":[]}}