{"title":"Lee Child Bad Luck And Trouble 2007 Retail eBook-BitBook","uid":8240121,"size":3330851,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b13550b64d38fe94e889c62c9b0a59bfbc329fdf&amp;dn=Lee+Child+Bad+Luck+And+Trouble+2007+Retail+eBook-BitBook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"BlackTar","files":3,"time":1362941782,"description":" |                          Bad Luck And Trouble                              |\n |                                                                            |\n |                                                                            |\n |                                                                            |\n |                                                                            |\n | DATE: 2012-11-15  SIZE: 1,72MB   DISKS: 01_______4,77MB      PAGES: 529    |\n |                                                                            |\n | PUBLISHER: Random House Publishing Group     GENRE: Fiction                |\n |                                                                            |\n | AUTHOR: Lee Child                                                          |\n |                                                                            |\n | FORMAT: PDF    PROTECTION: DRM     EDITION:                                |\n |                                                                            |\n | URL: http://is gd/L04D8z                                                   |\n |                                                                            |\n | LANGUAGE: English   ISBN: N/A                                              |\n :                                                                            :\n : From a helicopter high above the empty California desert, a man is sent    :\n : free-falling into the night.... In Chicago, a woman learns that an elite   :\n : team of ex--army investigators is being hunted down one by one.... And on  :\n : the streets of Portland, Jack Reacher--soldier, cop, hero--is pulled out of:\n : his wandering life by a code that few other people could understand. From  :\n : the first shocking scenes in Lee Child's explosive new novel, Jack Reacher :\n : is plunged like a knife into the heart of a conspiracy that is killing old :\n : friends...and is on its way to something even worse.                       :\n :                                                                            :\n : A decade postmilitary, Reacher has an ATM card and the clothes on his      :\n : back--no phone, no ties, and no address. But now a woman from his old unit :\n : has done the impossible. From Chicago, Frances Neagley finds Reacher, using:\n : a signal only the eight members of their elite team of army investigators  :\n : would know. She tells him a terrifying story--about the brutal death of a  :\n : man they both served with. Soon Reacher is reuniting with the survivors of :\n : his old team, scrambling to raise the living, bury the dead, and connect   :\n : the dots in a mystery that is growing darker by the day. The deeper they   :\n : dig, the more they don' t know: about two other comrades who have suddenly :\n : gone missing--and a trail that leads into the neon of Vegas and the        :\n : darkness of international terrorism.                                       :\n :                                                                            :\n : For now, Reacher can only react. To every sound. Every suspicion. Every    :\n : scent and every moment. Then Reacher will trust the people he once trusted :\n : with his life--and take this thing all the way to the end. Because in a    :\n : world of bad luck and trouble, when someone targets Jack Reacher and his   :\n : team, they'd better be ready for what comes right back at them...          :","torrent":{"xt":"urn:btih:b13550b64d38fe94e889c62c9b0a59bfbc329fdf","amp;dn":"Lee+Child+Bad+Luck+And+Trouble+2007+Retail+eBook-BitBook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b13550b64d38fe94e889c62c9b0a59bfbc329fdf","infoHashBuffer":{"type":"Buffer","data":[177,53,80,182,77,56,254,148,232,137,198,44,155,10,89,191,188,50,159,223]},"announce":[],"urlList":[]}}