{"title":"Fifth on the Floor - The Colour Of Whiskey (2007)","uid":8331250,"size":81073331,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b160734167f50b4df6f67794cdca19877955ab80&amp;dn=Fifth+on+the+Floor+-+The+Colour+Of+Whiskey+%282007%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Mr_Kurtz","files":-1,"time":1364894250,"description":"Fifth on the Floor - The Colour Of Whiskey (2007) mp3\n\n\nFifth on the Floor hails from Lexington, Kentucky and started out like all good bands do, on a Friday night over a bottle of Jim Beam. After a few weeks of song writing, line-up changes, and hangovers, the grouping of Chris Collins, Robin Polly, Matty Rodgers, and Justin Wells solidified the group dynamic and sound that are instantly identifiable.\n \nLess than a month after inception, Fifth on the Floor were hitting venues all over Kentucky. Soon after, the band was rocking stages in Virginia, Tennessee, Illinois, and Ohio. The songs that developed were recorded on Fifth on the Floors debut album, The Color of Whiskey. The release is as much a melting pot of American music as the band itself, with songs ranging from honky-tonk to southern jam to hard rock, and everything in between. The Color of Whiskey is as unabashedly raw and straight-forward as Fifth on the Floors live show.\n\nSure, these guys arent hip enough to be played on NPR, no writer will ever do a story on them in Rolling Stone, and they damn sure wont be seen on CMT or VH1 anytime soon. But if you have this record, why in the hell would you need any of that shit anyway?","torrent":{"xt":"urn:btih:b160734167f50b4df6f67794cdca19877955ab80","amp;dn":"Fifth+on+the+Floor+-+The+Colour+Of+Whiskey+%282007%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b160734167f50b4df6f67794cdca19877955ab80","infoHashBuffer":{"type":"Buffer","data":[177,96,115,65,103,245,11,77,246,246,119,148,205,202,25,135,121,85,171,128]},"announce":[],"urlList":[]}}