{"title":"Ethan Canin - America, America","uid":4986616,"size":2253100,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b19fcad01b3b1e4862ad04d56a73412dc037b94b&amp;dn=Ethan+Canin+-+America%2C+America&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":null,"files":1,"time":1246742740,"description":"From Ethan Canin, bestselling author of The Palace Thief,  comes a stunning novel, set in a small town during the Nixon era and today, about America and family, politics and tragedy, and the impact of fate on a young man's life.\n\nIn the early 1970s, Corey Sifter, the son of working-class parents, becomes a yard boy on the grand estate of the powerful Metarey family. Soon, through the family's generosity, he is a student at a private boarding school and an aide to the great New York senator Henry Bonwiller, who is running for president of the United States. Before long, Corey finds himself involved with one of the Metarey daughters as well, and he begins to leave behind the world of his upbringing. As the Bonwiller campaign gains momentum, Corey finds himself caught up in a complex web of events in which loyalty, politics, sex, and gratitude conflict with morality, love, and the truth.\nAmerica America is a beautiful novel about America as it was and is, a remarkable exploration of how vanity, greatness, and tragedy combine to change history and fate.","torrent":{"xt":"urn:btih:b19fcad01b3b1e4862ad04d56a73412dc037b94b","amp;dn":"Ethan+Canin+-+America%2C+America","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b19fcad01b3b1e4862ad04d56a73412dc037b94b","infoHashBuffer":{"type":"Buffer","data":[177,159,202,208,27,59,30,72,98,173,4,213,106,115,65,45,192,55,185,75]},"announce":[],"urlList":[]}}