{"title":"Neuroengineering - (Malestrom)","uid":4706290,"size":16024851,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b1d70527d64e7529ad925f97a0e4ce1d5c3e4f76&amp;dn=Neuroengineering+-+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"malestrom_HH","files":1,"time":1233867822,"description":" &lt;a href=&quot;http://www.image-upload.net/images/rh1w43qspjwbw99a7yc.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.image-upload.net/images/rh1w43qspjwbw99a7yc.jpg&lt;/a&gt;\n\nNeuroengineering\nCRC | ISBN: 0849381746 | Edition - 2007-12-07 | PDF | 408 pages\n\nBased on a foundation of fundamental science and empirical observation, engineering research and design is transforming science fiction into science fact. The convergence of neuroscience and technology is facilitating the development of therapies that not long ago would have seemed unimaginable, if not impossible. With contributions from a sampling of pioneers in industry, academia, and clinical medicine, Neuroengineering provides an understanding of the history, physiology, and the most promising engineering technologies.\n\nThe book begins with an examination of the extraordinary breadth and duration of investigation and discovery that have led to the current flood of innovation. It presents clinical applications of neuromodulation and a detailed review of the fundamental science and mechanisms of action underlying deep brain stimulation. Contributions include discussions of seizure control, clinical, surgical, and technological aspects of responsive neurostimulation, and a thorough review of spinal cord stimulation for pain control. The book also highlights promising technologies and applications for neural augmentation, brain and computer interfaces, and motor prostheses. It concludes with coverage of the fundamental science underlying current neurostimulation techniques and new paradigm-shifting neuromodulation technologies.\n\nWe are on the cusp of a technological revolution that holds promise to have a greater impact on human health, disease, and quality of life than any other in recent history. The transition of neural engineering from basic research to intense commercialization and widespread clinical application and acceptance is occurring now. Providing in-depth coverage of an enormous quantity of cutting-edge developments in technology and clinical practice, Neuroengineering presents detailed descriptions of fundamental science, emerging technologies, and clinical results that form the foundation of the future of neural engineering.","torrent":{"xt":"urn:btih:b1d70527d64e7529ad925f97a0e4ce1d5c3e4f76","amp;dn":"Neuroengineering+-+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b1d70527d64e7529ad925f97a0e4ce1d5c3e4f76","infoHashBuffer":{"type":"Buffer","data":[177,215,5,39,214,78,117,41,173,146,95,151,160,228,206,29,92,62,79,118]},"announce":[],"urlList":[]}}