{"title":"Six Men - Alistair Cooke - AZW3, EPUB, MOBI (Biography)","uid":11596280,"size":1471715,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b28d50169c128bc47025393d993265142b1383e1&amp;dn=Six+Men+-+Alistair+Cooke+-+AZW3%2C+EPUB%2C+MOBI+%28Biography%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"FreddyFroggy1","files":-1,"time":1417287739,"description":"Six Men - Alistair Cooke - AZW3, EPUB, MOBI. Published 1978\n\nNon-Fiction. Tags: Autobiography, Biography, Memoirs\n\nThis book is by the broadcaster Alistair Cooke (1908-2004), not Alastair Cook the current English cricket captain.\n\nAlistair Cooke's Six Men is a highly personal account of six remarkable men who made a deep impression on twentieth century history. During his extraordinary broadcasting career of over sixty years Cooke encountered many legendary figures, in the varied worlds of journalism, politics, public life, sport and entertainment.\n\nHere are candid portraits of the lovable yet unreliable Charlie Chaplin, who, when asked to be Cooke's best man, mysteriously vanished on the wedding day; the charming yet childlike 'golden boy' Edward VIII; Cooke's mentor, the flawed contrarian and satirist H. L. Mencken; Humphrey Bogart, revealing the complex and private man behind the tough-guy image; the larger-than-life liberal politician Adlai Stevenson; and the heroic social reformer and philosopher Bertrand Russell. Each superbly realized description is a masterpiece of observation, warmth and humor, recalling a golden age of 'great men'.\n\n'A rare delight ... he has that priceless gift of the gods, irresistible readability'\n- Spectator\n\n'There is never going to be anyone else like Cooke, a chronicler of amazing times'\n- Daily Telegraph\n\n'Six Men is the journalist's memoir par excellence'\n- Newsweek\n\n'The quintessential Alistair Cooke'\n- Economist\n\nAlistair Cooke enjoyed an extraordinary life in print, radio and television. The Guardian's Senior Correspondent in New York for twenty-five years and the host of groundbreaking cultural programs on American television and of the BBC series America, Cooke was, however, best known both at home and abroad for his weekly BBC broadcast 'Letter from America', which reported on fifty-eight years of US life, was heard over five continents and totaled 2,869 broadcasts before his retirement in February 2004, far and away the longest-running radio series in broadcasting history","torrent":{"xt":"urn:btih:b28d50169c128bc47025393d993265142b1383e1","amp;dn":"Six+Men+-+Alistair+Cooke+-+AZW3%2C+EPUB%2C+MOBI+%28Biography%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b28d50169c128bc47025393d993265142b1383e1","infoHashBuffer":{"type":"Buffer","data":[178,141,80,22,156,18,139,196,112,37,57,61,153,50,101,20,43,19,131,225]},"announce":[],"urlList":[]}}