{"title":"Few of Us _ Sharunas Bartas","uid":4349428,"size":733908992,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b4d626fbc73438b9d0e4a51550c62b5101b400b8&amp;dn=Few+of+Us+_+Sharunas+Bartas&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mfccorrea","files":1,"time":1219074042,"description":"Directed by Sharunas Bartas.\nStarring Yekaterina Golubeva, Yuliya Inozemtseva, Minoru Khideshima, Petr Kishteev, Sergei Tulaev.\nThis beautifully wrought art film from Lithuanian filmmaker Sharunas Bartas will offer a challenge to the most experienced arthouse patrons. With a primary focus on the setting, a ramshackle Tofolar village deep within Russia&amp;#039;s Sayan mountains, the film contains minimal dialogue, and very little obvious narrative, preferring instead to focus on natural sounds to draw the audience completely into a seldom seen world where nature is so beautifully ruthless that hope for the people can be found not through conversation, but through the humblest physical pleasures. The impoverished village is so remote and so high up that the only transportation comes from horses, domesticated elk and a single tank. A helicopter suddenly appears and delivers a young woman. Her reasons for visiting the snow-covered town are never explained. An old man invites her to his home and she sits within it broodingly smoking a cigarette. He does the same. Neither moves much. Little is said, and neither looks particularly happy about life. The rest of the villagers seem much the same. They day slowly progresses and as the vodka comes out, a grim fiesta begins. The guests get increasingly drunk while an accordion player performs melancholy songs. Two very inebriated, nearly unconscious young men provide the film&amp;#039;s only real action when they suddenly attempt to rape the woman. She quickly pulls out a knife. A dead body is seen in the next shot, but it is never clear who killed him. Before the story ends, another killing will occur, but only after a chase. ~ Sandra Brennan, All Movie Guide","torrent":{"xt":"urn:btih:b4d626fbc73438b9d0e4a51550c62b5101b400b8","amp;dn":"Few+of+Us+_+Sharunas+Bartas","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4d626fbc73438b9d0e4a51550c62b5101b400b8","infoHashBuffer":{"type":"Buffer","data":[180,214,38,251,199,52,56,185,208,228,165,21,80,198,43,81,1,180,0,184]},"announce":[],"urlList":[]}}