{"title":"Secrets of a Superthief","uid":4186617,"size":888593,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b4d92dd708856198dd135ca756ac6288abe4e5c2&amp;dn=Secrets+of+a+Superthief&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"rastiazul","files":2,"time":1210707506,"description":"Very rare, expensive, and out of print book about burglarly. In this remarkable book, the first of its kind, MacLean draws on his own experience as well as a unique survey of 300 burglars that he conducted in prison. Describing burglary as a &quot;mind game,&quot; he tells you what burglars look for and what scares them off.\n\nWritten while in jail by Jack MacLean, a man who served a fifteen-year prison term for committing over 2,000 and stealing over $133 million dollars in the 1980&amp;#039;s (indexed with inflation that would be $356 million today) through serial burglaries and was dubbed by the FBI as &quot;Superthief&quot;, this book is truly one of a kind and hard to find. The information kept within it is still usable today. The author details step-by-step how burglars break into homes and pilfer, and he shows you what to do to protect yourself. My only fear is that this book would get into the wrong hands because the information inside it is so usable and so well thought-out that it could potentially be used as an instruction manual for those who want to commit acts of burglary. This book is out of print and normally goes for $150-$250, depending on the quality of its condition. I remember even seeing it on ebay once for $400. If you manage to get a copy of this book, don&amp;#039;t give it away or sell it. The information inside is too valuable not to pass on to your friends and relatives.","torrent":{"xt":"urn:btih:b4d92dd708856198dd135ca756ac6288abe4e5c2","amp;dn":"Secrets+of+a+Superthief","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4d92dd708856198dd135ca756ac6288abe4e5c2","infoHashBuffer":{"type":"Buffer","data":[180,217,45,215,8,133,97,152,221,19,92,167,86,172,98,136,171,228,229,194]},"announce":[],"urlList":[]}}