{"title":"Mary Queen of Scots - Antonia Fraser  (Abridged)","uid":12113649,"size":383382471,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:b580fcd865fd97719fea64637bd1e2d6ee00916e&amp;dn=Mary+Queen+of+Scots+-+Antonia+Fraser++%28Abridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"davieboy1966","files":8,"time":1436634101,"description":"Written by Antonia Fraser\nRead by Patricia Hodge\nFormat: MP3\nBitrate: 128 Kbps\nAbridged\n\nLength: 6hes 30min\nPublisher: 10-09-2007\nRelease date: Orion Publishing Group\nFormat: 128kbp, mp3, abridged\n\nMore than 400 years after her death, Mary Queen of Scots remains one of the most romantic and controversial figures in British history. Antonia Fraser's classic biography of her won the James Tait Prize when it was first published in 1969. It became an international best-seller and was translated into nine languages.\n\nMary passed her childhood in France and married the Dauphin to become Queen of France at the age of 16. Widowed less than two years later, she returned to Scotland as Queen after an absence of 13 years. Her life then entered its best known phase: the early struggles with John Knox and the unruly Scottish nobility; the fatal marriage to Darnley and his mysterious death; her marriage to Bothwell, the chief suspect, that led directly to her long English captivity at the hands of Queen Elizabeth; the poignant and extraordinary story of her long imprisonment that ended with the labyrinthine Babington plot to free her, and her execution at the age of 44.\n\nAntonia Fraser's biography, four years in the writing, enters fully into the life of an historical figure who continues to capture the popular imagination. It provides a moving answer to the question, &quot;What was Mary Queen of Scots really like?&quot;\n\nNot my rip, thanks to the original uploader on avxhome.se\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:b580fcd865fd97719fea64637bd1e2d6ee00916e","amp;dn":"Mary+Queen+of+Scots+-+Antonia+Fraser++%28Abridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b580fcd865fd97719fea64637bd1e2d6ee00916e","infoHashBuffer":{"type":"Buffer","data":[181,128,252,216,101,253,151,113,159,234,100,99,123,209,226,214,238,0,145,110]},"announce":[],"urlList":[]}}