{"title":"My.Kitchen.Rules.AU.S04E34.WS.PDTV.XviD.BF1.avi","uid":8350967,"size":1047094836,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b5f2d52117c71ea738a4b5e6dd7e44dfce821b8b&amp;dn=My.Kitchen.Rules.AU.S04E34.WS.PDTV.XviD.BF1.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigfish5","files":1,"time":1365345228,"description":"My Kitchen Rules Australia Series 4 Episode 33\n\nWhen Australia's favourite home-cooking show returns for its fourth series in 2013, the table will be set for a few extra guests.\n\nWelcoming a new judge along with blind taste testing for the first time, the biggest shock for audiences will be seeing who's crashing the My Kitchen Rules dinner parties. Who do you think it could be?\n\nOne thing is certain: there are plenty of surprises in store when My Kitchen Rules launches in 2013.\n\nManu Feildel and Pete Evans return to host and judge the ultimate home-cooking battle as they accept dinner party invites in each state across the country.\n\nThis series they welcome new guest judge Colin Fassnidge to the table alongside returning guest judges Guy Grossi, Karen Martini and Liz Egan.\n\nIt's state versus state, plate against plate, as teams of two attempt to out-dine and out-wine each other to see whose kitchen rules.\n\nEach team will take turns to transform an ordinary home into an instant restaurant for one pressure cooker night. They'll serve up a three course menu designed to impress not only their fellow contestants but our esteemed judges.\n\nThere will be triumphs, kitchen fires, laughter, tears and plenty of opinionated guests as they battle the clock and their nerves to plate up on time.\n\nThe top two teams will again battle it out in the grand final where they will present their ultimate dining menu to a full restaurant.\n\nWith $250,000 in prize money on offer, the knives will definitely be out.\n\nIt's a twist no-one saw coming. Tonight, as teams are eliminated from Kitchen HQ, they're given one last shot in the MKR Comeback Kitchen. Eliminated teams will be put to the test in a restaurant for real customers with real money. There'll be blood, sweat and tears as teams are mentored under the watchful eye of Colin Fassnidge, who will be dishing out big serves of tough love. Manu and Pete will judge every meal to give one team a final elimination. Paying customers will decide who gets a pass to the next stage.\n\n","torrent":{"xt":"urn:btih:b5f2d52117c71ea738a4b5e6dd7e44dfce821b8b","amp;dn":"My.Kitchen.Rules.AU.S04E34.WS.PDTV.XviD.BF1.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5f2d52117c71ea738a4b5e6dd7e44dfce821b8b","infoHashBuffer":{"type":"Buffer","data":[181,242,213,33,23,199,30,167,56,164,181,230,221,126,68,223,206,130,27,139]},"announce":[],"urlList":[]}}