{"title":"Stories in Letters - Ezra Pound's Chinese Friends (269p) [Inua].","uid":11602167,"size":4110947,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b61f3dd6f8d20fc429610694128c0cd504b693dd&amp;dn=Stories+in+Letters+-+Ezra+Pound%27s+Chinese+Friends+%28269p%29+%5BInua%5D.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Inua1","files":1,"time":1417367006,"description":"Title: Ezra Pound's Chinese Friends: Stories in Letters\nAuthor: Zhaoming Qian\nHardcover: 268 pages\nPublisher: Oxford University Press; 1St Edition edition (April 15, 2008)\nLanguage: English\nISBN-10: 019923860X\nISBN-13: 978-0199238606\n\nDescription:\nNo literary figure of the past century - in America or perhaps in any other Western country - is comparable to Ezra Pound in the scope and depth of his exchange with China. To this day, scholars and students still find it puzzling that this influential poet spent a lifetime incorporating Chinese language, literature, history, and philosophy into Anglo-American modernism. How well did Pound know Chinese? Was he guided exclusively by eighteenth to nineteenth-century orientalists in his various Chinese projects? Did he seek guidance from Chinese peers? Those who have written about Pound and China have failed to address this fundamental question. No one could do so just a few years ago when the letters Pound wrote to his Chinese friends were sealed or had not been found. This book brings together 162 revealing letters between Pound and nine Chinese intellectuals, eighty-five of them newly opened up and none previously printed. Accompanied by editorial introductions and notes, these selected letters make available for the first time the forgotten stories of Pound and his Chinese friends. They illuminate a dimension in Pound's career that has been neglected: his dynamic interaction with people from China over a span of forty-five years from 1914 until 1959. This selection will also be a documentary record of a leading modernist's unparalleled efforts to pursue what he saw as the best of China, including both his stumbles and his triumphs","torrent":{"xt":"urn:btih:b61f3dd6f8d20fc429610694128c0cd504b693dd","amp;dn":"Stories+in+Letters+-+Ezra+Pound%27s+Chinese+Friends+%28269p%29+%5BInua%5D.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b61f3dd6f8d20fc429610694128c0cd504b693dd","infoHashBuffer":{"type":"Buffer","data":[182,31,61,214,248,210,15,196,41,97,6,148,18,140,12,213,4,182,147,221]},"announce":[],"urlList":[]}}