{"title":"Criticism of the Doctrines of Original Sin and Atonement","uid":4957174,"size":179525094,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b695ca304f919b619e22882baaa04d6571dcd9e8&amp;dn=Criticism+of+the+Doctrines+of+Original+Sin+and+Atonement&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"moman73","files":15,"time":1245166518,"description":"Criticism of the Doctrines of Original Sin and Atonement:\n\nThe doctrine of Original Sin (or Total Depravity or Total Inability) is central to Christianity. On top of this doctrine a whole bunch of other doctrines were developed. Without Original Sin, humans are free from eternal sin and there would be no need for Jesus to be crucified in order to save them, and the doctrine of Atonement becomes unnecessary. Thus, without Original Sin, the whole system of Christian beliefs would fall apart.\n\nThe net is full with websites and articles that expose the absurdity of Original Sin and Atonement. Titles 1-7 in this selection discuss Original Sin, and titles 8-14 discuss Atonement. \n\n1- The Great Myth, Original Sin. (from www.themystica.com)\n2- Myth of Original Sin; by: Mike Desario (http://standingthegap.org/)\n3- Are Men Born Sinners; by: A. T. Overstreet.\n4- Changing Conception of Original Sin; by: Shelton Smith, 1955.\n5- Sources of Doctrine of the Fall and Original Sin; by: F. R. Tennant, 1903.\n6- Total Depravity or Total Inability; by: Terry Benton.\n7- Refutation of Total Hereditary Depravity; by: Elder Aylett Raines, 1859.\n\n8- Theories of the Atonement; by: Leon Morris.\n9- Jesus, his Death and  Atonement Theory; by: Scot McKnight, 2005.\n10- Historic Theories of Atonement; by: Robert Mackintosh, 1921.\n11- A Short History of the Doctrine of Atonement; by: L.W. Grensted, 1920.\n12- The Idea of Atonement; by: Hastings Rashdall, 1919.\n13- A Critical History of Justification and Reconciliation; by: Albrecht Ritschl, 1872.\n14- The World's Sixteen Crucified Saviors; by: Kersey Graves, 1876. This book is very interesting for it shows that the idea of blood atonement has its roots in ancient mythology. Legends, fables and some writings (before Christianity) tells us that there were at least 16 cases of claimed &quot;Sons of God&quot; who were crucified to save their people. \n\n","torrent":{"xt":"urn:btih:b695ca304f919b619e22882baaa04d6571dcd9e8","amp;dn":"Criticism+of+the+Doctrines+of+Original+Sin+and+Atonement","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b695ca304f919b619e22882baaa04d6571dcd9e8","infoHashBuffer":{"type":"Buffer","data":[182,149,202,48,79,145,155,97,158,34,136,43,170,160,77,101,113,220,217,232]},"announce":[],"urlList":[]}}