{"title":"Where Demented Went The Art and Comics of Rory Hayes","uid":8719348,"size":110394100,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:b6cd8dd500a2aa900bca0c0186f795db93cb1f53&amp;dn=Where+Demented+Went+The+Art+and+Comics+of+Rory+Hayes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LeonardTSpock","files":-1,"time":1374392055,"description":"'Where Demented Went - The Art and Comics of Rory Hayes'\n\nFantagraphics Books, 2008, 145 pages\n\nContributors and Editors - Dan Nadel, Glenn Bray, Edwin Pouncey, Geoffrey Hayes \n\nThe first-ever collection by the underground's most notorious modern primitive.\n\nThe controversial cartoonist Rory Hayes was a self-taught dynamo of the San Francisco underground comics revolution. Attracting equal parts derision and praise (the latter from the likes of R. Crumb and Bill Griffith), Hayes emerged as comics' great primitive, drawing horror comics in a genuinely horrifying and halucinatory manner. He has influenced a generation of cartoonists, from RAW to Fort Thunder and back again.\n\nThis book, the first retrospective of Hayes' career ever published, features the best of his underground comics output alongside paintings, covers, and artifacts rarely seen by human eyes - as well as astounding, previously unprinted comics from his teenage years and movie posters for his numerous homemade films. The Comics and Art of Rory Hayes also serves as a biography and critique with a memoir of growing up with Rory by his brother, the illustrator Geoffrey Hayes, and a career-spanning essay by Edward Pouncey. Also included is a rare interview with Hayes himself.\n\n&quot;Rory Hayes was the real thing; a genuine 'outsider' artist working alongside his more self-aware compatriots in the heady days of the San Francisco Underground Comix scene of the 1960s and '70s. His work retains its raw, primitive power to this day, teetering precariously between chaos and control, madness and oddly endearing teddy bears.&quot; - Bill Griffith","torrent":{"xt":"urn:btih:b6cd8dd500a2aa900bca0c0186f795db93cb1f53","amp;dn":"Where+Demented+Went+The+Art+and+Comics+of+Rory+Hayes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b6cd8dd500a2aa900bca0c0186f795db93cb1f53","infoHashBuffer":{"type":"Buffer","data":[182,205,141,213,0,162,170,144,11,202,12,1,134,247,149,219,147,203,31,83]},"announce":[],"urlList":[]}}