{"title":"The World's First Railway System","uid":6625274,"size":2921195,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b7bac8aef5c4cb19b1cecb5787190297bbd2aff0&amp;dn=The+World%5C%27s+First+Railway+System&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"_F1_","files":-1,"time":1314138430,"description":"The World's First Railway System: Enterprise, Competition, and Regulation on the Railway Network in Victorian Britain\nMark Casson (Author)\n\nHardcover: 448 pages\nPublisher: Oxford University Press, USA (November 9, 2009)\nLanguage: English\nISBN-10: 0199213976\nISBN-13: 978-0199213979\n\nThe British railway network was a monument to Victorian private enterprise. Its masterpieces of civil engineering were emulated around the world. But its performance was controversial: praised for promoting a high density of lines, it was also criticised for wasteful duplication of routes.\n\nThis is the first history of the British railway system written from a modern economic perspective. It uses conterfactual analysis to construct an alternaive network to represent the most efficient alternative rail network that could have been constructed given what was known at the time - the first time this has been done. It reveals how weaknesses in regulation and defects in government policy resulted in enormous inefficiency in the Victorian system that Britain lives with today.\n\nBritish railway companies developed into powerful regional monopolies, which then contested each other's territories. When denied access to existing lines in rival territories, they built duplicate lines instead. Plans for an integrated national system, sponsored by William Gladstone, were blocked by Members of Parliament because of a perceived conflict with the local interests they represented. Each town wanted more railways than its neighbours, and so too many lines were built. The costs of these surplus lines led ultimately to higher fares and freight charges, which impaired the performance of the economy.\n\nThe book will be the definitive source of reference for those interested in the economic history of the British railway system. It makes use of a major new historical source, deposited railway plans, integrates transport and local history through its regional analysis of the railway system, and provides a comprehensive, classified bibliography.","torrent":{"xt":"urn:btih:b7bac8aef5c4cb19b1cecb5787190297bbd2aff0","amp;dn":"The+World%5C%27s+First+Railway+System","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b7bac8aef5c4cb19b1cecb5787190297bbd2aff0","infoHashBuffer":{"type":"Buffer","data":[183,186,200,174,245,196,203,25,177,206,203,87,135,25,2,151,187,210,175,240]},"announce":[],"urlList":[]}}