{"title":"Louis Jordan - The Best of Louis Jordan - FLAC","uid":5369585,"size":293711493,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b854709d8d654c22f0bea87d6e47d409ee8018cd&amp;dn=Louis+Jordan+-+The+Best+of+Louis+Jordan+-+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"aiel1","files":22,"time":1266380078,"description":"Louis Jordan\nThe Best of Louis Jordan\n1977\nFLAc\n\nSong Title\tArtist\n  1. Choo Choo Ch'Boogie\tLouis Jordan &amp; His Tympany Five\n  2. Let The Good Times Roll\tLouis Jordan &amp; His Tympany Five\n  3. Ain't Nobody Here But Us Chickens\tLouis Jordan &amp; His Tympany Five\n  4. Saturday Night Fish Fry\tLouis Jordan &amp; His Tympany Five\n  5. Beware\tLouis Jordan &amp; His Tympany Five\n  6. Caldonia\tLouis Jordan &amp; His Tympany Five\n  7. Knock Me A Kiss\tLouis Jordan &amp; His Tympany Five\n  8. Run Joe\tLouis Jordan\n  9. School Days\tLouis Jordan &amp; His Tympany Five\n10. Blue Light Boogie\tLouis Jordan\n11. Five Guys Named Moe\tLouis Jordan &amp; His Tympany Five\n12. What's The Use Of Getting Sober (When You're Gonna Get Drunk Again)\t\n\nLouis Jordan &amp; His Tympany Five\n13. Buzz Me Blues\tLouis Jordan &amp; His Tympany Five\n14. Beans And Cornbread\tLouis Jordan &amp; His Tympany Five\n15. Don't Let The Sun Catch You Cryin'\tLouis Jordan\n16. Somebody Done Changed The Lock On My Door\tLouis Jordan\n17. Barnyard Boogie\tLouis Jordan &amp; His Tympany Five\n18. Early In The Mornin'\tLouis Jordan\n19. I Want You To Be My Baby\tLouis Jordan &amp; His Tympany Five\n20. Nobody Knows You When You Are Down And Out\tLouis Jordan\n\n\nThank you.  Enjoy!\n\nComments:  &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;681f0d0d1f0d0d00071d1a1b280f05090104460b0705&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n\n\n--\nEffervescent saxophonist Louis Jordan was one of the chief architects and \n\nprime progenitors of the R&amp;B idiom. His pioneering use of jumping shuffle \n\nrhythms in a small combo context was copied far and wide during the \n\n1940s.\n\nJordan's sensational hit-laden run with Decca Records contained a raft of \n\nseminal performances, featuring inevitably infectious backing by his \n\nband, the Tympany Five, and Jordan's own searing alto sax and street \n\ncorner jive-loaded sense of humor. Jordan was one of the first black \n\nentertainers to sell appreciably in the pop sector; his Decca duet mates \n\nincluded Bing Crosby, Louis Armstrong, and Ella Fitzgerald.\n\nThe son of a musician, Jordan spent time as a youth with the Rabbit Foot \n\nMinstrels and majored in music later on at Arkansas Baptist College. \n\nAfter moving with his family to Philadelphia in 1932, Jordan hooked up \n\nwith pianist Clarence Williams. He joined the orchestra of drummer Chick \n\nWebb in 1936 and remained there until 1938. Having polished up his \n\nsinging abilities with Webb's outfit, Jordan was ready to strike out on \n\nhis own.\n\nThe saxist's first 78 for Decca in 1938, &quot;Honey in the Bee Ball,&quot; billed \n\nhis combo as the Elks Rendezvous Band (after the Harlem nightspot that he \n\nfrequently played at). From 1939 on, though, Jordan fronted the Tympany \n\nFive, a sturdy little aggregation often expanding over quintet status \n\nthat featured some well-known musicians over the years: pianists Wild \n\nBill Davis and Bill Doggett, guitarists Carl Hogan and Bill Jennings, \n\nbassist Dallas Bartley, and drummer Chris Columbus all passed through the \n\nranks.\n\nFrom 1942 to 1951, Jordan scored an astonishing 57 R&amp;B chart hits (all on \n\nDecca), beginning with the humorous blues &quot;I'm Gonna Leave You on the \n\nOutskirts of Town&quot; and finishing with &quot;Weak Minded Blues.&quot; In between, he \n\ndrew up what amounted to an easily followed blueprint for the development \n\nof R&amp;B (and for that matter, rock &amp; roll -- the accessibly swinging \n\nshuffles of Bill Haley &amp; the Comets were directly descended from Jordan; \n\nHaley often pointed to his Decca labelmate as profoundly influencing his \n\napproach).\n\n&quot;G.I. Jive,&quot; &quot;Caldonia,&quot; &quot;Buzz Me,&quot; &quot;Choo Choo Ch' Boogie,&quot; &quot;Ain't That \n\nJust like a Woman,&quot; &quot;Ain't Nobody Here but Us Chickens,&quot; &quot;Boogie Woogie \n\nBlue Plate,&quot; &quot;Beans and Cornbread,&quot; &quot;Saturday Night Fish Fry,&quot; and &quot;Blue \n\nLight Boogie&quot; -- every one of those classics topped the R&amp;B lists, and \n\nthere were plenty more that did precisely the same thing. Black audiences \n\ncoast-to-coast were breathlessly jitterbugging to Jordan's jumping jive \n\n(and one suspects, more than a few whites kicked up their heels to those \n\nsame platters as well).\n\nThe saxist was particularly popular during World War II. He recorded \n\nprolifically for the Armed Forces Radio Service and the V-Disc program. \n\nJordan's massive popularity also translated on to the silver screen -- he \n\nfilmed a series of wonderful short musicals during the late '40s that \n\nwere decidedly short on plot but long on visual versions of his hits \n\n(Caldonia, Reet Petite &amp; Gone, Look Out Sister, and Beware, along with \n\ncountless soundies) that give us an enlightening peek at just what made \n\nhim such a beloved entertainer. Jordan also cameoed in a big-budget \n\nHollywood wartime musical, Follow the Boys.\n\nA brief attempt at fronting a big band in 1951 proved an ill-fated \n\nventure, but it didn't dim his ebullience. In 1952, tongue firmly planted \n\nin cheek, he offered himself as a candidate for the highest office in the \n\nland on the amusing Decca outing &quot;Jordan for President.&quot; Even though his \n\nsingles were still eminently solid, they weren't selling like they used \n\nto by 1954. So after an incredible run of more than a decade-and-a-half, \n\nJordan moved over to Eddie Mesner's Los Angeles-based Aladdin logo at the \n\nstart of the year. Alas, time had passed the great pioneer by -- &quot;Dad Gum \n\nYa Hide Boy,&quot; &quot;Messy Bessy,&quot; &quot;If I Had Any Sense,&quot; and the rest of his \n\nAladdin output sounds great in retrospect, but it wasn't what young R&amp;B \n\nfans were searching for at the time. In 1955, he switched to RCA's \n\nshort-lived &quot;X&quot; imprint, where he tried to remain up-to-date by issuing \n\n&quot;Rock 'N' Roll Call.&quot;\n\nA blistering Quincy Jones-arranged date for Mercury in 1956 deftly \n\nupdated Jordan 's classics for the rock &amp; roll crowd, with hellfire \n\nrenditions of &quot;Let the Good Times Roll,&quot; &quot;Salt Pork, West Virginia,&quot; and \n\n&quot;Beware&quot; benefiting from the blasting lead guitar of Mickey Baker and Sam \n\n&quot;The Man&quot; Taylor's muscular tenor sax. There was even time to indulge in \n\na little torrid jazz at Mercury; &quot;The JAMF,&quot; from a 1957 LP called Man, \n\nWe're Wailin', was a sizzling indication of what a fine saxist Jordan \n\nwas.\n\nRay Charles had long cited Jordan as a primary influence (he lovingly \n\ncovered Jordan's &quot;Don't Let the Sun Catch You Crying&quot; and &quot;Early in the \n\nMorning&quot;), and paid him back by signing Jordan to the Genius' Tangerine \n\nlabel. Once again, the fickle public largely ignored his worthwhile \n\n1962-64 offerings.\n\nLounge gigs still offered the saxman a steady income, though, and he \n\nadjusted his on-stage play list accordingly. A 1973 album for the French \n\nBlack &amp; Blue logo found Jordan covering Mac Davis' &quot;I Believe in Music&quot; \n\n(can't get much loungier than that!). A heart attack silenced this \n\nvisionary in 1975, but not before he acted as the bridge between the big \n\nband era and the rise of R&amp;B.\n\nHis profile continues to rise posthumously, in large part due to the \n\nrecent acclaimed Broadway musical Five Guys Named Moe, based on Jordan's \n\nbubbly, romping repertoire and charismatic persona. ~ Bill Dahl, All \n\nMusic Guide","torrent":{"xt":"urn:btih:b854709d8d654c22f0bea87d6e47d409ee8018cd","amp;dn":"Louis+Jordan+-+The+Best+of+Louis+Jordan+-+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b854709d8d654c22f0bea87d6e47d409ee8018cd","infoHashBuffer":{"type":"Buffer","data":[184,84,112,157,141,101,76,34,240,190,168,125,110,71,212,9,238,128,24,205]},"announce":[],"urlList":[]}}