{"title":"Kriya - Sri Sri Ravi Shankar - Scientific Research.pdf","uid":4356855,"size":84662,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b9e0b2fe4ca5d09026b7aaa1a41bd3135c2cc8ec&amp;dn=Kriya+-+Sri+Sri+Ravi+Shankar+-+Scientific+Research.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"welovesrisri","files":1,"time":1219449966,"description":"Research on Sudarshan Kriya\nCopyright 2006 ÃƒÂ¢?? The Art of Living Foundation Page 1 of 6\nFor those who could not attend the World Conference held in Delhi, here are the\nkey findings of the latest research done on Sudarshan Kriya Yoga (SKY).\n1. Dr Richard Brown from the USA discussed how the application of newer\ntechnologies to basic research in Sudarshan Kriya Yoga (SKY) has thrown light\non our understanding of how SKY works. He postulated that SKY contributes to a\nstate of alert calmness by its effect on the vagus nerve which is the core of the\nparasympathetic system. Recent studies have shown that the vagus nerve is\ncrucial in social bonding, empathy and love; it is the centre of our gut\ninstincts and is crucial to our ability to perceive, observe and make complex\ndecisions. Vagal activity is estimated from the respiratory sinus arrhythmia as\nmeasured by heart rate variability. Impaired vagal activity is found in people with\ndepression, anxiety, panic disorders, irritable bowel syndrome, violent adults,\nfibromyalgia, post traumatic stress disorder, early Alzheimer's and\nobesity. Nowadays, an instrument that artificially stimulates the vagus nerve is\nbeing used to treat depression, epilepsy, early Alzheimer's disease and is an\nexperimental treatment for obesity. Stephen Porges, the foremost expert on the\nactivity of the vagus nerve on reviewing the research done on SKY has\nsuggested that the different rhythms of breath in SKY may stimulate different\ndiameter fibres of the vagus nerve. This makes SKY unique and likely to have a\nmuch wider range of effects than the currently available electronic vagus nerve\nstimulator. Dr Brown suggested that other mechanisms by which SKY works are\nby calming of stress response systems, neuroendocrine release of hormones,\nnitric oxide neurotransmission, fear conditioning circuits (prefrontal cortex and\nlimbic system), and thalamic generators. He also discussed various knowledge\npoints as articulated by Sri Sri Ravi Shankar from a neuro scientific perspective\nfor e.g., `Enlightenment is innocence with intellect'. Interestingly, brain wave\nrhythms during and after SKY are similar to those of babies.\nResearch on Sudarshan Kriya\nCopyright 2006 ÃƒÂ¢?? The Art of Living Foundation Page 2 of 6\n2. Dr. Fahri Saatcioglu from Oslo did a controlled 6 week long study of the\neffect of SKY on the relaxation response and feelings of wellness on 109\nsubjects. 56 subjects went through the SKY course and thereafter performed\nSKY yoga daily for 6 weeks. The control group of 53 subjects relaxed in an arm\nchair for 15 minutes daily for the same period. Both groups were given\nquestionnaires to assess changes in depression, anxiety, dispositional optimism,\nstress, energy and degree of altered states of consciousness before the\ninstruction and 6 weeks later. Dr Fahri found a statistically significant increase in\nthe experience of wellness in the SKY group compared to the controls.\nHe found a significant decrease in degree of anxiety, depression and stress and\na significant increase in degree of optimism in the group practicing SKY.\n3. Dr. Neeta Singh from New Delhi studied the effects of SKY on the gene\nexpression levels of the genes that affect several stress related pathways of the\nhuman body. She found an increase in antioxidant enzymes superoxide\ndismutase (SOD), glutathione peroxidase and glutathione in the 26 SKY\npractitioners as compared with 25 age and sex matched controls. The level of\nGlutathione was three times higher in SKY practitioners as compared with\ncontrols. A small increase was seen in hTERT in SKY practitioners which\nindicates delayed senescence and perhaps a longer life span. The observed\ndecrease in bcl-2, C-Myc and C- Fos in SK practitioners suggests probable better\nprotection against cancer. This study suggests that subjects doing SKY regularly\nhave a better antioxidant status and better ability to cope with stress.\n4. Dr Stephen Larsen from the USA studied neurophysiological responses\nbefore, during and after SKY. The tests run were EEG (recorded at 19 cortical\nsites), EKG, heart rate variability, galvanic skin response, hand skin temperature,\npulse plethysmography and blood pressure. He found that SKY practices\nproduced measurably significant changes in ALL physiological measures.\nResearch on Sudarshan Kriya\nCopyright 2006 ÃƒÂ¢?? The Art of Living Foundation Page 3 of 6\nBeginning practitioners of SKY had greater changes from their baselines\ncompared to more advanced practitioners. He found that during the practice\nthere is challenge, followed by temporary disorganization leading to calming,\nregularization and synchrony in such measures as heart rate variability and EEG.\nThe EEGs of beginners showed pockets of synchrony whereas\nin more advanced practitioners the baseline pre- practice synchrony was higher\nand a very high degree of &quot;total brain synchrony&quot; was observed across all 19\nchannels during the breath practices and rest periods. It appears that over a\nperiod of time, the practitioner's physiology becomes more robust, flexible and\nable to deal with the challenges of stressors and still is able to idle comfortably\nduring quiescence.\nThis explains why regular practice of SKY is very important. Dr Larsen also\nobserved certain large waves in the EEGs during SKY that resemble the ECT\nwaves (electro convulsive therapy). Electro convulsive therapy is an age old\ntreatment that is very effective in treating depression but is unpopular because of\nits side effects and convulsions produced. He suggested that the effect of SKY\non the brain is like a subconvulsive dose of ECT without the side effects of\nan ECT. This could explain why SKY is effective in patients with depression.\n5. Dr. Lyulyakina from Russia studied the functional status of the brain during\nand after the practice of SKY in 12 volunteers. She found that all the participants\nshowed statistically significant improvement of EEG parameters proved by\nspectral, power and topographic mapping and coherence analysis. She did not\nfind any statistically significant difference in the dynamics of electrophysiological\nprocess between the long Sudarshan Kriya and the shorter version of Sudarshan\nKriya.\nResearch on Sudarshan Kriya\nCopyright 2006 ÃƒÂ¢?? The Art of Living Foundation Page 4 of 6\n6. Dr. Geetha from Bangalore studied the effect of SKY on antioxidant\nenzyme activities in menopausal women. ÃƒÂ¢??There were 4 groups compared. One\ngroup of 40 women received hormone replacement therapy, one group of 40\nreceived 500mg of Vit E daily, a group of 60 women practiced SKY daily and 50\nwomen served as controls. In all groups, the plasma MDA levels (as an index of\nlipid peroxidation), erythrocyte SOD (superoxide dismutase) and blood GSH\n(glutathione peroxidase activity) were measured at the start and at the end of 30\ndays. Dr. Geetha found a significant decrease in the MDA levels and marked\nelevation of GSH-px and SOD levels in the group that practiced SKY as\ncompared with the other groups. Hence the practice of SKY improves the\nantioxidant power of menopausal women and is superior to the\nbeneficial effects seen with HRT or Vit E on anti-oxidant levels.\n7. Dr. Vedamurthachar from Bangalore studied the effect of the AOL Course\non occupational stress and anxiety among 60 software engineers in Bangalore.\nAt the end of a month, the 30 engineers who took the AOL course showed a\nstatistically significant reduction in anxiety and improvement in stress coping\nskills as compared with the 30 controls. However there were no significant\nchanges seen in the stress symptoms and stress producer variables.\n8. The oral microflora of SKY practitioners was studied by E G Lyulyakina\nfrom Russia. She found that the number of micro organisms in lacto vegetarians\nwere 2-3 times less than that in non strict vegetarians. Oral fluid samples of strict\nvegetarians did not show any growth of microorganisms after SKY practices. The\nbacteria found in oral cavity of non vegetarians were Gram negative Proteus\nwhich is evidence of putrefactive processes in the mouth of non\nvegetarians. She concluded that practice of SKY and a vegetarian diet reduces\nthe microbial content of the mouth.\nResearch on Sudarshan Kriya\nCopyright 2006 ÃƒÂ¢?? The Art of Living Foundation Page 5 of 6\n9. Dr. Chiplonkar from Pune studied the lifestyle, behavioural and health\naspects of 105 adults before and after undergoing the part I Art of Living Course.\nShe found that majority of micronutrients showed a positive correlation with\nsattvic foods. After the practice of SKY for 2 months, she found a significant\nreduction in anxiety score, marginal improvement in patience score and no\nchange in stress score. She also found a significant increase in antioxidant\ncapacity (measured as SOD), reduction in triglycerides, and a marginal reduction\nin oxidative stress (as measured by plasma MDA levels). Practicing SKY\nregularly resulted in greater reduction of anxiety score than less frequent\npractice. Subjects also reported a sense of well being, improvement in sleep\nquality and more enthusiasm at work.\n10. The psychospiritual benefits of SKY were studied in women diagnosed\nwith breast cancer by Arielle Warner in USA. The subjects were evaluated 2\nweeks before the Art of Living Course, 8 days after the Course and after 5 weeks\nof regular practice. A statistically significant improvement in quality of life,\nspiritual well being, positive states of mind and perceived stress was observed\nafter the AOL course and was maintained 5 weeks later.\n11. Dr Janis Carter from Australia compared the effects of different modalities\nlike Iyengar and Desikachar yoga, Qi Gong, Sudarshan Kriya Yoga and a\nmulticomponent yoga intervention (MCYI) in treating Australian Vietnam war\nveterans with long standing Post traumatic Stress disorder. She found that the\ninterventions that used many tools of yoga viz. Sudarshan Kriya Yoga and MCYI,\nshowed the greatest efficacy.\n12. Dr Patricia Gerberg from USA discussed the effects of doing the SKY\nprogram in a patient undergoing psychoanalysis since a long time. She found\nSKY useful in healing negative past impressions and the `dissociation' that\nrendered the patient unable to connect with others and with his own feelings.\nResearch on Sudarshan Kriya\nCopyright 2006 ÃƒÂ¢?? The Art of Living Foundation Page 6 of 6\n13. Janis Apted from the USA studied the effects of SKY on 48 highly\nstressed faculty members of the Anderson Cancer Centre in Houston, Texas.\nThe participants reported improvement in their mood, anxiety, stress, ability to\nstay calm and levels of anger and frustration.\n14. Dr. A M Huang from Taiwan showed how the serum levels of BDNF (Brain\nderived eurotrophic factor) were increased after practice of Pranayam and SKY.\nBDNF is lower in patients with depression compared to controls. A rise in serum\nBDNF levels could be an indicator of the beneficial effects of SKY on depression.\n15. An electrophysiological study on the effects of SKY was presented by\nShruti Baijal from Allahabad. An EEG study was done on SKY practitioners and\nage matched controls. Mismatch negativity paradigm that provides an indirect\nphysiological measure of the way sensory information is processed by the brain\nwas used for the study. Her conclusion was that there is a more efficient process\nof inhibition of irrelevant information and maintenance of focused\ninternalized attention for the SKY practitioners.","torrent":{"xt":"urn:btih:b9e0b2fe4ca5d09026b7aaa1a41bd3135c2cc8ec","amp;dn":"Kriya+-+Sri+Sri+Ravi+Shankar+-+Scientific+Research.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b9e0b2fe4ca5d09026b7aaa1a41bd3135c2cc8ec","infoHashBuffer":{"type":"Buffer","data":[185,224,178,254,76,165,208,144,38,183,170,161,164,27,211,19,92,44,200,236]},"announce":[],"urlList":[]}}