{"title":"BBC Horizon - Where is Flight MH370.mp4","uid":10478328,"size":668205993,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:ba842126e3584164fc4eb02156df56ebd2b67bda&amp;dn=BBC+Horizon+-+Where+is+Flight+MH370.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dcti6xtrm","files":1,"time":1404372684,"description":"Run time - 59 minutes, 17 seconds\n\nformat - mp4\n\nWith fresh memories in our minds of the unimaginable event on March 8 2014, which caused the world to hold its breath, this BBC Horizon documentary gives a forensic analysis of the ill-fated Malaysian Airlines flight MH370. 26 nations joined the search to find the missing plane. With theories such as terrorist attacks, a suicidal pilot, colossal technical faults or another event that caused loss of control - learn the inside story with air crash investigators.\n\nDelve behind the scenes of the engineering marvel which is the Boeing 777 - a plane with systems so advanced that it could technically fly itself.\n\nPlane navigation is pre-programmed by computers. Air paths are like the 'motorways in the sky' and have set routes which are defined by 'waypoints'. Waypoints have code names that the air traffic controllers and pilots use to describe certain points of an air path. Within a minute of taking off, the crew was told to change their route to a waypoint called Igari. The last automated message from the flight MH370 showed that it was flying the correct route to Beijing.\n\nWith an inconceivably large search area often called 'close to nowhere, as it's possible to be', investigators used data recorded via satellite communications to discover that the plane had flown on for 7 hours - after being lost on radars. With further investigation it was confirmed that the plane had not flown north as had hoped, but south into the southern Indian ocean. Why MH370 came to be so far off course is a question still to be answered.\n\nOn a race to find the plane's black box before the batteries that powered it ran out, an Australian navy support vessel located the ping signals from a black box. However, locating the box in an ocean almost 5 kilometers deep is difficult. Finding a needle in a haystack would be easier, because at least you have a haystack to know where to start the search. Continuing to look for the wreckage of MH370 is an ongoing process, but with several distinct pings from the black box, the 'haystack' has at least been found.\n\nThough we may never know the fate of the passengers onboard, the world shares the grief and pain of the families left behind. But with new aviation technology being developed, there may no longer be a requirement for black boxes on aircraft, which could also eliminate the possibility of an airplane to simply vanish from radar. There is hope that this tragic event will never happen again in the future.","torrent":{"xt":"urn:btih:ba842126e3584164fc4eb02156df56ebd2b67bda","amp;dn":"BBC+Horizon+-+Where+is+Flight+MH370.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba842126e3584164fc4eb02156df56ebd2b67bda","infoHashBuffer":{"type":"Buffer","data":[186,132,33,38,227,88,65,100,252,78,176,33,86,223,86,235,210,182,123,218]},"announce":[],"urlList":[]}}