{"title":"EnigmaT Set Rips { Cuts } - October 22nd, 2013","uid":9086712,"size":1295177107,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:bab748fab1ac3a0693b3ce1a616c73841cce4aa3&amp;dn=EnigmaT+Set+Rips+%7B+Cuts+%7D+-+October+22nd%2C+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"EnigmaT","files":132,"time":1382504488,"description":"4 Strings - Take Me Away (Giuseppe Ottaviani Remix) (Grotesque Festival Rip)-enTc.mp3\nAdventure Club - Thunderclap (Cut From W&amp;W Set)-enTc.mp3\nAicos - When She Looks At The River (Cut From A&amp;F Set)-enTc.mp3\nAlexandre Bergheau &amp; Alex Wackii - French Kiss (Original Mix) (Cut From GO Set)-enTc.mp3\nAllen &amp; Envy Feat. Fiona Dunkin - Hold Me In This Moment (Fher Vizzuett Remix) (Cut From Kaeno Set)-enTc.mp3\nAllen &amp; Envy Feat. Fiona Dunkin - Hold Me In This Moment (Paul Denton Remix) (Cut From A&amp;F Set)-enTc.mp3\nAndrea Mazza feat. Hysteria! - This Perfect Night (Original Mix) (Cut From GO Set)-enTc.mp3\nAndy Cain - The Dream (Cut From Lynam Set)-enTc.mp3\nAnGy KoRe - Rebel (Original Mix) (Cut From Sherry Set)-enTc.mp3\nArthur &amp; Adam Navel - Crescenica (Dave Cold Remix) (Cut From Cold Set)-enTc.mp3\nASKII &amp; DJ Roxy - Inside A Dream (Stephane Badey Remix) (Cut From Summerville Set)-enTc.mp3\nAudien feat. Michael S. - Leaving You (Thomas Newson Remix) (Cut From W&amp;W Set)-enTc.mp3\nAugust Vila &amp; Olbaid - Blackout (Cut From Trainer Set)-enTc.mp3\nBangerz &amp; Masherz - Virus In Me (Cut From Lynam Set)-enTc.mp3\nBissen - Clockwise (Rich Smith Remix) (Cut From Bissen Set)-enTc.mp3\nBraingbug - Nightmare (Adam White Remix) (Cut From Lynam Set)-enTc.mp3\nBraulio Stefield - Valiente (Original Mix) (Cut From Above Clouds Set)-enTc.mp3\nCalvin Harris feat. Ellie Goulding - I Need Your Love (ID Remix) (Cut From Tempo Set)-enTc.mp3\nCaptiva - Memories (John Sunlight Remix) (Cut From Summerville Set)-enTc.mp3\nCarol Lee and Adrian &amp; Raz - I Belong To (Tom8 Dub Mix) (Cut From Shah Set)-enTc.mp3\nCBM &amp; Renato Dinis - Zero XL (Cut From Stowers Set)-enTc.mp3\nCharles McThorne - Oxydizing (Original Anthem Mix) (Cut From Bissen Set)-enTc.mp3\nChris North - Cataclysm (Original Mix) (Cut From Saux Set)-enTc.mp3\nCiro Visone - Shadow Dancer (Original Mix) (Cut From Kaeno Set)-enTc.mp3\nCiro Visone - Shadow Dancer (Original Mix) (Cut From Photographer Set)-enTc.mp3\nCiro Visone - Summer Days (Michele Cecchi Remix) (Cut From Saux Set)-enTc.mp3\nCraig Connelly &amp; Shaun Gregory - Midnight Circus (Set Rip)-enTc.mp3\nCraig Connelly - Decibels (Set Rip)-enTc.mp3\nCris Ketelaars -aka- Christopher Ketelaars - No Rush (Cut From Oberon Set)-enTc.mp3\nCut Bit Motorz &amp; Tomi Chair - Be Pop (Aural Imbalance Remix) (Cut From Solarstone Set)-enTc.mp3\nDada Life - Born To Rage (Original Mix) (Cut From R3HAB Set)-enTc.mp3\nDannic &amp; Sick Individuals - Blueprint (Cut From W&amp;W Set)-enTc.mp3\nDark Air - Prism (Cut From Stowers Set)-enTc.mp3\nDark Air - Sacred Boon (Cut From Saux Set)-enTc.mp3\nDart Rayne - Lionheart (Etasonic Remix) (Cut From Type 41 Set)-enTc.mp3\nDave Cold - Apex (Original Mix) (Cut From Cold Set)-enTc.mp3\nDeepfunk &amp; Van Did - Cuatro (Cut From Barone Set)-enTc.mp3\nDisco Fries - Lose It (Riggi &amp; Piros Remix) (Cut From R3HAB Set)-enTc.mp3\nDiscrete - Digital Sarcasm (Cut From Trainer Set)-enTc.mp3\nDJ Ange - Elsker (Cut From Ange Set)-enTc.mp3\nDJ Chris - New Attack (Estigma Remix) (Cut From Summerville Set)-enTc.mp3\nDJ Flash - Ohh (Cut From Page Set)-enTc.mp3\nDJ Triston vs Dave-PL - Python (M.Pravda Remix) (Cut From M.PRAVDA Set)-enTc.mp3\nDyro - Go Down (Cut From Xabi Set)-enTc.mp3\nEDX - Hyped (Club Mix) (Cut From Xabi Set)-enTc.mp3\nELV - Beginning (Original Mix) (Cut From Vale Set)-enTc.mp3\nErick Strong &amp; Eskova - Another Day Of Life (Turn Remix) (Cut From Del Mar Set)-enTc.mp3\nFawn vs. Digital Sixable - Where Has Your Love Gone (Lime Time Remix) (Cut From Barone Set)-enTc.mp3\nFergie &amp; Sadrian - Anubis (Sequence Remix) (Cut From Kaeno Set)-enTc.mp3\nFrench Skies - Story Of An Epic (E.T. Project Remix) (Cut From Del Mar Set)-enTc.mp3\nFrench Skies - Story of an Epic (Imperfect Hope Emotional Remix) (Cut From Shadows Set)-enTc.mp3\nG8 - Escape (Original Mix) (Cut From Ekman Set)-enTc.mp3\nGeert Huinink &amp; Mike van Fabio - The Kingdom (Original Epic Mix) (Cut From A&amp;F Set)-enTc.mp3\nHackler &amp; Kuch - Z6 (Deh-Noizer Remix) (Cut From Sherry Set)-enTc.mp3\nHanski - La Night (Blugazer Remix) (Cut From Tempo Set)-enTc.mp3\nHarmonic Rush - Salvia (Cut From Summerville Set)-enTc.mp3\nHassen B - Land Of Happiness (E.T Project Remix) (Cut From tranzLift Set)-enTc.mp3\nHedonist - Zealot (Original Mix) (Cut From TyPhone Set)-enTc.mp3\nHemstock &amp; Jennings vs Beam feat. Sarah Tuson - Bliss (Kenan Teke Remix) (Cut From Richiere Set)-enTc.mp3\nHesham Watany - Crixalis (Morth Project Remix) (Cut From Sty Set)-enTc.mp3\nHi-Gate - Pitchin (Dorian &amp; Hennessy Remix) (Cut From Jules Set)-enTc.mp3\nHiroki Nagamine - Cirrus Skies (Original Mix) (Cut From Above Clouds Set)-enTc.mp3\nJace Williams - Bambu (Cut From Jules Set)-enTc.mp3\nJames Dymond - Carbon (Original Mix) (Cut From Sherry Set)-enTc.mp3\nJesper Olesen &amp; Rich Triphonic - Reflective Love (Original Mix) (Cut From Standerwick Set)-enTc.mp3\nJesper Olesen &amp; Rich Triphonic - Reflective Love (Original Mix) (Cut From Summerville Set)-enTc.mp3\nJohann Stone - White Walkers (Steve Morley Remix) (Cut From Oberon Set)-enTc.mp3\nJohn Christian - Gunshot (Cut From W&amp;W Set)-enTc.mp3\nJorio - Remember Me (Paul Denton Rework) (Cut From Lazarus Set)-enTc.mp3\nJunior J - I Feel You (Luigi Lusini Remix) (Cut From Jules Set)-enTc.mp3\nKacper Kostecki - True Story (Cut From Barone Set)-enTc.mp3\nKlonez &amp; Splinta - Can You See (Original Mix) (Cut From TyPhone Set)-enTc.mp3\nKrzysztof Chochlow - Sound (Am Version) (Cut From Jules Set)-enTc.mp3\nLock Angeles Feat. Thomas Oliver - Believe In Love (Cut From Jules Set)-enTc.mp3\nM3R-T - I Live Fast, Die A Legend (Eugene Karnak Flashback Mix) (Cut From Vale Set)-enTc.mp3\nMaestro Mix - Epical Lava (Dave Cold Remix) (Cut From Cold Set)-enTc.mp3\nManida - Rising Sun (Original Mix) (Cut From Del Mar Set)-enTc.mp3\nMatt Holliday and Valker - Culture (Original Mix) (Cut From GO Set)-enTc.mp3\nMatt Holliday feat. Lisa Marie - It Feels Right (Extended Mix) (Cut From Cold Set)-enTc.mp3\nMatthew Preffekt &amp; Aleksey Sladkov &amp; Sasha August - Epic (Spark7 Remix) (Cut From Feel Set)-enTc.mp3\nMed &amp; Phil Metcalfe - January (Ronny K. Remix) (Cut From Lazarus Set)-enTc.mp3","torrent":{"xt":"urn:btih:bab748fab1ac3a0693b3ce1a616c73841cce4aa3","amp;dn":"EnigmaT+Set+Rips+%7B+Cuts+%7D+-+October+22nd%2C+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bab748fab1ac3a0693b3ce1a616c73841cce4aa3","infoHashBuffer":{"type":"Buffer","data":[186,183,72,250,177,172,58,6,147,179,206,26,97,108,115,132,28,206,74,163]},"announce":[],"urlList":[]}}