{"title":"The Musketeer-(Dvd2002)Catherine Deneuve, Tim Roth","uid":4504825,"size":732971567,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bb0f1f263a57eea94152a81b41507dc30709eec4&amp;dn=The+Musketeer-%28Dvd2002%29Catherine+Deneuve%2C+Tim+Roth&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jazz3","files":2,"time":1226550281,"description":"Movie Description\nEighteenth Century France. When his parents are slaughtered by Cardinal Richelieu's man, Febre (Tim Roth), the young D'Artagnan is raised to be a musketeer by the loyal Planchet (Jean-Pierre Castaldi). Fourteen years later, Planchet takes the now-grown D'Artagnan (Justin Chambers) to Paris. There, they discover that the king's musketeers have been disbanded, that Richelieu (Stephen Rea) is plotting to undermine the monarchy, and that Febre is barely under control. So, the upstart D'Artagnan boldly sets out to reinvigorate the musketeers and save the monarchy--while taking revenge on Febre.\n\n\nIn this version of Alexandre Dumas' much-filmed classic, director Peter Hyams and scriptwriter Gene Quintano switch focus from The Three Musketeers to D'Artagnan. Lavishly shot on location in France and Luxembourg by Hyams--acting as his own cinematographer--THE MUSKETEER aims for the robust approach and brutal humor of Richard Fleischer's THE PRINCE AND THE PAUPER. Mixed in are fight sequences that utilize the skill of Hong Kong fight choreographer Xin Xin Xiong, who stages an exciting reprise of the ladder fight from Tsui Hark's ONCE UPON A TIME IN CHINA. Tim Roth is at his villainous best, and Catherine Deneuve enjoys herself as the queen--whether reigning at court or escaping through the sewers of Paris.\n\nCredits \nCast: Catherine Deneuve, Tim Roth \nDirector: Peter Hyams \nProducer: Moshe Diamant, Rudy Cohen \n","torrent":{"xt":"urn:btih:bb0f1f263a57eea94152a81b41507dc30709eec4","amp;dn":"The+Musketeer-%28Dvd2002%29Catherine+Deneuve%2C+Tim+Roth","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bb0f1f263a57eea94152a81b41507dc30709eec4","infoHashBuffer":{"type":"Buffer","data":[187,15,31,38,58,87,238,169,65,82,168,27,65,80,125,195,7,9,238,196]},"announce":[],"urlList":[]}}