{"title":"Tom Baker - Who On Earth Is Tom Baker?  (Abridged)","uid":7004409,"size":229079015,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:be13b3afd72fba1860cadb6b6d96eabd777b4ebe&amp;dn=Tom+Baker+-+Who+On+Earth+Is+Tom+Baker%3F++%28Abridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Lucybabe","files":6,"time":1328213133,"description":"Tom Baker - Who On Earth Is Tom Baker? (Abridged - Read By Tom Baker) (1997 HarperCollins Audiobooks)\n\n\n\nYou won't have to hide behind the sofa while listening to this tape... Imagine a cross between Spike Milligan, Peter Ustinov and David Niven and you're some way to imagining the writings of Tom Baker.\n\nAfter an Irish Catholic childhood, God service, National Service and a spell in the Merchant Nave, Tom Baker became an actor. Widely experienced in film, theatre and on television, he is most well known, in sixty-eight countries, for the portrayal of Doctor Who. To Many, he is the ultimate Doctor Who.\n\nFar excedding the usual expectations of an actorly autobiography, Who on Earth is Tom Baker? is a richly coloured, startlingly wild black comedy. Tom Baker is the kind of man who could drink the old off-the-wagon Anthony Hopkins under the table and who now spends much of his leisure time mowing the grass around his own gravestone in the local churchyard. His memoirs are full of anarchic humour with surreal, ribald and revealing anecdotes.\n\nRead By Tom Baker\n\nAbridged\n\nTrack listing\n\n1. Side One\n2. Side Two\n3. Side Three\n4. Side Four\n\nRecorded using Adobe Audition 3.0 at 32-96 kHz from the original cassettes. Tapes restored using Adobe Audition 3.0 and DeNoise.\n\nConverted to MP3 192Kbps in slow (high quality) mode using dBpoweramp.","torrent":{"xt":"urn:btih:be13b3afd72fba1860cadb6b6d96eabd777b4ebe","amp;dn":"Tom+Baker+-+Who+On+Earth+Is+Tom+Baker%3F++%28Abridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be13b3afd72fba1860cadb6b6d96eabd777b4ebe","infoHashBuffer":{"type":"Buffer","data":[190,19,179,175,215,47,186,24,96,202,219,107,109,150,234,189,119,123,78,190]},"announce":[],"urlList":[]}}