{"title":"La croissance économique de la Suisse","uid":12483577,"size":2392339,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bedfe48e3de613386875d4843dcecbdc3e6d2e01&amp;dn=La+croissance+%26eacute%3Bconomique+de+la+Suisse&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"asperge","files":4,"time":1443087902,"description":"Michel Piccand, &quot;La croissance économique de la Suisse, un drame politique caché&quot;\r\nPublisher: Adimante | 2015 | ISBN: N/A | French | EPUB/AZW3/MOBI/PDF | 287/230 pages | 0.3/0.5/0.4/1.2 Mb\r\n\r\nCe premier tome offre une plongée inédite dans les rouages politico-économiques de la Suisse. Il devrait faire date dans l'histoire politique de ce pays. Ici pas question de secret bancaire ou de francs suisses mais la description économique d'un peuple que ses politicien-ne-s mènent par le bout du nez. Le détail de mensonges à répétition avec lesquels on le trompe sur sa réalité politique, sur les effets économiques des accords qu'on lui fait signer avec l'UE, et dont il découvre désagréablement surpris qu'ils sont en train de détruire son niveau de vie. Ce livre est construit à la fois comme un rapport et une description de l'économie helvétique, mais il s'agit d'un réquisitoire contre la classe politique majoritaire de ce pays qui ne cesse de mentir à son peuple depuis plus de vingt ans. Nul doute que beaucoup de citoyens européens s'y reconnaîtront. Ecrit spécifiquement suisse, ce livre intéressera toutefois les citoyens français et européens qui aimeraient en savoir plus sur ce pays qui paraît-il réussit mieux que les autres, alors que dans les faits il est en train de se saborder et de détruire ses actifs dans une proportion jamais vue. Ils découvriront comment cette Suisse s'est jetée toute seule et sans réfléchir dans la même impasse qui pose problème à la France : cette ultra-compétitivité allemande qui est en train de mettre en concurrence tous les systèmes sociaux et les êtres humains de l'Europe. Une leçon de chose magistrale qui décrit cette Union Européenne néo-libérale qui sans scrupule ni égard pour les populations les prend comme des pions et détruit tout ce qu'elle touche, détruit les équilibres des uns et des autres, pour un profit dont beaucoup ne verront jamais la couleur. La spécificité de la Suisse, sa démocratie directe, y montrent alors ces mécanismes sous un angle aigu et particulier, avec une distance critique que n'ont sans doute plus les Etats membres. La Suisse telle que les Européens l'ont vue et imaginée, ces qualités qu'on lui reconnaissait, sont déjà en train de disparaître. C'est un signe avant-coureur que les citoyens d'Europe auraient tort de négliger. La disparition de la seule démocratie directe de ce continent n'a certainement rien d'anodin. Le modèle suisse était fondamentalement libéral, la liberté et la sécurité de l'individu des valeurs intouchables, dans 20 ans tout cela aura disparu, les principes européens de concurrence importés en Suisse par les partis politiques proches de l'Etat et des multinationales auront tout laminé. La liberté et l'indépendance des citoyens sacrifiées au modèle néocolbertiste de l'Union européenne, un Etat tout puissant allié aux multinationales qui ensemble se servent des populations et de leurs actifs. Ce n'est pas ainsi que les Suisses imaginaient leur pays","torrent":{"xt":"urn:btih:bedfe48e3de613386875d4843dcecbdc3e6d2e01","amp;dn":"La+croissance+%26eacute%3Bconomique+de+la+Suisse","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bedfe48e3de613386875d4843dcecbdc3e6d2e01","infoHashBuffer":{"type":"Buffer","data":[190,223,228,142,61,230,19,56,104,117,212,132,61,206,203,220,62,109,46,1]},"announce":[],"urlList":[]}}