{"title":"Three Famous Five Mysteries - Enid Blyton","uid":11684597,"size":284279805,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:bf45b8fa950e58f082e7fd8350b7266b635e023d&amp;dn=Three+Famous+Five+Mysteries+-+Enid+Blyton&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"davieboy1966","files":15,"time":1423265123,"description":"Audio Books : Childrens : Other quality : English\n\n\nUnabridged and recorded at 48 kbps / 44 kHz CBR Mono MP3.\nSupplied from eDownload by Coolpost. These are near CD quality replacements for my cassette versions that were part of my Complete Famous Five series posted here in October 2014.\n\n\nJan Francis reads all three titles. Many thanks to Coolpost for the original copies.\n\n\n\nEnid Blyton's &quot;The Famous Five&quot; find adventure wherever they go. Julian, Dick, Anne, George and Timmy the dog always have a mystery to solve!\n\n\nBook 7. Five Go Off to Camp (1948.) FIXED\nSpook trains in the middle of the night! And they seem to vanish into thin air, but where do they go? The Famous Five are on to it. But the discovery of an unusual underground tunnel system, and a train-service, has them puzzled. If they follow the tracks, will they solve the mystery?\n\nBook 10. Five On a Hike Together (1951)\nDick is puzzled when he's woken by a light flashing through his window. Is someone trying to send him a coded message? And when the Famous Five hear of an escaped convict in the area, they are on red alert. The police won't help, so the Five have no choice but to solve the mystery alone.\n\nBook 15. Five On a Secret Trail (1956)\nCamping again! This time the Five have pitched their tent near an old ruined cottage, which looks as though it's been abandoned for years. When Anne hears strange noises at night the others don't believe her...until they see ghostly lights. Could the cottage be haunted?\n\n\nNOTE: This is a repost of my previous torrent as JakeTucker has alerted me to a problem with book 7. (Books 10 and 15 are not affected).\nA couple of small sections of book 7 have been recorded over with another program. My initial spot checking failed to discover this issue.\nPart 1 of Book 7 has now been patched with 20 seconds from the cassette version near 13:30 and part 5 of book 7 is now patched with 6 seconds from the cassette version near 20:40.\n\nFortunately the problems were not in important parts of the story. Thanks Jake.\n\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:bf45b8fa950e58f082e7fd8350b7266b635e023d","amp;dn":"Three+Famous+Five+Mysteries+-+Enid+Blyton","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf45b8fa950e58f082e7fd8350b7266b635e023d","infoHashBuffer":{"type":"Buffer","data":[191,69,184,250,149,14,88,240,130,231,253,131,80,183,38,107,99,94,2,61]},"announce":[],"urlList":[]}}