{"title":"Auto Debug Professional v5.7.2.18 Including Crack [iahq76]","uid":7777777,"size":4308434,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c04aae523b50a15e6ab0687f3c3ab8e2621a1440&amp;dn=Auto+Debug+Professional+v5.7.2.18+Including+Crack+%5Biahq76%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TorDigger","files":3,"time":1351699099,"description":"Auto Debug Professional\n\nAuto Debug is a Windows API monitoring tool. It can be used to automatically trace calls to all functions exported by the shared libraries linked to a running process, including COM interfaces such as ActiveX. During tracing, all input and output parameter values are recorded, and memory dumps are generated to show the values referenced by the pointer-type arguments.\n\nUnlike other call tracers, such as API Spy or API Monitor, Auto Debug does not require the user to develop any hooks or custom DLLs. It is very easy to use: just specify the command line-parameters to invoke a program (or attach Auto Debug to a program that is already running), select which API calls to monitor, and you will receive a detailed trace of all selected calls.\n\nWhen available, the PDB files corresponding to the DLLs being traced are automatically analysed, resulting in more detailed and easier-to-navigate traces. Alternatively, in the absence of the original PDB files, the Professional version of Auto Debug can generate sufficiently detailed PDB files from the prototype headers often distributed with some libraries (for example, see the PDB file generated for comdlg32.dll at $InstallPathPDBsample).\n\nFeatures\n\nIt doesn't need to rebuild the source code while monitoring inputting parameters and outputting results of the traced APIs in the target program automaticly, only monitoring the input and output of APIs.\n\nExport monitor result as txt format.\nUse VBScript or JScript to control Auto Debug.\nSource Code level monitor.\nAutomatic analysis parameter type with PDB files.\nVery easy to generate PDB files without source code if you know the api prototype.\nTracing your application with release version.\nThe best API monitor tool.\nTracing Release version with mapfile.\nSupporting Debug version and Release version, not need source code.\nSupporting tracing COM Interface.\nSupporting multithread.\nNot need to know the prototype of the functions.\nNot only trace for exported APIs, but also be effect for undocumented APIs.\n\nSupported OS:\n\nWindows 7/vista/xp\n\nHomepage: http://www.autodebug.com/\n\nInstallation Instructions:\n\n1. Install program.\n2. Copy content from crack folder and paste into default installation directory.\n3. Done, Enjoy.","torrent":{"xt":"urn:btih:c04aae523b50a15e6ab0687f3c3ab8e2621a1440","amp;dn":"Auto+Debug+Professional+v5.7.2.18+Including+Crack+%5Biahq76%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c04aae523b50a15e6ab0687f3c3ab8e2621a1440","infoHashBuffer":{"type":"Buffer","data":[192,74,174,82,59,80,161,94,106,176,104,127,60,58,184,226,98,26,20,64]},"announce":[],"urlList":[]}}