{"title":"(Blues) Rocky Hill - Texas Shuffle","uid":6833145,"size":92939037,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c1059789ad2b086b03bd12eaadd0e79c0ceebf21&amp;dn=%28Blues%29+Rocky+Hill+-+Texas+Shuffle&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"nightissuchproximity","files":-1,"time":1321935298,"description":"Bitrate: 320K/s \nTime: 38:40 \nSize: 88.5 MB \nLabel: Tomato\nStyles: Electric Texas blues, Modern electric blues\nYear: 2003 \nArt: Front \n\n[0:49] 1. Rock n' Roll\n[5:39] 2. Hootchie Cootchie Man\n[2:56] 3. Future Blues\n[4:17] 4. Fool For You\n[2:48] 5. Bad Girl Blues\n[2:30] 6. Blood Stream\n[3:24] 7. My Guitar\n[2:59] 8. Gimme the Gun\n[3:24] 9. Young Man\n[2:26] 10. Yes Indeed\n[2:10] 11. Preaching Blues\n[5:12] 12. Red Rooster Jam\n\n\nWhen Rocky Hill's Tomato Records debut appeared in 1982, he was out of step in a sense, and out of time. Had he showed up a year or so later he could have challenged fellow Texas bluesman Stevie Ray Vaughan for the title; Vaughan would have won, but it would have been a hell of a battle. Hill is a Texas bluesman who walks the line between T-Bone Walker, Lightnin' Hopkins, Albert King, and Johnny Winter -- who plays on this record along with Dr. John, the Leon Russell Singers, and the Muscle Shoals Horns. Hill and Winter blaze on their guitars, Dr. John handles the keyboard chores and acts as music director, and Kevin Eggers handles the production chores on a set of screaming, razor-edged blues-rockers like Willie Dixon's &quot;Hootchie Cootchie Man,&quot; &quot;Preaching Blues,&quot; and a jam based on &quot;Little Red Rooster.&quot; As for the originals, Hill's songs are not memorable, but his playing and singing are. On &quot;Rock 'n' Roll&quot; (what an original title), his gruff wailing voice is matched by a knife-edged guitar that growls, roars, and sets fire against Winter's. &quot;Bad Girl Blues&quot; is a moaning blues with wonderful interplay in the bridge and a sharp, pointed piano solo by Dr. John. The addition of Leon Russell's backing vocalists is a real treat; they add emotional depth to what would otherwise be just a barroom affair. They bring soul and a gospel feel to even the raunchiest of blues-rockers. \n\nWhile there is no ground broken here, none is lost either. This blows away run-of-the-mill blues-rock by an exponent of ten, and keeps the home fires burning for a return to tradition without giving up the volume.\n\n\n","torrent":{"xt":"urn:btih:c1059789ad2b086b03bd12eaadd0e79c0ceebf21","amp;dn":"%28Blues%29+Rocky+Hill+-+Texas+Shuffle","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c1059789ad2b086b03bd12eaadd0e79c0ceebf21","infoHashBuffer":{"type":"Buffer","data":[193,5,151,137,173,43,8,107,3,189,18,234,173,208,231,156,12,238,191,33]},"announce":[],"urlList":[]}}