{"title":"Human Interactions with the Geosphere","uid":6517749,"size":4063940,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c2fafa0e6884adfa11a0f82856c102a5fedcf5ea&amp;dn=Human+Interactions+with+the+Geosphere&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"_F1_","files":-1,"time":1309887584,"description":"Lucy Wilson, &quot;Human Interactions with the Geosphere: The Geoarchaeological Perspective - Special Publication 352 (Geological Society Special Publication)&quot;\n Publisher: Geological Society Of London | 2011 | ISBN: 1862393257 | PDF | 208 pages | 7.1 MB\n\n Human impact on our environment is not a new phenomenon. For millennia, humans have been coping with - or provoking - environmental change. We have exploited, extracted, over-used, but also in many cases nurtured, the resources that the geosphere offers. Geoarchaeology studies the traces of human interactions with the geosphere and provides the key to recognizing landscape and environmental change, human impacts and the effects of environmental change on human societies.\n\n This collection of papers from around the world includes case studies and broader reviews covering the time period since before modern human beings came into existence up until the present day. To understand ourselves, we need to understand that our world is constantly changing, and that change is dynamic and complex. Geoarchaeology provides an inclusive and long-term view of humangeosphere interactions and serves as a valuable aid to those who try to determine sustainable policies for the future.\n\n The Geological Society of London\n\n Founded in 1807, the Geological Society of London is the oldest geological society in the world, and one of the largest publishers in the Earth sciences.\n\n The Society publishes a wide range of high-quality peer-reviewed titles for academics and professionals working in the geosciences, and enjoys an enviable international reputation for the quality of its work.\n\n The many areas in which we publish in include:\n\n -Petroleum geology\n -Tectonics, structural geology and geodynamics\n -Stratigraphy, sedimentology and paleontology\n -Volcanology, magmatic studies and geochemistry\n -Remote sensing\n -History of geology\n -Regional geology guides","torrent":{"xt":"urn:btih:c2fafa0e6884adfa11a0f82856c102a5fedcf5ea","amp;dn":"Human+Interactions+with+the+Geosphere","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2fafa0e6884adfa11a0f82856c102a5fedcf5ea","infoHashBuffer":{"type":"Buffer","data":[194,250,250,14,104,132,173,250,17,160,248,40,86,193,2,165,254,220,245,234]},"announce":[],"urlList":[]}}