{"title":"Jet - Are You Gonna Be My Girl (2nafish)","uid":5794293,"size":127418372,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:c3f69a81ee2113e01bb198a6236cf2f4f9264dfb&amp;dn=Jet+-+Are+You+Gonna+Be+My+Girl+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1282987626,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Are You Gonna Be My Girl&quot; is a song by the Australian rock band Jet, featured on their 2003 album Get Born. It was the first single from the album, released in 2003 in Australia and the UK, and in 2004 in the United States. Written by Nic Cester &amp; Cameron Muncey, the song is often cited for similarities to Iggy Pop's &quot;Lust for Life&quot; and The White Stripes's &quot;Screwdriver&quot;. However, the beat has been found to have been common in numerous 60s' Motown songs, including &quot;I'm Ready For Love&quot; by Martha And The Vandellas and &quot;You Can't Hurry Love&quot; by The Supremes.\n\nChris Cester responded to the media debacle, stating in a Jared Story interview that the beat was taken from Motown, referring to a meeting between Iggy Pop and himself:\n\n&quot;It's funny because I asked him point blank about that. He said I was crazy. He said that when he and David Bowie were writing &quot;Lust for Life&quot;, they were ripping off Motown's beat. It's funny that he said that to me because we also thought we were ripping off Motown more than &quot;Lust for Life&quot;. To be honest with you that kind of annoyed me a lot, because I always thought it was really lazy. People just go well Lust for Life is more well-known so that's what they go for, but if you listen to a song like &quot;You Can't Hurry Love&quot; (The Supremes) I think you'll find its closer to &quot;Are You Gonna Be My Girl&quot; than &quot;Lust for Life&quot; ever was. And that's what Iggy said as well.&quot; \n\nThe music video is shot in black and white, and shows Jet performing in a blank studio. As they play, black ink starts pouring out of their equipment and forms a landscape resembling the cover art on their album Get Born and The Beatles album Revolver. The video was shot at Vinopolis, London. Note that in the video Nic Cester can be seen wearing an AC/DC shirt.\n\nThe song peaked at #20 on the Australian ARIA Singles Chart, while in the UK Singles Chart  it first appeared on the charts at #23. The single was re-released in the UK in 2004, after it was featured on advertisements for the Apple iPod, and this time reached #16 on the charts. It also gave the band success in the U.S. Billboard Hot 100 Singles Chart, peaking at #29. In the U.S., the song also hit #3 on the Modern Rock Tracks chart and #7 on the Mainstream Rock Tracks chart. The song also reached #1 on Australian youth radio station Triple J's Hottest 100 in 2003.\n\nThe song has been featured in numerous other media, including the feature films EuroTrip (2004), The Longest Yard (2005), Flushed Away (2006), The Holiday (2006) and What Happens in Vegas (2008); episodes of the television shows Scrubs, My Name Is Earl, One Tree Hill, Zoey 101, Tru Calling; and appeared as a playable track in video games Rock Band, SingStar Rocks!, Guitar Hero: On Tour, Rock Revolution, Madden NFL 2004, Taiko: Drum Master (Taiko No Tatsujin), and as downloadable content in Samba de Amigo for Wii.\n\nIt was also used in advertisements for several commercials, including Apple's iPod, Vodafone's Live! range, Budweiser, and Blue1. Wrestler Victoria Crawford used the song as her entrance theme in Ohio Valley Wrestling. It is also the opening theme for the British stand-up comedy programme Live at the Apollo.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:c3f69a81ee2113e01bb198a6236cf2f4f9264dfb","amp;dn":"Jet+-+Are+You+Gonna+Be+My+Girl+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c3f69a81ee2113e01bb198a6236cf2f4f9264dfb","infoHashBuffer":{"type":"Buffer","data":[195,246,154,129,238,33,19,224,27,177,152,166,35,108,242,244,249,38,77,251]},"announce":[],"urlList":[]}}