{"title":"Agnitum Outpost Security Suite Free 7.1","uid":6362358,"size":99336928,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c69863d63b6396a14ca664a2deb4aa299a956e8a&amp;dn=Agnitum+Outpost+Security+Suite+Free+7.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"freeware-uploads","files":-1,"time":1304380420,"description":"-INFO-\n\nAnti-virus, firewall, anti-spam, and more for all-round proactive protection that's totally free. All-in-one online and offline malware defense and powerful data leak prevention combine to deliver robust, bullet-proof security for individuals and families. \n\nVersion 7 contains System Guard to protect your operating system against hijacking. The anti-malware technology has received Virus Bulletin's acclaimed VB100 awards multiple times, which tells you can be confident that the software is well-equipped to detect and remove in-the-wild malware. The personalized anti-spam incorporates both traditional spam filtering criteria such as white- and black lists and keyword filtering. \n\nAgnitum's performance-driven security is lightweight and doesn't slow your computer down; it is even suitable for netbook and other low-end PCs. The SmartScan3 optimization boosts subsequent scan speed and overall system responsiveness. The new data filtering optimization delivers increased performance for the firewall module, further reducing resource usage.\n\nNo matter your level of expertise, Outpost Security Suite Free will meet your needs with automatically-applied anti-malware updates as well as real-world security policies from the ImproveNet user collaboration network. This unique system automatically configures and applies rules that govern how various applications on the PC access the Internet based on extensive default settings for the most popular software packages. This relieves users of the need to correctly configure Outpost to handle different programs. \nOSS Free is the first completely free fully-functional security suite, setting a new standard for basic protection. Opposite to proactive protection systems that are ready only to prevent from infection, Outpost Free is fine with virus removal.\n\n\n----------------------------------\n\nOutpost Security Suite Free can be used during 2 days without registration. After this period the product should be registered with a FREE key. Outpost will provide you with instructions on how to get a FREE key.\n\n----------------------------------\n\nWhat's new in this version: Some registration keys were not accepted; incompatibility issues with OS optimization utilities are fixed; most commonly reported crashes are fixed; more minor and interface issues.\n\n----------------------------------\n\nOperating system: Windows XP/Vista/7 \n","torrent":{"xt":"urn:btih:c69863d63b6396a14ca664a2deb4aa299a956e8a","amp;dn":"Agnitum+Outpost+Security+Suite+Free+7.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c69863d63b6396a14ca664a2deb4aa299a956e8a","infoHashBuffer":{"type":"Buffer","data":[198,152,99,214,59,99,150,161,76,166,100,162,222,180,170,41,154,149,110,138]},"announce":[],"urlList":[]}}