{"title":"MacPilot v 4.3 pre[K]racked","uid":6613241,"size":12953920,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:c7194e4c5f037d61398b1bf2aada4f83ba7ecfb1&amp;dn=MacPilot+v+4.3+pre%5BK%5Dracked&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"polisdavid","files":-1,"time":1313673420,"description":"Official Web Site: &lt;a href=&quot; http://www.koingosw.com/products/macpilot.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.koingosw.com/products/macpilot.php&lt;/a&gt;\n\nMacPilot can enable and disable hidden features in Mac OS X, optimize and repair your system, and perform numerous routine maintenance operations with the click of a button!\n\nPro user or not, you can now increase computer performance with only a few clicks of the mouse. Optimize your network for broadband connectivity, completely customize Apple File Sharing, perform essential maintenance without having to remember mind boggling acronyms, and much more. However, those are just a few of the many reasons why MacPilot is your choice over Cocktail, TinkerTool and Onyx.\n\nEnable the &quot;cut&quot; option in the Finder, disable menu items for security, disable icon caches, set history limits, erase recently used files, prevent your dock from being modified, turn off all system animations, increase the speed at which windows resize, change which format screenshots are taken in, set a default name and location for screenshots, disable a secondary processor, the startup chime, and even change the login window picture. Over 900 features in total!\n\nWhat's New\n\n* New Feature: Login Window: General: Desktop Picture\n\n* New Feature: Login Window: General: Desktop Picture Reset\n\n* New Feature: Mail: General: Disable send and reply animations\n\n* New Feature: Mail: General: Disable reply animation\n\n* New Feature: System: Behavior: Allow &quot;Don't Save&quot; Command-D in\n  save dialogs\n\n* New Feature: System: Behavior: Character accent menu\n\n* New Feature: Safari: &quot;Resume&quot; Safari when it is relaunched\n\n* New Feature: QuickTime Player: &quot;Reusme&quot; QuickTime Player when\n  relaunching\n\n* New Feature: Preview: &quot;Resume&quot; Preview on relaunch\n\n* New Feature: System: Appearance: Window zoom animations when\n  opening\n\n* New Feature: Toggle visibility of Library folder.\n\n* Bug Fix: Special commands that require admin (gold icon) permissions\n  now request admin auth to set.\n\n* Bug Fix: Numerous fixes for Mac OS X 10.7 Lion.\n\n* Bug Fix: Fixed typo in system information tab.\n\n* Bug Fix: Fixed the startup options to allow setting a normal boot\n  mode.\n\n\nMore info: http://www.koingosw.com/products/macpilot.php\n\nSystem Requirements:\n\nPPC / Intel, Mac OS X 10.5 or later.\n\n--- PLEASE SEED ---","torrent":{"xt":"urn:btih:c7194e4c5f037d61398b1bf2aada4f83ba7ecfb1","amp;dn":"MacPilot+v+4.3+pre%5BK%5Dracked","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c7194e4c5f037d61398b1bf2aada4f83ba7ecfb1","infoHashBuffer":{"type":"Buffer","data":[199,25,78,76,95,3,125,97,57,139,27,242,170,218,79,131,186,126,207,177]},"announce":[],"urlList":[]}}