{"title":"Designing Next Generation Web Projects with CSS3","uid":8185329,"size":29964397,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c7c55e99b4f1c59eee52fa625ff87e82cca2edd8&amp;dn=Designing+Next+Generation+Web+Projects+with+CSS3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2010kaiser","files":-1,"time":1361712810,"description":"            Designing Next Generation Web Projects with CSS3-2010kaiser\n            ===========================================================\n\n\nCSS3 unveils new possibilities for frontend web developers: things that would require javascript, such as animation and form validation, or even third party plugins, such as 3D transformations, are now accessible using this technology.\n&quot;Designing Next Generation Web Projects with CSS3&quot; contains ten web projects fully developed using cutting edge CSS3 techniques. It also covers time saving implementation tips and tricks as well as fallback, polyfills, and graceful degradation approaches.This book draws a path through CSS3; it starts with projects using well supported features across web browsers and then it moves to more sophisticated techniques such as multi polyfill implementation and creating a zooming user interface with SVG and CSS.\nReact to HTML5 form validation, target CSS rules to specific devices, trigger animations and behavior in response to user interaction, gain confidence with helpful tools like SASS, learn how to deal with old browsers and more.\n&quot;Designing Next Generation Web Projects with CSS3&quot; is a helpful collection of techniques and good practices designed to help the implementation of CSS3 properties and features.\nWhat you will learn from this book:\nStyle form fields in response to their validation stage\nCreate realistic buttons enhanced with data-* attributes with a single element\nDefine media queries that activate CSS rules on specific device properties\nCode a complete image slider with multiple transition effects without using javascript\nImplement CSS3 features like border-radius and transform on old browsers using polyfills\nCreate a parallax effect by taking advantage of 3D transforms\nUse the new pseudo-selectors to respond to user interaction\nApply effects to HTML5 videos such as blur and grayscale using CSS filters and SVG\nWho this book is for:\n\nThis book is designed for you if you are a frontend web developer; it requires a solid knowledge of CSS syntax and of the most common CSS2 properties and selectors.\n\nTitle: Designing Next Generation Web Projects with CSS3\nAuthor: Sandro Paganotti\nPublisher: Packt Publishing\nYear: 2013\nFormat: PDF - EPUB - MOBI\n\n\n\n\n2010kaiser home page at The Pirate Bay link below:\n\n  &lt;a href=&quot;\nhttp://thepiratebay.se/user/2010kaiser/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2010kaiser/&lt;/a&gt;\n\n\nCheck out the new PirateWiki! Where knowledge is shared ;-)\n\n           &lt;a href=&quot;\nhttps://forum.suprbay.org/wiki/index.php?title=Portal:Main_Page&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/wiki/index.php?title=Portal:Main_Page&lt;/a&gt;\n\n\nFor re-seed requests, help, support or anything else relating to The Pirate Bay. You'll find it all, and more, at suprbay. The official support forum of The Pirate Bay. Visit it at the link below:\n\n  &lt;a href=&quot;\nhttps://forum.suprbay.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/&lt;/a&gt; \n\n\nENJOY AND SEED!!!","torrent":{"xt":"urn:btih:c7c55e99b4f1c59eee52fa625ff87e82cca2edd8","amp;dn":"Designing+Next+Generation+Web+Projects+with+CSS3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c7c55e99b4f1c59eee52fa625ff87e82cca2edd8","infoHashBuffer":{"type":"Buffer","data":[199,197,94,153,180,241,197,158,238,82,250,98,95,248,126,130,204,162,237,216]},"announce":[],"urlList":[]}}