{"title":"J.Komuda - Samozwaniec. Tom 1 [PL]","uid":12857330,"size":624932256,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:c85683aacd3761e7062b3a7fcf6eeb9f75a6c35d&amp;dn=J.Komuda+-+Samozwaniec.+Tom+1+%5BPL%5D+MP3%4096&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"everdarksoul","files":37,"time":1448689035,"description":"Audiobook PL - Jacek Komuda: cykl &quot;Orły na Kremlu&quot; - część 1: Samozwaniec. (Tom I)\r\nDane: 595 MB / 34x    Kbps / czas: 14:25:42 / czyta: Leszek Filipowicz\r\n\r\nJacek Komuda jest przede wszystkim autorem powieści i opowiadań historycznych, osadzonych głównie w realiach Polski sarmackiej - choć nie tylko: autor zaliczany jest także do pisarzy tworzących fantastykę, ma też na swoim koncie wydawnictwo popularnonaukowe. Karierę pisarską rozpoczął w 1999 &quot;Opowieściami z Dzikich Pól&quot;. Wcześniej jescze zadebiutował na łamach 'Fantastyki&quot; opowiadaniem &quot;Czarna Cytadela&quot;. Od 2002 związany jest z lubelskim wydawnictwem Fabryka Słów, w którym opublikował dotąd około dwudziestu książek.\r\nBohaterem wielu jego opowiadań i powieści jest Jacek Dydyński - małopolski szlachcic-awanturnik. W 2009, Komuda rozpoczął cykl powieściowy pt. &quot;Orły na Kremlu&quot; - którego głównym bohaterem jest właśnie Dydyński, a akcja dzieje się podczas wyprawy Dymitra Samozwańca na Moskwę, w latach 1604-1606. Cztero-tomowy &quot;Samozwaniec&quot; jest pierwszą częścia tegoż cyklu.\r\n\r\nRok 1605. Polskie wojska wkraczają do Moskwy... Fantastyka...? Nie - to &quot;najprawdziwsza&quot; prawda historyczna!\r\n&quot;Samozwaniec&quot; jest opowieścią o największej awanturniczej wyprawie Polaków - porównywalnej chyba jedynie z podbojami hiszpańskich konkwistadorów - opowieść o wyprawie po Koronę Carów Moskwy, zwanej Trzecim Rzymem.\r\nTo również opowieść o zderzeniu dwóch światów: wyrosłej na gruncie Wolności Szlacheckiej Rzeczypospolitej i ksenofobicznej Moskwy - odgrodzonej od Europy murem prawosławia...\r\nJest to też opowieść o fenomenie husarii i wojsk polskich w ogóle - zwyciężających na mroźnych stepach i lodowych pustkowiach Rosji, gdzie wieki później klęskę poniosły armie niekwestionowanych hegemonów Europy - Napoleona i Hitlera... Ze wszystkich Narodów z którymi Rosja toczyła wojny, tylko Polacy swego czasu PRAWDZIWIE zajęli Kreml - z czym Rosjanie chyba nigdy się nie pogodzili, a cień tamtych wydarzeń obecny jest we wzajemnych stosunkach nawet do dziś...\r\n\r\ncykl Orły na Kremlu:\r\n1 - Samozwniec (4 tomy)\r\n2 - Moskiewska Ladacznica\r\n3 - Car z Żelaza\r\n\r\n\r\n\r\ndod.info:\r\nOstatnia (4) część &quot;Samozwańca&quot; w audio, zawierać będzie dodatkowo komplet w e-book, format PDF, jakość bdb","torrent":{"xt":"urn:btih:c85683aacd3761e7062b3a7fcf6eeb9f75a6c35d","amp;dn":"J.Komuda+-+Samozwaniec.+Tom+1+%5BPL%5D+MP3%4096","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c85683aacd3761e7062b3a7fcf6eeb9f75a6c35d","infoHashBuffer":{"type":"Buffer","data":[200,86,131,170,205,55,97,231,6,43,58,127,207,110,235,159,117,166,195,93]},"announce":[],"urlList":[]}}