{"title":"MacFile-Native.Instruments.Akoustik.Piano.v1.1.1.007.VSTi.RTAS.A","uid":4019959,"size":87517679,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:c9c707bd2619f763e78a0bc36c86aa937cb02a89&amp;dn=MacFile-Native.Instruments.Akoustik.Piano.v1.1.1.007.VSTi.RTAS.A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gatoboy","files":1,"time":1202610782,"description":"Native.Instruments.Akoustik.Piano.v1.1.1.007.VSTi.RTAS.AU            \n                          UPDATE.MAC.OSX.UB-DYNAMiCS                \n\nGrand Slam\n     \n     AKOUSTIK PIANO fuses the sampled sound, expressiveness and playability\n     of three of the most reputable grand pianos - the Steinway , Bechstein\n     D 280 and Boesendorfer 290 Imperial - as well as the charismatic\n     Steingraeber 130 vintage upright piano into one application. AKOUSTIK\n     PIANO covers the entire range of piano sounds and styles, transfusing\n     the sonic characteristics and subtle tonal nuances of all four into\n     your computer - the perfect complement for studios, rehearsal rooms,\n     schools, stages and clubs.\n      \n     \n     Under The Lid\n     \n     AKOUSTIK PIANO is the new benchmark in sound quality, capturing the\n     full body and feel of the originals with unprecedented authenticity.\n     The latest recording technology as well as a specially developed\n     microphone setup was used for all 4 pianos. The result is a uniquely\n     warm, transparent and flexible sound that delivers the same\n     distinctive character of each individual piano in exacting detail and\n     can still be adjusted to meet specific needs.\n     \n     \n     Intelligent Ivory\n     \n     AKOUSTIK PIANO plays and responds exactly as real pianos do. The keys\n     were sampled at varying velocities and great care was taken to capture\n     the entire sustain and release phases. The brand new Layer Morphing\n     Technology generates a seamless dynamic gradient. The characteristic\n     resonances caused by use of the pedals can be adjusted as can the\n     subtle mechanical noises of the pedals and keys themselves. From\n     perfect pianissimo to forceful fortissimo, this instrument delivers\n     the same breadth and depth of tone as the originals.\n     \n     \n     Enchanting Ebony\n     \n     AKOUSTIK PIANO has a first-class integrated convolution module,\n     allowing highly authentic spatial characteristics to be added to the\n     sound. Place the piano in a studio, jazz club, concert hall and a\n     cathedral or use the dry signal as it is. The acoustic parameters of\n     these spaces, such as the size, can also be manipulated. From the\n     close mic setup of a jazz combo to the more ambient nature of classic\n     solo performance, AKOUSTIK PIANO covers the whole spectrum. \n     \n     \n     Top Features\n     \n     * Three famous grand pianos and one upright piano \n     * Exceptionally high sound quality including complete sustain and  \n       release phase \n     * Extremely intuitive and clearly structured user interface \n     * Integrated convolution module delivers controllable acoustics for  \n       four distinctive rooms: studio, jazz club, concert hall and  \n       cathedral \n     * Sophisticated and authentic emulation of the soft, sustenuto and  \n       sustain pedals \n     * Layer Morphing Technology ensures a consistent timbre and seamless  \n       velocity gradient \n     * Highly advanced audio engine including Direct from Disk (DfD)  \n       functionality \n     * Adjustable string resonance and mechanical noises of pedals and keys\n     * Integrated metronome, MIDI file player and recorder, export to WAV, \n       flexible 3-band EQ and various tunings \n     * Keyboard dynamic range and velocity curve allows response to be  \n       adjusted to different master keyboards \n     \n\n     System Requirements \n     \n     Mac OS 10.3.x, G4 1.2 GHz, 512 MB RAM, 15 GB free disk space\n     ","torrent":{"xt":"urn:btih:c9c707bd2619f763e78a0bc36c86aa937cb02a89","amp;dn":"MacFile-Native.Instruments.Akoustik.Piano.v1.1.1.007.VSTi.RTAS.A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9c707bd2619f763e78a0bc36c86aa937cb02a89","infoHashBuffer":{"type":"Buffer","data":[201,199,7,189,38,25,247,99,231,138,11,195,108,134,170,147,124,176,42,137]},"announce":[],"urlList":[]}}