{"title":"Michael Jackson  Who Killed The King Of Pop (2010) 2Lions-Team","uid":5417720,"size":3561193658,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:caab1424b69fd3621653ba7e8c12800db84a6d46&amp;dn=Michael+Jackson++Who+Killed+The+King+Of+Pop+%282010%29+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"LifeSux","files":-1,"time":1267983005,"description":"Michael Jackson - Who Killed The King Of Pop (2010) \n\nEnglish\n\nUnited states\nDocumentary / Biography\n70 minutes\n\nThis documentary offers a spectacular reconstruction of the last minutes before the tragic death of Michael Jackson on June 25, 2009. Who Killed the King of Pop begin at the moment, that one employee from the home of the pop star at 100 Carol Wood Drive in Los Angeles a 911 emergency call please. Jackson's personal physician Conrad Murray, now suspected of murder in the case of the deceased pop star, performs during this phone call, from a heart massage on Michael Jackson. Then unfolds to the viewer's eye and ear of the minutes for the panic scenario minutes. Furthermore, manyand fans come to the floor, which give an opinion on the events, including Diana Ross, Uri Geller, Elizabeth Taylor, brother Jermaine Jackson and daughter Paris Jackson. While the media is throwing around the increasing number of dead theories, speculations and conspiracies, in Who Killed the King of Pop made an attempt to unravel this mystery ...      \n\n\nVerenigde Staten\nDocumentaire/ Biografie\n70 minuten\n\nDeze spectaculaire documentaire biedt een reconstructie van de laatste minuten voor het dramatische overlijden van Michael Jackson op 25 juni 2009. Who Killed the King of Pop begint op het moment, dat een medewerker vanuit de woning van de popster aan 100 Carolwood Drive in Los Angeles een 911-noodoproep pleegt. Jackson's lijfarts Conrad Murray, nu verdachte van moord in de zaak rond de overleden popster, voert tijdens dit telefoongesprek, een hartmassage uit op Michael Jackson. Vervolgens ontvouwt zich aan het oog en oor van de kijker minuut voor minuut het paniekscenario. Voorts komen allerlei beroemdheden en fans aan het woord, die een mening geven over de gebeurtenissen, onder wie Diana Ross, Uri Geller, Elizabeth Taylor, broer Jermaine Jackson en dochter Paris Jackson. Terwijl de media zich uitput in het opvoeren van diverse doodstheorieÃƒÆ’Ã‚Â«n, speculaties en samenzweringen, wordt in Who Killed the King of Pop een poging gedaan om dit raadsel te ontrafelen...\nSpotinformatie \nCategorie : Beeld \nFormaat : DVD5 \nBron : Retai\nNEDERLANDSE RETAiL VERSiE\n\n\nSOORT DVD\n[X]DVD5 iSO/MDS FiLE\n\nViDEO\n[X]UNTOUCHED\n\nAUDiO\n[X][DD 5.1]ENGELS\n[X][DD 2.0]ENGELS\n\nONDERTiTELiNG RETAiL\n[X]NEDERLANDS\n\nMENU\n[X]JA\n-[X]ENGELS\n\nEXTRA'S\n[X]NiET AANWEZiG OP SOURCE\n\nCOVER\n[X]JA \n[X]ORiGiNELE COVER + LABEL AANWEZiG iN POST\n\n","torrent":{"xt":"urn:btih:caab1424b69fd3621653ba7e8c12800db84a6d46","amp;dn":"Michael+Jackson++Who+Killed+The+King+Of+Pop+%282010%29+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"caab1424b69fd3621653ba7e8c12800db84a6d46","infoHashBuffer":{"type":"Buffer","data":[202,171,20,36,182,159,211,98,22,83,186,126,140,18,128,13,184,74,109,70]},"announce":[],"urlList":[]}}