{"title":"Ocster Backup Pro 6.24 with KEYGEN","uid":6817783,"size":23577723,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:cac48be4b55ddd36e767034497d4ff7fa42bca6e&amp;dn=Ocster+Backup+Pro+6.24+with+KEYGEN&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"chami1988","files":-1,"time":1321286500,"description":"Like its predecessor, Ocster Backup Pro 6 continues the focus on being a fully automatic and easy to use backup solution, while at the same time improving in lots of areas. For example, Ocster Backup Pro 6 amazes with an up to 600% faster backup speed* compared to the previous version. In addition, new features like 1 to 1 File Copy, i.e. simple mirroring of files to other media without packing in archives, backup of Internet Explorer and Mozilla Firefox bookmarks, backup of the Windows contacts in Windows 7 and Vista and the ability for backing up emails and calendars from Microsoft Outlook and Mozilla Thunderbird impressively extend the feature set in Ocster Backup Pro 6.\n\nNew in Version 6:\nQuicker than ever - up to 600% faster backup speed*\n&quot;1 : 1 File Copy&quot; - simple mirroring of files to other media\nBackup of Internet Explorer bookmarks\nBackup of Mozilla Firefox bookmarks, settings and add-ons\nBackup of Mozilla Thunderbird emails, calenders, settings and add-ons\nBackup of Windows contacts\n&quot;New Backup-Rules&quot; More choice with extended filtering capabilities\n\nFeatures\nFully Automatic: Creates fully automatic backups of your data\nEasy to use\nFast backup speed\nIncludes alternative backup format: 1 : 1 File Copy - simple mirroring of files to other media\nInternet Explorer bookmarks\nMozilla Firefox: Backs up bookmarks, settings and add-ons\nMozilla Thunderbird: Backup emails, calenders, settings and add-ons\nWindows contacts: Backup the Windows Contacts folder.\n&quot;New Backup-Rules&quot; More choice with extended filtering capabilities\nVersioning: Easily access and restore different older versions of your files.\nAutomatic Pausing: Backups are done in the background and are automatically paused to prevent them from slowing down other programs. Various system characteristics are monitored, e.g. CPU usage, I/O usage, fullscreen applications, etc.\nOutlook/Thunderbird Support: Back up your Microsoft Outlook/Thunderbird emails and calendars with a single mouse click.\nStop &amp; Resume: Backups can be stopped and resumed. This is handy when the computer needs to be shut down, for example.\nBackup Reports: Detailed backup reports can be generated each time the backup is updated. The contents of the reports can be configured.\nBackup Report Emails: Backup reports can be automatically sent to an email address. That way you can be up-to-date on the state of your backups even when you are on a business trip or if the computer is simply a server in your attic.\nNetwork support: Files and folders on network drives can also be backed up. The backup data can also be stored on network drives if that is desired.\nEncryption: Backups are strongly encrypted and protected with a user password. The encryption algorithm can be configured, if that is desired.\nCompression: Backups are compressed intelligently to save space. Different compression types are available: from fast ones with moderate compression to slower ones with excellent compression.\nScheduled: Backups can be started either automatically at scheduled times or manually by clicking a button.\nStorage Types: Backups can be stored on hard disk, USB sticks, network drives and Ocster Secure Storage.\nSupports Ocster Secure Storage: \nStores the files in professional data centers\nMuch safer than using hard disks or USB sticks\nThe backups are protected against fire, water damage, lightning, theft, hurricanes, ...\nMultiple copies are kept in different locations\nThe data is transmitted to the data centers via a highly secured internet channel\nAvailable for a small subscription fee.\nIncremental backup: after an initial full backup only the changes to the previous state are stored. This saves space and reduces transfer times.\nOpen File Support: Files and folders that are in use can be backed up as well.\nHard Link and Symbolic Link Support: Hard links and symbolic links can be backed up and are properly restored as hard links and symbolic links.\nSpecial Files: Compressed, encrypted and sparse files can also be backed up.\nEncryption Algorithms: Backup can be encrypted the following algithms: AES 256 Bit, AES 128 Bit, BlowFish, Cast-128\nCompression Algorithms: The software supports the following compression types: ZLib, LZMA Quick, LZMA Normal, LZMA Best\nSmall File Optimization: Through smart uses of compression the software can achieve high compression rates, even with many small files.","torrent":{"xt":"urn:btih:cac48be4b55ddd36e767034497d4ff7fa42bca6e","amp;dn":"Ocster+Backup+Pro+6.24+with+KEYGEN","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cac48be4b55ddd36e767034497d4ff7fa42bca6e","infoHashBuffer":{"type":"Buffer","data":[202,196,139,228,181,93,221,54,231,103,3,68,151,212,255,127,164,43,202,110]},"announce":[],"urlList":[]}}