{"title":"The Electric Light Orchestra - Mr. Blue Sky (2nafish)","uid":5923569,"size":131520516,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:cb493e6e452e6dd84b67822debb3d768a09c3f43&amp;dn=The+Electric+Light+Orchestra+-+Mr.+Blue+Sky+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1288519145,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Mr. Blue Sky&quot; is a song by the rock group Electric Light Orchestra.\n\nThe song forms the fourth and last track on the &quot;Concerto for a Rainy Day&quot; suite on side three of the original two-LP set. The song was the third Hot 100 top 40 single to be taken from the album Out of the Blue. The single reached number 6 in the UK and number 35 in the USA. It was also released on special limited edition blue vinyl.\n\nJeff Lynne, who hid himself away to write enough material for a double album, wrote the track in Switzerland. After a two week period of writer's block dampened by the inclement weather outside, Lynne was suddenly inspired to write &quot;Mr. Blue Sky&quot; following a break in the weather when the entire area was bathed in sunshine, quickly followed by the remainder of the Out of the Blue songs including &quot;Concerto for a Rainy Day&quot;.\n\nThis song has the inspiration from The Beatles track A day in the life, from the middle section that Paul McCartney wrote.\n\nThe song was voted as Anthem of the Midlands beating other songs such as &quot;Come on Eileen&quot; and &quot;Stairway to Heaven&quot; and is played before each Birmingham City Football Club home game to honour Jeff Lynne for his lifelong support and his friendship with the former Blues football player Trevor Francis.\n\nOut of the Blue is the seventh studio album by the British rock group Electric Light Orchestra, released in October 1977. Written and produced by ELO frontman Jeff Lynne, the double album is among the most commercially successful records in the group's history.\n\nSide three of the release is subtitled &quot;Concerto for a Rainy Day&quot;, a four track musical suite based on the weather and how it affects mood change, ending gloriously with the eventual sunshine and happiness of &quot;Mr. Blue Sky&quot;. This was inspired by Jeff Lynne's experience while trying to write songs for the album against torrential rain outside his Swiss Chalet.\n\n&quot;Standin' in the Rain&quot; opens with a haunting keyboard over a recording of real rain, recorded by Jeff Lynne just outside his rented studio. Also heard at the 30 second point of the song marking the beginning of The Concerto is thunder crackling in an unusual manner voicing the words &quot;Concerto for a Rainy Day&quot; by the band's keyboardist, Richard Tandy. ELO used the song to open their 1978 Out Of The Blue concerts.\n\n&quot;Big Wheels&quot; forms the second part of the Concerto for a Rainy Day suite and continues with the theme of the weather and reflection followed by the more optimistic third part &quot;Summer and Lightning&quot;. Apart from its inclusion on the Out Of The Blue album, the song has never appeared on any compilation or B-sides until 2000, when Jeff Lynne, the song's composer, included it on the group's retrospective album Flashback.\n\n&quot;Summer and Lightning&quot; is the third song in the &quot;Concerto for a Rainy Day&quot; suite. The raining weather theme is continued throughout the track though the mood and lyrics are more optimistic eventually leading on to the classic finale of...\n\n&quot;Mr. Blue Sky&quot; is the finale of &quot;Concerto for a Rainy Day&quot;. It is an uplifting, lively song celebrating sunshine. It is the only piece from the Concerto to be excerpted as a single.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:cb493e6e452e6dd84b67822debb3d768a09c3f43","amp;dn":"The+Electric+Light+Orchestra+-+Mr.+Blue+Sky+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb493e6e452e6dd84b67822debb3d768a09c3f43","infoHashBuffer":{"type":"Buffer","data":[203,73,62,110,69,46,109,216,75,103,130,45,235,179,215,104,160,156,63,67]},"announce":[],"urlList":[]}}