{"title":"Bayonetta [RF] XBOX360","uid":6702331,"size":6204513254,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:cc7348e15180acd9d6abc8c35674e9034a008a6c&amp;dn=Bayonetta+%5BRF%5D+XBOX360&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Big_dude","files":-1,"time":1317026277,"description":"Bayonetta for XBox 360                                           Rel. 01/05/2010\n\n\nDVD9 Region Free\nWave 3\nEnglish\nStealth Patched, No AP2.5, Not XGD3.\n\n\nDiscs:            1\nImage:            .DVD/ISO\nGenre.:           Action\nRating:           Mature\nRequirements:     Modded or Flashed Drive (iXtreme or LT+)\n\n\n\nCompressed with 7Zip, Game was tested and works.\n\n\n\nNote: Your xbox360 console must be Modded or drive flashed with Ixtreme\n      to play any copy. It isn't recommended to play any game copy online \n      unless your using LT+. Even then you still run the risk of getting \n      banned so just be aware of that.\n\n\n\n\nGame Description:\n\nBayonetta is an action game created by Hideki Kamiya. After 500 years of sleep, a witch named Bayonetta awakes and finds herself confronted by enemies. With no recollection of who she is or the reason she is being attacked, Bayonetta must battle her way through the city of Vigrid while her memory returns. \n\nBayonetta can magically shape her hair into anything and uses it as a weapon to eliminate her enemies. She also has 4 guns at her disposal, two handguns and two attached to her heels. Bayonetta's guns are interchangeable with other weapons that are accessible throughout the game. Weapons can be bought or will be dropped by enemies defeated in battle, weapons bought can be upgraded but weapons dropped by enemies are only temporary.\n\nThe game features slow-motion in the form of Witch Time, which is activated with a well-timed dodge during battle. In this mode Bayonetta can counter-attack enemies before they have the chance to react.\n\n\nFeatures:\n\n* Top Developer Pedigree- Built from the ground up by PlatinumGames, a newly \n  formed studio from gaming's most celebrated development teams (DMC &amp; Resident  \n  Evil series). \n\n* Unique, Sexy Female Lead Character- Bayonetta is a graceful, stylish &amp; all\n  action heroine with a distinctive character design playing an integral part of\n  her special attacks. \n\n* Angelic enemies- Fight against uniquely crafted angelic enemies casting a new\n  light on good and evil. \n\n* Groundbreaking Acrobatic Gameplay- Bayonetta wields an impressive arsenal of\n  weapons on her hands and feet through an intuitive and fluid combat system\n  unrivalled in gaming. She unleashes deadly combos and special attacks with\n  devastating results. \n\n* Interchangeable weapons- In addition to her four enchanted guns called\n  Scarborough Fair, she can unlock an array of weapons from shotguns, bazookas and\n  fiery claws. \n\n* Enemy weapons- Bayonetta can also battle with a variety of other weapons\n  retrieved from fallen enemies. \n\n* Bayonetta also possesses an assortment of special magical attacks:\n \n    - Torture Attacks- Unleash gruesome devices such as the Iron Maiden,\n      Guillotine and more to finish off enemies and send them to hell by charging\n      your Magic gauge.\n \n    - Demon Summons- Successfully link combo attacks together and Bayonetta will  \n      summon supernatural forces to execute dynamic attacks. \n\n    - Beasts of Hell- To eliminate the upper ranks of her foes, Bayonetta's hair\n      serves as a magical conduit to summon demonic beasts. \n\n    - Beast Within - Bayonetta calls upon primal forces, transforming into various\n      beasts (Panthers, Bats, etc.) according to the situation.\n\n\n\n-----------------------------------------------------------------------------------\n\n\nOnly use DVD Decrypter or Imgburn to burn with respected media.\n\n\nIf using DVD Decrypter make sure Layer Break (For DL Media) is at 1913760 user specified option. As DVD Decrypter doesn't recognize .DVD files.\n\n\nIf your new to the Xbox360 scene do some research online.\n\n\nAny Problems or questions please post a comment.\n\n\nIf this is working fine for you let us know write a comment.\n\n\nPlease Seed this when your done.\n\n(I can't seed 24/7, do your part and seed to keep the torrent healthy).\n\n\n\nEnjoy!\t\t","torrent":{"xt":"urn:btih:cc7348e15180acd9d6abc8c35674e9034a008a6c","amp;dn":"Bayonetta+%5BRF%5D+XBOX360","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc7348e15180acd9d6abc8c35674e9034a008a6c","infoHashBuffer":{"type":"Buffer","data":[204,115,72,225,81,128,172,217,214,171,200,195,86,116,233,3,74,0,138,108]},"announce":[],"urlList":[]}}