{"title":"Friends Complete Seasons 1-10 Audio Converted. &quot;Audiobook&amp;q","uid":7349753,"size":3498063548,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:ccb8608199b9dd77bbbf2346d0364e7317a1dadd&amp;dn=Friends+Complete+Seasons+1-10+Audio+Converted.+%26quot%3BAudiobook%26q&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bronco2772","files":-1,"time":1339554758,"description":"Friends Complete Seasons 1-10 Audio Converted\n\n\n\n\nIMDB Ratings : 9.0/10 | 72,548 votes | Top 250: None\n\nGenre: Comedy | Romance  \n\nTagline: I'll Be There For You \n\nPlot: The lives, loves, and laughs of six young friends living in Manhattan. \n\nFriends is an American sitcom created by David Crane and Marta Kauffman, which aired on NBC from September 22, 1994 to May 6, 2004. The series revolves around a group of friends in Manhattan. The series was produced by Bright/Kauffman/Crane Productions, in association with Warner Bros. Television. The original executive producers were Crane, Kauffman and Kevin S. Bright, with numerous others being promoted in later seasons.\nKauffman and Crane began developing Friends under the title Insomnia Cafe in November/December 1993. They presented the idea to Bright, with whom they had previously worked, and together they pitched a seven-page treatment of the series to NBC. After several script rewrites and changes, including a second title change to Friends Like Us, the series was finally named Friends and premiered on NBC's coveted Thursday 8:30 pm timeslot. Filming for the series took place at Warner Bros. Studios in Burbank, California in front of a live studio audience. After ten seasons on the network, the series finale was promoted by NBC, and viewing parties were organized around the U.S. The series finale (the 236th episode), airing on May 6, 2004, was watched by 51.1 million American viewers, making it the fourth most watched series finale in television history and the most watched episode of the decade.\nFriends received positive reviews throughout most of its run, becoming one of the most popular sitcoms of all time. The series won many awards and was nominated for 63 Primetime Emmy Awards. The series, an instant hit from its debut, was also very successful in the ratings, consistently ranking in the top ten in the final primetime ratings. Many critics now regard it as one of the finest shows in television history, including TV Guide, which ranked it #21 on their list of the 50 greatest TV shows of all time. The series made a large cultural impact, which continues today. The Central Perk coffee house that was featured prominently in the series has inspired various imitations throughout the world. The series continues in syndication worldwide. All 10 seasons are available on DVD. The spin-off series Joey was created to follow up with the series after the finale.\t\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0108778/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0108778/&lt;/a&gt;\n\n\nThis Torrent is for they who cant go a day without friends.\nPut the files in your mp3 player and play away!\n\nEnjoy!","torrent":{"xt":"urn:btih:ccb8608199b9dd77bbbf2346d0364e7317a1dadd","amp;dn":"Friends+Complete+Seasons+1-10+Audio+Converted.+%26quot%3BAudiobook%26q","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ccb8608199b9dd77bbbf2346d0364e7317a1dadd","infoHashBuffer":{"type":"Buffer","data":[204,184,96,129,153,185,221,119,187,191,35,70,208,54,78,115,23,161,218,221]},"announce":[],"urlList":[]}}