{"title":"Wade Ray - Idaho Red - Bear Family CD","uid":10508273,"size":1039073651,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:cd7f3d4804c605b1581cdd49810c5cb365a77ef6&amp;dn=Wade+Ray+-+Idaho+Red+-+Bear+Family+CD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"bonnie335","files":65,"time":1404813131,"description":"Wade Ray - Idaho Red - Bear Family CD (2012)\n\n\nJumping western swing and hillbilly from an unheralded pioneer! Most songs completely new to CD...only a few were reissued on LP! Includes 3 previously unissued recordings, plus Let Me Go, Devil...the rarely heard original version of Let Me Go, Lover. Wade Ray never achieved the fame of Bob Wills or Spade Cooley, but he was a true musician's musician and a key member of Willie Nelson's backing group for years. Wade Ray played hot swing fiddle, and he was a versatile vocalist who shone on jazz, country, pop and even rock numbers.\n\nThis collection captures his flawless, often explosive approach to swing. It didn't hurt that his accompanists on record included Speedy West, Jimmy Bryant, Noel Boggs, Billy Liebert, Chet Atkins, and Owen Bradley. The 30 tracks include blazing numbers like the classic trucker anthem Idaho Red, It's All Your Fault with Boggs, Walk Softly...the closest he came to a hit single, the bluesy Too Late To Dream, the swinging instrumental Dipsy Doodle, the never-issued Perdido and two incredibly rare post-RCA recordings for Fabor Records. In the past, Ray's best work has never been properly reissued. Now at last, this collection gives the man, who died in 1998, his due. The set includes liner notes by Rich Kienzle and a detailed discography.","torrent":{"xt":"urn:btih:cd7f3d4804c605b1581cdd49810c5cb365a77ef6","amp;dn":"Wade+Ray+-+Idaho+Red+-+Bear+Family+CD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd7f3d4804c605b1581cdd49810c5cb365a77ef6","infoHashBuffer":{"type":"Buffer","data":[205,127,61,72,4,198,5,177,88,28,221,73,129,12,92,179,101,167,126,246]},"announce":[],"urlList":[]}}