{"title":"X-Men Trilogy {Angelus1609}","uid":6275829,"size":5506540923,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ce6825c267bca8d69d456c377a9c34cc117a5d38&amp;dn=X-Men+Trilogy+%7BAngelus1609%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Angelus1609","files":3,"time":1301248952,"description":"X-Men\nBorn into a world filled with prejudice are children who possess extraordinary and dangerous powers - the result of unique genetic mutations. Cyclops unleashes bolts of energy from his eyes. Storm can manipulate the weather at will. Rogue absorbs the life force of anyone she touches. But under the tutelage of Professor Xavier (Patrick Stewart), these and other outcasts learn to harness their powers for the good of mankind. Now they must protect those who fear them as the nefarious Magneto (Ian McKellen), who believes humans and mutants can never co-exist, unveils his sinsiter plan for the future!\n\nX-Men 2: X-Men United\nThe evolution continues in this &quot;exhilarating thrill ride&quot; (Seattle Post-Intelligencer) that features the extraordinary original X-Men--along with amazing new mutants possessing fantastic powers that have to be seen to be believed. In the wake of a shocking attack on the President, the X-Men face their most dangerous mission ever. They must stand united with their deadliest enemies to combat a menace that threatens every mutant on the planet. But could this new alliance backfire and annihilate the human race? Patrick Stewart, Ian McKellen, Hugh Jackman, Hale Berry, Famke Janssen and Rebecca Romijn-Stamos star in this breathtaking, action-packed spectacle that &quot;may be the best superhero movie yet made!&quot; (San Francisco Examiner)\n\nX-Men 3: The Last Stand\nExperience the awesome power of The X-Men's epic, final battle. Join well-known mutant heroes and villains, and meet a cadre of all-new warriors -- including Angel, Beast, Juggernaut and Colossus -- in this thrilling, explosive adventure! After a controversial &quot;cure&quot; is discovered, mutants can choose to retain their superhuman abilities or give up their unique gifts and become &quot;normal.&quot; When peaceful mutant leader Charles Xavier (Patrick Stewart) clashes with his militant counterpart, Magneto (Ian McKellen), the battle lines are drawn for the war to end all wars. Bursting with nonstop action, spectacular special effects and exclusive extras, X-Men 3: The Last Stand is a force of nature that &quot;will blow you away!&quot; \n----------------------------------------------------------------------------------\n\nThis is a DVDRip in WMV format. Enjoy and be sure to seed.","torrent":{"xt":"urn:btih:ce6825c267bca8d69d456c377a9c34cc117a5d38","amp;dn":"X-Men+Trilogy+%7BAngelus1609%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce6825c267bca8d69d456c377a9c34cc117a5d38","infoHashBuffer":{"type":"Buffer","data":[206,104,37,194,103,188,168,214,157,69,108,55,122,156,52,204,17,122,93,56]},"announce":[],"urlList":[]}}