{"title":"Savage Lands v0.8.2.50","uid":12760567,"size":1098627745,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ceb181011e8d2a5a0456e039070916dd863086da&amp;dn=Savage+Lands+v0.8.2.50&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dauphong","files":1,"time":1447527235,"description":"\nAbout This Game\r\nA New Land, A New Life\r\nSavage Lands is a gritty, brutal, first-person open-world fantasy survival experience in which players have only one goal: Stay Alive. Explore a world where days and nights are spent slaughtering vicious creatures, gathering scarce resources, building shelter and crafting powerful weapons needed to survive. Every decision counts, because one mistake can lead to an unfortunate encounter with death's cold embrace.\r\nEarly Release Features\r\n\r\n    Unforgiving Fantasy World - Savage Lands is bursting with a variety of twisted and hostile creatures ranging from the minuscule to gargantuan scattered throughout the Sundered Isle.\r\n    Brutal Combat - Each encounter, regardless of size and power, has the potential to end fatally.\r\n    Freedom to Explore - The world of Savage Lands is yours to explore with no restrictions.\r\n    Robust Item Crafting - Almost limitless options to create unique armor, weapons, food, and more that will greatly increase your odds of survival.\r\n    Intuitive Build System - Build unique fortifications sheltering you and your allies from the hostile creatures that roam the island.\r\n    Day/Night Cycles - Many creatures walk the day, but take refuge from the night as the freezing cold is only one of many things that will tear away at your humanity.\r\n    Advanced Creature AI - Every creature in Savage Lands will be powered by a unique AI system complete with line of sight, collision avoidance, situational awareness, and pack mentality designed to bring the world to life.\r\n    Multiplayer - Fight alone or team up with other exiles, hoard crafted supplies and gear, and take refuge from the unforgiving environment. Be on guard, as those you think are friends can quickly turn to foe and loot your rotting corpse.\r\n    Character Customization - Personalize your character with a variety of gear to create a one-of-a-kind look.\r\n    Persistent Player Profile - Character data is persistent across all servers making it easy to play with friends","torrent":{"xt":"urn:btih:ceb181011e8d2a5a0456e039070916dd863086da","amp;dn":"Savage+Lands+v0.8.2.50","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ceb181011e8d2a5a0456e039070916dd863086da","infoHashBuffer":{"type":"Buffer","data":[206,177,129,1,30,141,42,90,4,86,224,57,7,9,22,221,134,48,134,218]},"announce":[],"urlList":[]}}