{"title":"Vegan Indian Cooking (2012).epub Gooner","uid":13071350,"size":3486888,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cf9fff281b1cc969055882657f2edb43084f0696&amp;dn=Vegan+Indian+Cooking+%282012%29.epub+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1450799150,"description":"Vegan Indian Cooking - 140 Simple and Healthy Vegan Recipes (2012).epub Gooner\r\n\r\nPublisher: Agate Surrey (June 12, 2012)\r\nLanguage: English\r\nISBN-10: 1572841303\r\nISBN-13: 978-1572841307\r\n\r\nThis beautiful follow-up to Anupy Singla's widely praised first cookbook, the Indian Slow Cooker, is a unique guide to preparing favorite recipes from the Indian tradition using entirely vegan ingredients. Featuring more than 50 recipes, and illustrated with color photography throughout, these great recipes are all prepared in healthful versions that use vegan alternatives to rich cream, butter, and meat. The result is a terrific addition to the culinary resources of any cook interested in either vegan or Indian cuisine.\r\n\r\nSingla--a mother of two, Indian emigre, and former TV news journalist--has a distinctive style and voice that brings alive her passion for easy, authentic Indian food. Some of these recipes were developed by her mother through the years, but many Singla developed herself, including fusion recipes that pull together diverse traditions from across the Indian subcontinent. She shows the busy, harried family that cooking healthy is simple and that cooking Indian is just a matter of understanding a few key spices.\r\n\r\nAs Singla sees it, acquiring and using the proper spices is the key to preparing her healthful recipes at home. Singla has recently brought to market her own line of traditional Indian spice trays (also known as a masala dabba), which is being sold by retail outlets like Williams-Sonoma. Vegan Indian Cooking builds off of Singla's vast expertise in simplifying and perfecting Indian spices and unique, custom spice blends, making delicious Indian cooking accessible to even the most hurried home chef","torrent":{"xt":"urn:btih:cf9fff281b1cc969055882657f2edb43084f0696","amp;dn":"Vegan+Indian+Cooking+%282012%29.epub+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf9fff281b1cc969055882657f2edb43084f0696","infoHashBuffer":{"type":"Buffer","data":[207,159,255,40,27,28,201,105,5,88,130,101,127,46,219,67,8,79,6,150]},"announce":[],"urlList":[]}}