{"title":"Anastacia - Anastacia Not That Kind - (2000)[FLAC-EAC-CUE]","uid":4298999,"size":366189031,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:cfdc8189cc494edbcc6d513b02ebf1bd61b00ab3&amp;dn=Anastacia+-+Anastacia+Not+That+Kind+-+%282000%29%5BFLAC-EAC-CUE%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"seanprince","files":22,"time":1216192973,"description":"Anastacia - Anastacia Not That Kind - (2000)[FLAC-EAC-CUE]\n\nTrack list\n\nAnastacia - Anastacia Not That Kind\n\n01. Not That Kind 03:20\n02. I&amp;#039;m Outta Love 04:03\n03. Cowboys &amp; Kisses 04:41\n04. Who&amp;#039;s Gonna Stop The Rain 05:00\n05. Love Is Alive 04:06\n06. I Ask Of You 04:27\n07. Wishing Well 03:58\n08. Made For Lovin&amp;#039; You 03:36\n09. Black Roses 03:37\n10. Yo Trippin&amp;#039; 03:35\n11. One More Chance 04:39\n12. Same Old Story 05:32\n\nBiography by William Ruhlmann\n\nRaised in New York City, Anastacia came from an entertainment-oriented family: her father was a singer; her mother an actress in musical theater on Broadway. Despite being diagnosed with the chronic intestinal illness Crohn&amp;#039;s disease at age 13, she developed a career as a dancer, appearing on Club MTV and in such music videos as Salt-N-Pepa&amp;#039;s &quot;Everybody Get Up&quot; and &quot;Twist and Shout.&quot; In 1999, she was a finalist on the MTV talent contest show The Cut, which attracted the interest of record labels. She signed to the Daylight custom label of Sony Music&amp;#039;s Epic Records and recorded her debut album, Not That Kind, which was released internationally in 2000.\nThe result was massive success: the album reached the Top Ten in eight European and Far East countries, selling over two million copies. At home, the single &quot;I&amp;#039;m Outta Love&quot; became a dance hit, paving the way for the release of a revised version of Not That Kind in the U.S. in March 2001. A year later, she was creating a buzz in America. She joined Mary J. Blige, Cher, Shakira, and others for VH1&amp;#039;s fifth annual Divas Live showcase in May 2002. She made her proper American debut with Freak of Nature in June. A self-titled album followed in 2004, with the compilation Pieces of a Dream: Best Of arriving a year later. After making a successful foray into fashion with her own clothing line in 2006, Anastacia returned to music in 2007 with plans to release a new album and tour in 2008.\n\nReview by William Ruhlmann\n\nAs revealed in the multiple pictures in the CD package and in the video featured as part of the disc&amp;#039;s multi-media content, Anastacia is, in appearance, yet another teen dream with cascades of blonde hair and an exposed navel (though perhaps her ever-present, and ever-changing, spectacles are supposed to signal a higher intellectual content). But her musical models aren&amp;#039;t Britney Spears or Christina Aguilera, they are Aretha Franklin, Tina Turner, and Martha Wash. Anastacia possesses a big, expressive alto voice that her many co-writers and producers (primarily Rik Wake [Celine Dion, Mariah Carey] and the team of ex-Color Me Badd member Sam Watters and Louis Biancaniello, though Carl Sturken and Evan Rogers, authors of &amp;#039;N Sync&amp;#039;s &quot;God Must Have Spent a Little More Time on You,&quot; have two tracks) use in updated R&amp;B, dance, and funk tracks. &quot;I&amp;#039;m Outta Love,&quot; which just missed topping the dance charts, is an aggressive dancefloor item, and its follow-up, the title song, is in a funk style reminiscent of Aretha Franklin&amp;#039;s &amp;#039;80s work. &quot;I Ask of You&quot; is one of those slow, deliberate big ballads that recalls &quot;And I Am Telling You I&amp;#039;m Not Going&quot; as well as that song&amp;#039;s singer, Jennifer Holliday. And so it goes. The only real misstep on the album is the inevitable Diane Warren adult contemporary romantic ballad, &quot;Late Last Night,&quot; which forces the singer to rein in her voice, though even then she doesn&amp;#039;t really negotiate its lyrical complexity. Despite her toothsome appearance, Anastacia may be too old school to break through in the U.S., though this album has been a commercial success overseas. (The American version has been altered from the foreign one, with a couple of tracks added and dropped.) But Macy Gray demonstrated that a broad audience may respond to an older style if the singer herself is distinguished enough. Anastacia doesn&amp;#039;t have the kind of unique timbre that Gray does -- in fact, the minute she opens her mouth she starts reminding you of other singers, especially Aretha Franklin -- but she is clearly a big talent, and that should count for something.\n\nEnjoy.","torrent":{"xt":"urn:btih:cfdc8189cc494edbcc6d513b02ebf1bd61b00ab3","amp;dn":"Anastacia+-+Anastacia+Not+That+Kind+-+%282000%29%5BFLAC-EAC-CUE%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cfdc8189cc494edbcc6d513b02ebf1bd61b00ab3","infoHashBuffer":{"type":"Buffer","data":[207,220,129,137,204,73,78,219,204,109,81,59,2,235,241,189,97,176,10,179]},"announce":[],"urlList":[]}}