{"title":"The Forever Gate Compendium Edition Isaac Hooke.rar","uid":10286321,"size":2083032,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d1845efb4e1d06dc75722124745b34332b7d1401&amp;dn=The+Forever+Gate+Compendium+Edition+Isaac+Hooke.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"Souldiver333","files":-1,"time":1401785450,"description":"THE FOREVER GATE is a five-part novel. There are two ways to enjoy THE FOREVER GATE. The first is to buy all five parts in sequence. The second is to buy the COMPENDIUM, which includes all five short novels and costs less than the total price of the individual works.\n\nThis is the money-saving COMPENDIUM edition.\n\nTHE FOREVER GATE originally started life as a 21,000 word experimental science fiction novella. In the first two weeks of its release, that novella sold 1,000 copies without any promotion whatsoever. What began as an experiment turned out to be something of a cult hit. Isaac Hooke decided to expand upon the concept presented in the novella, and the serial was born. Each volume consistently shot to the top of the Amazon short-story best-seller list. Soon, book reviewers who ordinarily don't read indie works gave it rave reviews. People wrote fan fiction for it. On March 20, 2013, it won the Indie Book of the Day award. The serial quite literally developed a life of its own.\n\nABOUT THE FOREVER GATE:\n3740 A.D. The ice age has immobilized the world. Colossal walls seal off the cities from the uninhabitable Outside. Humanlike entities called &quot;gols&quot; run society, and force the humans to wear collars that block the innate powers humankind has evolved.\n\nWhat one man will do to save the woman he loves could destroy his world.\n\n\n&gt;&gt;&gt; THE FOREVER GATE combines elements of science fiction &amp; fantasy to create a unique world entirely unlike anything you've seen before. \n\nHere's what reviewers are saying:\n\n&quot;Picked up the first installment, as I often do with indies. When I finished that, I went right back and bought 2, 3 and 4, reading them right through.&quot;\n\n&quot;I have been an avid sci-fi reader since childhood, and THE FOREVER GATE really grabbed me. I love a story in which the nature of reality is questioned, and turns out to be stranger than almost anyone can imagine.&quot;\n\n&quot;THE FOREVER GATE made my blood pump, and gave me a lot to think about when I was finished. Which is basically all I'm asking for in a story.&quot;\n\n&quot;Isaac Hooke is two parts Philip K. Dick, one part Asimov, three parts Dan Brown, and four parts good fun.&quot;\n\n\nAZW3 and EPUB formats\nEnjoy!\nAloha!","torrent":{"xt":"urn:btih:d1845efb4e1d06dc75722124745b34332b7d1401","amp;dn":"The+Forever+Gate+Compendium+Edition+Isaac+Hooke.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1845efb4e1d06dc75722124745b34332b7d1401","infoHashBuffer":{"type":"Buffer","data":[209,132,94,251,78,29,6,220,117,114,33,36,116,91,52,51,43,125,20,1]},"announce":[],"urlList":[]}}