{"title":"Guns_N_Roses-Lies-(Retail)-1988-HHI","uid":6786545,"size":57121368,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d2199c45b7fabedfba376f29baf3f737df7a29b6&amp;dn=Guns_N_Roses-Lies-%28Retail%29-1988-HHI&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"raidy","files":11,"time":1320112432,"description":"Artist......: Guns N roses         \nAlbum.......: Lies  \nGrabber     : EAC   \nEncoder     : LAME v3.90.3         \nRelease Date: 1989  \nRip Date....: Jul-02-2006\nGenre.......: Rock  \nQuality     : VBRkbps / 44.1kHz / Joint-Stereo    \nPlaytime    : 33:33 min  \nRipper      : Happy Hacker Industries   \nCD Songs    : 08    \nLabel.......: Geffen\nAlbum Info..:       \n     \nOnce Appetite for Destruction finally became a hit in 1988, Guns N' Roses bought some time by delivering the half-old/half-new LP G N' R Lies as a follow-up. Constructed as a double EP, with the &quot;indie&quot; debut Live ?!*@ Like a Suicide coming first and four new acoustic-based songs following on the second side, G N' R Lies is where the band metamorphosed from genuine threat to joke. Neither recorded live nor released by an indie label, Live ?!*@ Like a Suicide is competent bar band boogie, without the energy or danger of Appetite for Destruction. The new songs are considerably more problematic. &quot;Patience&quot; is Guns N' Roses at their prettiest and their sappiest, the most direct song they recorded to date. Its emotional directness makes the misogyny of &quot;Used to Love Her (But I Had to Kill Her)&quot; and the pitiful slanders of &quot;One in a Million&quot; sound genuine. Although the cover shrugs them off as a &quot;joke,&quot; Axl Rose's venom is frightening -- there's little doubt that he truly does believe that &quot;faggots&quot; come to America from another country and that &quot;niggers&quot; should stay out of his way. Since he wasn't playing a character on the remainder of the album, there's little doubt this is from the heart as well. And what makes it harder to dismiss is the musical skill of the band, which makes the country-fried boogie of &quot;Used to Love Her,&quot; the bluesy revamp of &quot;You're Crazy,&quot; and the tough, paranoid fever dream of &quot;One in a Million&quot; indelible. So, you either listen to the music and are satisfied or\nelse listen to the lyrics and become disturbed not only by Rose's intentions, but by the millions of record buyers that identified with him.\n     \n     \nAlbum opinion is taken from sites such as cduniverse and allmusic,  \n HHI does not express an opinion either way with regard to the quality         \n of the band etc. We hope you enjoy the music whatever it is!   \n     \n     \nTrack Listing....:  \n  01.Reckless life[03:21]\n  02.Nice boys    [03:04]\n  03.Move to the city  [03:43]\n  04.Mama kin     [03:57]\n  05.Patience     [05:56]\n  06.Used to love her  [03:13]\n  07.You're crazy [04:10]\n  08.One in A million  [06:09]\n____      \n     \n  33:33 min         \n   54,5 MB","torrent":{"xt":"urn:btih:d2199c45b7fabedfba376f29baf3f737df7a29b6","amp;dn":"Guns_N_Roses-Lies-%28Retail%29-1988-HHI","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d2199c45b7fabedfba376f29baf3f737df7a29b6","infoHashBuffer":{"type":"Buffer","data":[210,25,156,69,183,250,190,223,186,55,111,41,186,243,247,55,223,122,41,182]},"announce":[],"urlList":[]}}