{"title":"Patterns [1956]@ .mp4","uid":5600502,"size":535344610,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d28ffc0a2249d4d3d706dd67ada6e3e5d688d3ae&amp;dn=Patterns+%5B1956%5D%40+.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"alien99","files":1,"time":1275278461,"description":"DVD SOURCE MORE THEN LIKELY WAS MADE FROM A VHS SOURCE BUY OVERALL EXEMPT\nFOR A FEW TRACKING LINES GOOD PIC \nEXCELLENT MOVIE FOR ITS GENRE\n\nUser Rating: 8.0/10\n\nWriters:\nRod Serling (teleplay)\nRod Serling (writer) \n\nGenre: Drama\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0049601/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0049601/&lt;/a&gt;\n\n\n\tVan Heflin\t... \tFred Staples\n\tEverett Sloane\t... \tWalter Ramsey\n\tEd Begley\t... \tWilliam Briggs\n\tBeatrice Straight\t... \tNancy Staples\n\tElizabeth Wilson\t... \tMarge Fleming\n\tJoanna Roos\t... \tMiss Margaret Lanier\n\nTrivia:\nBased on a teleplay by Rod Serling that ran on &quot;Kraft Television Theatre&quot; (1947) in January 1955. It featured several of the same actors that would appear in the movie, including Everett Sloane and Ed Begley. However the part of Fred Staples, the lead, was originated by Richard Kiley. Begley's character, Bill Briggs, was called Andy Sloane in the original version. Serling's teleplay won him the first of his six Emmy Awards.\n\nThis tight, intense little film has been rarely seen in recent years (although the original teleplay on which it is based was a huge hit.) It's impact has been dulled slightly (mostly because it's ideas have been stolen for other countless TV shows and movies), but it's basic story is still as relevant as ever. Heflin is a small town plant manager whose company has been swallowed up by Sloane's conglomerate. Sloane moves him up to the executive level of the conglomerate and sets him up with a beautiful home, a fancy office and a top secretary. Soon, however, Heflin realizes that his promotion may have more to do with leverage against one of Sloane's adversaries, his vice president, Begley. Straight is Heflin's materialistic wife who urges him to succeed no matter what the moral cost. Wilson is Begley's secretary who finds herself torn between personal loyalty and company loyalty. The film is a curt 83 minutes and wisely unpadded with excess subplots. The acting is uniformly strong. Heflin is able to display a wide range of emotion. Begley, often cast as overbearing boors, is able to show a more vulnerable side. Sloane is the one who almost goes over the top. He shouts wildly at the drop of a hat and doesn't allow anyone to finish a sentence. One hopes that his type of management wouldn't be tolerated in today's world, but it very well may be. Wilson comes across very solidly in one of her better screen roles. She's given many quiet moments that display her internal struggle. (She would later put a comedic spin on the whole office thing with her wondrous turn in &quot;9 to 5&quot;.) Straight is good, but isn't really a focal point of the story. The film has a dim view of corporate America and the unsettling feelings in the office begin right away. Though the times have changed, this story still holds value today and is an arresting work to watch.  \n\nVideo\nmpeg-4\nw/h 640x480\nbitrate 706kbps\nframe rate 29.970\nAudio\nmpeg4aac\nsample rate 44100\nbitrate 128kbps","torrent":{"xt":"urn:btih:d28ffc0a2249d4d3d706dd67ada6e3e5d688d3ae","amp;dn":"Patterns+%5B1956%5D%40+.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d28ffc0a2249d4d3d706dd67ada6e3e5d688d3ae","infoHashBuffer":{"type":"Buffer","data":[210,143,252,10,34,73,212,211,215,6,221,103,173,166,227,229,214,136,211,174]},"announce":[],"urlList":[]}}