{"title":"Chineasy The New Way to Read Chinese","uid":12993781,"size":12766416,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d29f982895e203f6f766aa364abba3f2eced76fa&amp;dn=Chineasy+The+New+Way+to+Read+Chinese&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"TopShelfBook","files":2,"time":1450144259,"description":"Chineasy The New Way to Read Chinese \r\n\r\n\r\nLearn to read and write Chinese with Chineasy—a groundbreaking approach that transforms key Chinese characters into pictograms for easy recall and comprehension.\r\n\r\nChinese is one of the oldest written languages, and one of the most difficult to master, especially for Westerners. With Chineasy, learning and reading Chinese has never been simpler or more fun. Breaking down the Great Wall of Language, iShaoLan Hsueh draws on her entrepreneurial and cultural background to create a simple system for quickly understanding the basic building blocks of written Chinese. Working with renowned illustrator Noma Bar, she transforms Chinese characters into charming pictograms that are easy to remember.\r\n\r\nIn Chineasy, she teaches the key characters, called radicals, that are the language’s foundation, and then shows how they can be combined to form new words and even phrases. Once you’ve mastered these key characters, you can practice your skills with three stories—a fairy tale, an Asian legend, and a contemporary fable—told using the radicals.\r\n\r\nWith Chineasy, readers of all ages will be able to navigate a Chinese menu, read signs and billboards, and grasp the meaning of most articles in a Chinese newspaper. \r\n\r\n**PLEASE SEED**","torrent":{"xt":"urn:btih:d29f982895e203f6f766aa364abba3f2eced76fa","amp;dn":"Chineasy+The+New+Way+to+Read+Chinese","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d29f982895e203f6f766aa364abba3f2eced76fa","infoHashBuffer":{"type":"Buffer","data":[210,159,152,40,149,226,3,246,247,102,170,54,74,187,163,242,236,237,118,250]},"announce":[],"urlList":[]}}