{"title":"Ensemble Studios (Age of Empires I, II, III + Age of Mythology +","uid":7150582,"size":3728368708,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d3a8e867f73d257288b30a15ef779cf8666f853b&amp;dn=Ensemble+Studios+%28Age+of+Empires+I%2C+II%2C+III+%2B+Age+of+Mythology+%2B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"n17n3uq","files":4,"time":1333301664,"description":"Age of Empires is a series of computer games developed by Ensemble Studios and published by Microsoft Studios. The first title of the series was Age of Empires, released in 1997. Since then, seven titles and three spin-offs have been released. The titles are historical real-time strategy games, and their gameplay revolves around two main game modes: random map and campaign. They competed with another popular strategy series, Civilization, and are set amidst historical events. Age of Empires focused on events in Europe, Africa and Asia, spanning from the Stone Age to the Iron Age; the expansion game explored the formation and expansion of the Roman Empire. The sequel, Age of Empires II: The Age of Kings, was set in the Middle Ages, while its expansion focused partially on the Spanish conquest of Mexico. The subsequent three games of Age of Empires III explored the early modern period, when Europe was colonizing the Americas and several Asian nations were on the decline. The newest installment, Age of Empires Online takes a different approach as a free-to-play online game utilizing Games for Windows Live. A spin-off game, Age of Mythology, was set in the same period as the original Age of Empires, but focused on fictional elements of Greek, Egyptian, and Norse mythology.\n\nThe Age of Empires series has been a commercial success, selling over 20 million copies.[1] The popularity and quality of the games has earned Ensemble Studios a strong reputation in real-time strategy gaming. Ensemble collaborated with Big Huge Games on Age of Empires III: The Asian Dynasties. Critics have credited part of the success of the series to its historical theme and fair play; the artificial intelligence (AI) players fight with less &quot;cheating&quot; than in many of the series' competitors.[2]","torrent":{"xt":"urn:btih:d3a8e867f73d257288b30a15ef779cf8666f853b","amp;dn":"Ensemble+Studios+%28Age+of+Empires+I%2C+II%2C+III+%2B+Age+of+Mythology+%2B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d3a8e867f73d257288b30a15ef779cf8666f853b","infoHashBuffer":{"type":"Buffer","data":[211,168,232,103,247,61,37,114,136,179,10,21,239,119,156,248,102,111,133,59]},"announce":[],"urlList":[]}}