{"title":"AUSTRALIA - Aboriginal - Songs from the Northern Territory cd4","uid":4389626,"size":50718808,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d3d2126004a257294d0613fdc30853122f685bc5&amp;dn=AUSTRALIA+-+Aboriginal+-+Songs+from+the+Northern+Territory+cd4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"starinar","files":13,"time":1221095928,"description":"CLICK ON starinar TO GET MORE TRIBAL AND INDIGENOUS MUSIC.\nBE A MEMBER OF A GLOBAL SeeDeRS TRIBE. MoRE CoMING SooN. ENJoY!\n\n\n\n\nArtist/Collector: \nAlice Moyle \nLabel Information: \nAustralian Institute of Aboriginal and Torres Strait Islander Studies (AIATSIS): AIAS 4 CD \nMedia Type: \nCD \nYear: \nRecorded 1963; Released 1997 \nAvailability: \nAIATSIS \n\nNotes: For the purpose of music description, Eastern Arnhem Land of the Northern \nTerritory is divided here as follows: the north-eastern sector including offshore \nislands; the eastern sector, extending along the coast as far south as the Roper \nRiver; and the Groote Eylandt archipelago north-west of the Gulf of Carpentaria. \nField recordings reproduced on this compact disc were collected at Milingimbi and \nYirrkala in the north-eastern sector and at Angurugu and Umbakumba on Groote Eylandt.\n \nThe Aboriginal communities at Milingimbi and Yirrkala, together with the people at \nGaliwin'ku (previously known as Elcho Island) have been referred to in the \nanthropological literature as the Murngin (WL Warner) and Wulamba (RM Berndt). More \nrecently, they have become known as the Yolngu, from a local word meaning 'people'. \nThe people on Groote Eylandt were known by mainland groups as the Wayingurra and \ntheir language, Ingurra. In the absence of a name for the Groote Eylandters, \nWarnindilyakwa, a name formerly given to one of the larger clans on the island, is \nsometimes used. Anindilyakwa is the name of the island language. \nItem characteristics of Eastern Arnhem Land clan songs performed and recorded in \nthe 1960s-all of which were sung by men-are summarised here as follows: (1) a didjeridu \naccompaniment which utilises two tones differing widely in pitch (the interval between \nthe higher or overblown tone and the fundamental often sounding close to a tenth \nbut varying according to the shape and length of the hollowed branch); (2) a narrow \nvocal range of pitch (compare them, for instance, with Western Arnhem Land songs) \nwhich rarely exceeds a fifth or sixth and may be less than a second; (3) song words \nwhich are translatable, meaningful and appropriate to relevant clan territories \nand related myths; and (4) the occurrence of an unaccompanied vocal termination (UVT), \nor termination of a song item by voice or voices alone after the accompanying \ninstruments have ceased. Good examples of this fourth item characteristic are to be \nheard on this disc (Track 1) and disc 3 (Track 11). \nSong refrains may consist of repeated strings of words and syllables, a prolonged \nsingle syllable or a repeated pattern of vocal sounds (for example, bird calls). \nThese calls are incorporated into the particular sectional or phraselike structure \nof many item sequences performed in Eastern Arnhem Land. \nOn Groote Eylandt (tracks 7-13), only the first three of the above characteristics \nare to be heard. There is no occurrence of the UVT in these items but the following \nadditional characteristics distinguish emeba (Groote Eylandt clan songs) from manikay \n(north-eastern Arnhem Land clan songs): \na. the shaky voice, a deliberate manner of vocal ornamentation used by some emeba singers; \nb. the break or brief cessation of the vocal part of a Groote Eylandt clan song which is \nsignalled by certain words the singer chooses to sing (the song subject at this point may \nfall, swoop down, or change abruptly in some way-it was said that the break gives the singer \ntime to decide which words to sing next); \nc. a short, patterned interplay between sticks and didjeridu during the break; and \nd. the general clatter of stick-beating percussion arising from several different sources \nat the same time. \nFurther comparison of emeba and manikay reveals that, whereas the durations of the latter \nare usually about one minute or less, emeba items may last for more than two minutes each.\n\nManikay.com","torrent":{"xt":"urn:btih:d3d2126004a257294d0613fdc30853122f685bc5","amp;dn":"AUSTRALIA+-+Aboriginal+-+Songs+from+the+Northern+Territory+cd4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d3d2126004a257294d0613fdc30853122f685bc5","infoHashBuffer":{"type":"Buffer","data":[211,210,18,96,4,162,87,41,77,6,19,253,195,8,83,18,47,104,91,197]},"announce":[],"urlList":[]}}