{"title":"Exploring Physical Geography - 1st Edition - Stephen Reynolds (2","uid":10914802,"size":275213430,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d4177394550128a0847d4029d76e95e41ce968ce&amp;dn=Exploring+Physical+Geography+-+1st+Edition+-+Stephen+Reynolds+%282&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":null,"files":-1,"time":1409298456,"description":"ISBN: 978-0078095166 0078095166\nPublished by McGraw-Hill Education\nRetail PDF\n696 pages\n\nStephen Reynolds, author of the highly successful Exploring Geology, brings his ground-breaking, visually spectacular approach to Exploring Physical Geography. Intended for an introductory geography course, such as Physical Geography, Reynolds Exploring Physical Geography promotes inquiry and science as an active process. It encourages student curiosity and aims to activate existing student knowledge by posing the title of every two-page spread and every subsection as a question. In addition, questions are dispersed throughout the book. Integrated into the book are opportunities for students to observe patterns, features, and examples before the underlying concepts are explained. That is, we employ a learning-cycle approach where student exploration precedes the introduction of geographic terms and the application of knowledge to a new situation.\n\nExploring Physical Geography introduces terms after students have an opportunity to observe the feature or concept that is being named. This approach is consistent with several educational philosophies, including a learning cycle and just-in-time teaching. Research on learning cycles shows that students are more likely to retain a term if they already have a mental image of the thing being named (Lawson, 2003). Also, the figure-based approach in this book allows terms to be introduced in their context rather than as a definition that is detached from a visual representation of the term. We introduce new terms in italics rather than in boldface, because boldfaced terms on a textbook page cause students to immediately focus mostly on the terms, rather than build an understanding of the concepts.\n\nFeaturing more than 2,500 photographs and illustration, Exploring Physical Geography engages students with strong visuals, unique two-page spreads, and Before You Leave This Page objectives.","torrent":{"xt":"urn:btih:d4177394550128a0847d4029d76e95e41ce968ce","amp;dn":"Exploring+Physical+Geography+-+1st+Edition+-+Stephen+Reynolds+%282","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d4177394550128a0847d4029d76e95e41ce968ce","infoHashBuffer":{"type":"Buffer","data":[212,23,115,148,85,1,40,160,132,125,64,41,215,110,149,228,28,233,104,206]},"announce":[],"urlList":[]}}