{"title":"Champions of Discovery Series - John Hudson Tiner","uid":11773177,"size":1845441,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d418feca8013b6fe5193d9bee4449ab22b0e399c&amp;dn=Champions+of+Discovery+Series+-+John+Hudson+Tiner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"starxteel","files":3,"time":1427157495,"description":"The great minds of the past are still with us today, in many ways. Individuals who explored the natural world hundreds of years ago have given us a treasure of knowledge in all the sciences.\nIn this exciting series from educator/author John Hudson Tiner, short biographies of the world's most gifted thinkers will inspire the leaders of tomorrow.\n\n-Study the life of the &quot;forgotten&quot; inventor, Joseph Henry, whose exploration of electricity set the standard for later innovators. Find out how a personal tragedy paved the way for Samuel F. B. Morse to put aside his painting and develop the telegraph.\n\n-Learn how Pythagoras investigated mathematics through this affinity for music. Marvel at the &quot;new math&quot; Leonardo Fibonacci learned from the Moors in North Africa.\n\n-Chuckle at the story of Archimedes doing his best thinking in the bathtub! Read how religious persecution gave Kepler his greatest opportunities to study astronomy.\n\nThese valuable learning guides will give students accurate accounts of lives from the annals of science, and explain what those scientists believed about the world around them.\n\n\nAbout the author:\nJohn Hudson Tiner received five National Science Foundation teaching fellowships during his 12 years of teaching science and mathematics. He is a graduate of chemistry at the College of the Holy Cross (Massachusetts), graduate of astronomy at Sam Houston State University (Texas), and a graduate of mathematics at Duke University (NC). He also worked as a mathematician and cartographer for the Defense Mapping Agency, Aerospace Center (St. Louis).\n\nToday, Tiner is a full-time writer. His popular non-fiction books tell their stories through the lives of people who left the world in a better condition than they found it. He says, &quot;After the research is finished, a wonderful moment occurs when the story takes over and the characters come alive. No longer am I a writer, but a time traveler who stands unobserved in the shadows and reports the events as they occur.&quot;\n\nHe has received numerous honors for his writing, including the Missouri Writer's Guild award for best juvenile book for Exploring the World of Chemistry, which was also published by Master Books","torrent":{"xt":"urn:btih:d418feca8013b6fe5193d9bee4449ab22b0e399c","amp;dn":"Champions+of+Discovery+Series+-+John+Hudson+Tiner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d418feca8013b6fe5193d9bee4449ab22b0e399c","infoHashBuffer":{"type":"Buffer","data":[212,24,254,202,128,19,182,254,81,147,217,190,228,68,154,178,43,14,57,156]},"announce":[],"urlList":[]}}