{"title":"Moby - Wait For Me [2009] [160 MP3] [Bubanee]","uid":4946425,"size":62560171,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d525af7b1ce2ea7db1df3e8401c47c37b68ea70f&amp;dn=Moby+-+Wait+For+Me+%5B2009%5D+%5B160+MP3%5D+%5BBubanee%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bubanee","files":17,"time":1244675345,"description":"Recorded in Lame 3.98r [160 MP3]\nmy megabyte saver..\nsoon to be released album by MOBY\n\n1. Division 1:56\n2. Pale Horses 3:37\n3. Shot In The Back Of The Head 3:15\n4. Study War 4:18\n5. Walk With Me 4:01\n6. Stock Radio 0:55\n7. Mistake 3:47\n8. Scream Pilots 2:48\n9. JLTF 1 1:27\n10.JLTF 4:40\n11.A Seated Night 3:23\n12.Wait For Me 4:13\n13.Hope Is Gone 3:31\n14.Ghost Return 2:38\n15.Slow Light 4:00\n16.Isolate 3:28\n\nI recorded the album here in my studio on the lower east side(although 'studio' always seems like an overly grand word for a bunch of equipment set up in a small bedroom). in the past i've worked in large and small studios, but for this record i wanted to record everything at home by myself.\n\ni have some friends/guests singing on the record. they're great singers, but unless you live in fort greene or washington heights you might not know about them, as they're relatively unknown(because i've found that working with friends is almost always nicer than working with rockstars).\n\ni started working on the album about a year ago, and the creative impetus behind the record was hearing a david lynch speech at bafta, in the uk.\n\ndavid was talking about creativity, and to paraphrase, about how creativity in and of itself, and without market pressures, is fine and good.\n\nit seems as if too often an artists or musicians or writers creative output is judged by how well it accommodates the marketplace, and how much market share it commands and how much money it generates.\n\nin making this record i wanted to focus on making something that i loved, without really being concerned about how it might be received by the marketplace. as a result it's a quieter and more melodic and more mournful and more personal record than some of the records i've made in the past.\n\nit's also, for better or worse, all homemade, in that i recorded it at home with my friends and drew the artwork with a black sharpie on copy paper.\n\nthe first single(if you can call an instrumental with no vocals that we're giving away for free a 'single')is called 'shot in the back of the head', and i'm happy to announce that david lynch has done the video for it. i sent him the music and said, 'please do whatever you want'. so he sat down and drew some animation that is very dark and beautiful. david lynch is my favorite film director, and i'm really happy to have him as the first video director on 'wait for me'.\n","torrent":{"xt":"urn:btih:d525af7b1ce2ea7db1df3e8401c47c37b68ea70f","amp;dn":"Moby+-+Wait+For+Me+%5B2009%5D+%5B160+MP3%5D+%5BBubanee%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d525af7b1ce2ea7db1df3e8401c47c37b68ea70f","infoHashBuffer":{"type":"Buffer","data":[213,37,175,123,28,226,234,125,177,223,62,132,1,196,124,55,182,142,167,15]},"announce":[],"urlList":[]}}