{"title":"Space Ghost","uid":9419765,"size":9695448025,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d53336ca666a8774361ca864e9af76326f27958a&amp;dn=Space+Ghost&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"augustinwinter","files":-1,"time":1388551528,"description":"From Wikipedia:\n\nSpace Ghost and Dino Boy\n\nThe original series debuted in 1966, in which the &quot;Space Ghost&quot; segments shared time with an unrelated segment called Dino Boy in the Lost Valley. Space Ghost was voiced by Gary Owens, Tim Matheson voiced Jace (Matheson was the voice of &quot;Jonny&quot; in Jonny Quest, another Hanna-Barbera adventure cartoon series) and Ginny Tyler voiced Jan. Don Messick provided vocalizations for Blip. Space Ghost and his helpers fought such recurring supervillains as Moltar (voiced by Don Messick), Zorak (voiced by Don Messick), Black Widow (voiced by Ginny Tyler; the character was named the Spider Woman in one episode), Metallus (voiced by Ted Cassidy), Brak (voiced by Keye Luke), and Creature King (voiced by Vic Perrin). The original series comprised 42 Space Ghost and 18 Dino Boy episodes, and ended in 1968.\n\n\n\nThis upload contains ONLY the Space Ghost episodes from the DVD set, as well as the recent new episode that was the prologue of a Batman Brave and the Bold episode.\n\nThe 1966 episodes are 720 x 480 NTSC 30 fps, deinterlaced through Handbrake with a high enough bitrate to almost match the size of the original DVD rips.\n\nThe Bold Beginnings episode is 1280 x 720 24 fps HD.","torrent":{"xt":"urn:btih:d53336ca666a8774361ca864e9af76326f27958a","amp;dn":"Space+Ghost","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d53336ca666a8774361ca864e9af76326f27958a","infoHashBuffer":{"type":"Buffer","data":[213,51,54,202,102,106,135,116,54,28,168,100,233,175,118,50,111,39,149,138]},"announce":[],"urlList":[]}}