{"title":"[ScoreHD] Nikky Wilder (The Gift Of Ass Sex / 17.02.2014)","uid":10078964,"size":451204342,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:d5be104aea2a8b996809d34a4e5ce31404aa25fa&amp;dn=%5BScoreHD%5D+Nikky+Wilder+%28The+Gift+Of+Ass+Sex+%2F+17.02.2014%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2.No.2","files":1,"time":1398964166,"description":"[ScoreHD] Nikky Wilder (The Gift Of Ass Sex / 17.02.2014)\n\nIf you've followed Nikky Wilder's trajectory at XLGirls, you've enjoyed her sexy body and her pretty, baby-doll looks, her appetite for hot sex and her enjoyment in posing and showing off her sweet, sensual stuff. The blonde newcomer combines her own special blend of raw sex and eroticism in her guy-girl encounters. Once again, it is our pleasure to welcome Nikky back to where it all started, XLGirls.com. Nikky's doing anal for the first time and it's going to be fucking hot. Tony has a gift for Nikky as the show opens. What's in the gift box? A Valentine's Day heart? Chocolates? Jewelry. None of the above? It's the gift of a thick chick stick, and it's pink, like Nikky. But this toy is not for Nikky's pussy. Nikky sucks on the dildo to try it and that's Tony's cue to drop trou as fast as possible and get his cock riding Nikky's tongue between her toy sucks. Tony takes the toy from her and puts his cock in her mouth, the saliva leaking from her lips. At one point, she sucks both cock and toy. That's a new one. Nikky lays back so Tony can lick her and stick her. He fucks her pussy hard and fast while she sucks on the toy like a candy cane. Pulling out, he has Nikky get the toy wet again from her mouth juices and puts it into her ass. This will prepare her butt for the real thing. Tony works that toy good in Miss Wilder's asshole while she heads to outer space from the anal pleasure. Then he takes the toy out and replaces it with his hard wood...one push and he is in her tush, deep inside Nikky Wilder's butthole.\n\nBBW, Big Tits, Anal, Natural Boobs, Blowjob, Hardcore\n\nScreens:\n &lt;a href=&quot;\nhttp://www.244pix.com/viewer.php?file=jjotpjlrf0bc.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.244pix.com/viewer.php?file=jjotpjlrf0bc.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.244pix.com/viewer.php?file=6mjd2ova0mp4.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.244pix.com/viewer.php?file=6mjd2ova0mp4.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:d5be104aea2a8b996809d34a4e5ce31404aa25fa","amp;dn":"%5BScoreHD%5D+Nikky+Wilder+%28The+Gift+Of+Ass+Sex+%2F+17.02.2014%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d5be104aea2a8b996809d34a4e5ce31404aa25fa","infoHashBuffer":{"type":"Buffer","data":[213,190,16,74,234,42,139,153,104,9,211,74,78,92,227,20,4,170,37,250]},"announce":[],"urlList":[]}}