{"title":"The Datsuns - Live at London I.C.A. 25-05-04","uid":3659254,"size":93312662,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d722b76221114e25ccc52bdc98d6e73ddb74a6bc&amp;dn=The+Datsuns+-+Live+at+London+I.C.A.+25-05-04&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zazafromjohor","files":1,"time":1176078394,"description":"The Datsuns are a rock band from Cambridge, New Zealand. In 1995, while still at school, Dolf de Borst, Phil Buscke, and Matt Osment formed a band under the name Trinket. Christian Livingstone joined the band in 1997. They entered and won the 1999 89FM Battle of the Bands competition; by 2000 the band had renamed themselves &amp;#039;The Datsuns&amp;#039;. In August 2000 they released their first single, &quot;Super Gyration!&quot; on 7 inch vinyl only. In July 2002, after featuring several times on John Peel&amp;#039;s programme on the UK&amp;#039;s BBC Radio 1 and being hailed as &quot;the future of rock&quot; by the British music press, the band signed with the V2 record label. Their self-titled debut album made a strong impression in the UK, as well as in Australia and New Zealand. They played ozzfest in 2003 on the mainstage along side the likes of Ozzy Osbourne, Marilyn Manson, Korn and Disturbed. They played the main stage of the 2004 Big Day Out festival and opened for Metallica in their Australian tour in the same year. Their second album &quot;Outta Sight, Outta Mind&quot; was produced by Led Zeppelin&amp;#039;s John Paul Jones. However it did not receive the same praise as the first, critics giving it only a lukewarm response. In October 2006, the Datsuns came back with &quot;Smoke &amp; Mirrors&quot;, heralded as a return to form in Australia and New Zealand. However it was largely ignored by music press overseas. They also released a limited edition EP &amp;#039;stuck here for days&amp;#039; with only 1500 units available. In Fall 2006 Drummer Matt Osment quit the Band and was replaced by Ben Cole. Ben Cole used to be in a band called PUGNAUT (as did Guitarist Christian Livingstone) and Nuveau Riche. Till the End of 2006 the Band has not confirmed the change of line-up officially.\n\nThis 2004 show is from a radio1 live broadcast; You can hear Mr lamacq introducing the band.","torrent":{"xt":"urn:btih:d722b76221114e25ccc52bdc98d6e73ddb74a6bc","amp;dn":"The+Datsuns+-+Live+at+London+I.C.A.+25-05-04","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d722b76221114e25ccc52bdc98d6e73ddb74a6bc","infoHashBuffer":{"type":"Buffer","data":[215,34,183,98,33,17,78,37,204,197,43,220,152,214,231,61,219,116,166,188]},"announce":[],"urlList":[]}}