{"title":"Sean Costello - Moanin' For Molasses","uid":9165301,"size":54116597,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d75a3ba2f40615df4a43168a0ec53e25797c4bda&amp;dn=Sean+Costello+-+Moanin%27+For+Molasses&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Noshock","files":-1,"time":1383967261,"description":"\n\nThe third time's the charm for this young Atlanta bluesman. Not only is Moanin' his most accomplished and evocative album, it is also the one that took him from being a little-known but promising up-and-comer who once backed Susan Tedeschi to a prominent solo artist who landed W.C. Handy award nominations and was featured on the cover of national blues magazine Blues Revue. Combining stunning covers of obscure soul (James Brown's &quot;I Want You So Bad&quot; and Johnnie Taylor's &quot;You Can't Win With a Losing Hand&quot;), blues (Otis Rush's &quot;It Takes Time&quot; and Willie Dixon's &quot;One Kiss&quot;), and R&amp;B (Mike Bloomfield's &quot;You're Killing My Love,&quot; likely picked up from Atlanta's Theodis Ealey, who also covered it) along with his own sturdy originals, the album crackles with excitement. Costello's soulful voice has matured, and his singing is authoritative, although without the pretentiousness that often mars many young blues musicians. Most importantly, Costello owns these songs and makes his points concisely, with most tracks running under four minutes, and some under three, a rarity for blues albums. His solos are classy, crisp, and succinct, supporting the songs without overwhelming them, and the occasional horns perfectly punctuate the tracks, adding emphasis but never overshadowing Costello's finesse and charm. He sounds absolutely inspired here, helped by tough and sparkling originals like &quot;You're a Part of Me&quot; that easily hold their own with the covers. Costello also shares the spotlight here, especially with harp player Paul Linden, who co-wrote a few tracks and plays solid solos throughout. Costello's natural charisma and obvious delight in performing, along with his ability to mesh blues, R&amp;B, and soul, make this album one of the roots highlights of 2001, and a terrific listen anytime.\n","torrent":{"xt":"urn:btih:d75a3ba2f40615df4a43168a0ec53e25797c4bda","amp;dn":"Sean+Costello+-+Moanin%27+For+Molasses","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d75a3ba2f40615df4a43168a0ec53e25797c4bda","infoHashBuffer":{"type":"Buffer","data":[215,90,59,162,244,6,21,223,74,67,22,138,14,197,62,37,121,124,75,218]},"announce":[],"urlList":[]}}