{"title":"Distributed Photovoltaic Grid Transformers","uid":14532595,"size":7996686,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d76c81ac1471fd1ce972b2db27a5b6926f3c4f55&amp;dn=Distributed+Photovoltaic+Grid+Transformers&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1462459510,"description":"Distributed Photovoltaic Grid Transformers - Hemchandra Madhusudan Shertukde (CRC, 2014).pdf\r\n\r\nISBN 978-1-4665-0581-0\r\n\r\nThe demand for alternative energy sources fuels the need for electric power and controls engineers to possess a practical understanding of transformers suitable for solar energy. Meeting that need, Distributed Photovoltaic Grid Transformers begins by explaining the basic theory behind transformers in the solar power arena, and then progresses to describe the development, manufacture, and sale of distributed photovoltaic (PV) grid transformers, which help boost the electric DC voltage (generally at 30 volts) harnessed by a PV panel to a higher level (generally at 115 volts or higher) once it is inverted to the AC voltage form by the inverter circuit.\r\n\r\nPacked with real-life scenarios and case studies from around the globe, Distributed Photovoltaic Grid Transformers covers the key design, operation, and maintenance aspects of transformers suitable for solar energy. Topics include islanding, voltage flicker, voltage operating range, frequency and power factor variation, and waveform distortion. Multiple homework questions are featured in each chapter. A solutions manual and downloadable content, such as illustrated examples, are available with qualifying course adoption","torrent":{"xt":"urn:btih:d76c81ac1471fd1ce972b2db27a5b6926f3c4f55","amp;dn":"Distributed+Photovoltaic+Grid+Transformers","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d76c81ac1471fd1ce972b2db27a5b6926f3c4f55","infoHashBuffer":{"type":"Buffer","data":[215,108,129,172,20,113,253,28,233,114,178,219,39,165,182,146,111,60,79,85]},"announce":[],"urlList":[]}}