{"title":"BONES: Season 2 - DVD 3","uid":3905780,"size":7088848990,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d81c1488e3feb3adfe1560d61ba3282907ad75fc&amp;dn=BONES%3A+Season+2+-+DVD+3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"espiman","files":18,"time":1195842683,"description":"BONES: Season 2 - DVD 3\n\nAÃƒ?O: 2005\n\nDIRECTOR: JesÃƒÂºs Salvador TreviÃƒÂ±o, Allan Kroeker, Greg Yaitanes, Sanford Bookstaver, Tony Wharmby, James Whitmore Jr.\n\nINTÃƒ?RPRETES: Emily Deschanel, Eric Millegan, David Boreanaz, Michaela Conlin, Jonathan Adams, T.J. Thyne, John M. Jackson, Adam Lieberman, Ty Panitz, Heath Freeman\n\nDURACIÃƒ?N: 903 minutos\n\nGÃƒ?NERO: Intriga\n\nSINOPSIS: ContinÃƒÂºa con esta 2Ã‚Âª temporada &quot;Bones&quot;, la serie basada en la vida real de la antropÃƒÂ³loga forense y novelista Kathy Reichs. La serie cuenta con Emily Deschanel como la doctora Temperance Brennan y David Boreanaz como el agente especial del FBI, Seeley Booth.\n\nLas fuerzas de la ley recurren a la doctora para que les ayude en investigaciones sobre asesinatos cuando los restos humanos encontrados se encuentran en avanzado estado de descomposiciÃƒÂ³n, quemados o destrozados o cuando los habituales mÃƒÂ©todos de investigaciÃƒÂ³n son completamente inÃƒÂºtiles.\n\nSISTEMA: PAL Full Frame 1.78:1 , 16:9\n\nAUDIO: Dolby Digital 5.1: EspaÃƒÂ±ol, InglÃƒÂ©s\n\nSUBTÃƒ?TULOS: EspaÃƒÂ±ol, InglÃƒÂ©s, Griego, PortuguÃƒÂ©s\n\nEPISODIOS:\n\n09. AlienÃƒÂ­genas de la nave espacial\n\nBrennan Y Hoggins se convertirÃƒÂ¡n en las prÃƒÂ³ximas vÃƒÂ­ctimas de un asesino en serie por intentar resolver un caso. Todo comienza cuando aparecen los cadÃƒÂ¡veres de dos hermanos gemelos que fueron secuestrados por un famoso asesino en serie. Este criminal secuestra a sus vÃƒÂ­ctimas pidiendo poco despuÃƒÂ©s un rescate, y colabora soltando a sus rehenes si recibe el dinero acordado. Si las familias no le entregaban la cantidad, tenÃƒÂ­a la costumbre de enterrarlos vivos. Brennan y Hoggins deberÃƒÂ¡n escapar antes de que sea demasiado tarde.\n\n10. La bruja sin cabeza en el bosque\n\nBrennan y Booth llegan a un bosque acompaÃƒÂ±ados de un guarda forestal para observar el lugar en el que ha aparecido asesinado y decapitado un joven. El guarda les explica que en aquel bosque existe una leyenda sobre una bruja que fue asesinada en 1780. La historia cuenta que el espÃƒÂ­ritu de la bruja ronda aquellos parajes, y que ademÃƒÂ¡s mata a todo aquÃƒÂ©l que va en su busca. Brennan identifica el cuerpo del muchacho y descubre que el joven estaba realizando un documental sobre dicha leyenda.\n\n11. Un judas crucificado\n\nBrennan y Booth acuden a la escena de un crimen en la azotea de un hotel. AllÃƒÂ­ se encuentra el cuerpo de un hombre mutilado, quemado y colgado de un poste. Brennan encuentra entre los restos y unido a la garganta de la vÃƒÂ­ctima una ficha con su identidad. Se trata de un antiguo agente del FBI que ademÃƒÂ¡s posee una extraÃƒÂ±a moneda en la que estÃƒÂ¡ acuÃƒÂ±ado el rostro de CristÃƒÂ³bal ColÃƒÂ³n. Este asesinato puede estar relacionado con el padre de Brennan, por lo que su familia corre un gran peligro.\n\n12. El hombre de la celda\n\nBrennan y Booth acuden a una prisiÃƒÂ³n en la que se ha desatado un terrible incendio en una de las celdas. Un funcionario les informa que pertenecÃƒÂ­a a Epps, un asesino en serie. La doctora se sorprende al observar que el cuerpo abrasado no pertenece al criminal, sino a un bombero. Desde ese momento, cualquier persona que estÃƒÂ© cerca de Brennan se convertirÃƒÂ¡ en el objetivo del asesino, incluso el hijo de Booth. Por otra parte, Cam inhala una toxina mientras realiza una autopsia y enferma de gravedad.\n\nFORMATO: DVD9 =&gt; DVD9\n\nCOMPRESION: No lleva, sÃƒÂ³lo he usado el DVDFab Decrypter para ripearlo.\n\nINFO EXTRA:\nMenÃƒÂºs interactivos, Acceso directo a escenas, Comentarios en audio del episodio &quot;Brillando en la vieja casa de piedra&quot; por la actriz Emily Deschanel, el director Caleb Deschanel y el productor ejecutivo Stephen Nathan, Comentarios en audio del episodio &quot;Mirando a las estrellas desde el charco&quot; por el creador de la serie Hart Hanson y los productores ejecutivos Barry Josephson y Stephen Nathan, Documental &quot;Memorias de la temporada&quot;, Documental &quot;Efectos viscerales: El digital&quot;, Escenas eliminadas, Tomas falsas","torrent":{"xt":"urn:btih:d81c1488e3feb3adfe1560d61ba3282907ad75fc","amp;dn":"BONES%3A+Season+2+-+DVD+3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d81c1488e3feb3adfe1560d61ba3282907ad75fc","infoHashBuffer":{"type":"Buffer","data":[216,28,20,136,227,254,179,173,254,21,96,214,27,163,40,41,7,173,117,252]},"announce":[],"urlList":[]}}