{"title":"John Marriott - Beyond the Tower. A History of East London [2011","uid":9951220,"size":10131373,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d840ca6d3578eda0e488b2f995cb6763e6f993cc&amp;dn=John+Marriott+-+Beyond+the+Tower.+A+History+of+East+London+%5B2011&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Anette14","files":-1,"time":1397404565,"description":"Description\nProduct details\nBook Title: Beyond the Tower: A History of East London\t\nBook Author: John Marriott (Author)\nHardcover: 384 pages\nPublisher: Yale University Press; First Edition edition (26 Aug 2011)\nLanguage: English\nISBN-10: 0300148801\nISBN-13: 978-0300148800\n\nBook Description\nPublication Date: 26 Aug 2011\nFrom Jewish clothing merchants to Bangladeshi curry houses, ancient docks to the 2012 Olympics, the area east of the City has always played a crucial role in London's history. The East End, as it has been known, was the home to Shakespeare's first theatre and to the early stirrings of a mass labour movement; it has also traditionally been seen as a place of darkness and despair, where Jack the Ripper committed his gruesome murders, and cholera and poverty stalked the Victorian streets. In this beautifully illustrated history of this iconic district, John Marriott draws on 25 years of research into the subject to present an authoritative and endlessly fascinating account. With the aid of copious maps, archive prints and photographs, and the words of East Londoners from 17th-century silk-weavers to Cockneys during the Blitz, he explores the relationship between the East End and the rest of London, and challenges many of the myths which surround the area.\n\nAbout the Author\nJohn Marriott is Professor in History at the Raphael Samuel History Centre, University of East London, and author of 'The Culture of Labourism: The East End between the Wars' (1991) and 'The Other Empire: Metropolis, India and Progress in the Colonial Imagination' (2003).\n","torrent":{"xt":"urn:btih:d840ca6d3578eda0e488b2f995cb6763e6f993cc","amp;dn":"John+Marriott+-+Beyond+the+Tower.+A+History+of+East+London+%5B2011","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d840ca6d3578eda0e488b2f995cb6763e6f993cc","infoHashBuffer":{"type":"Buffer","data":[216,64,202,109,53,120,237,160,228,136,178,249,149,203,103,99,230,249,147,204]},"announce":[],"urlList":[]}}