{"title":"Code Indigo - Chill (New Age, 2006)","uid":3501813,"size":145696558,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d9736d5009e7d8d8afe83acb7ffd88e15313cfca&amp;dn=Code+Indigo+-+Chill+%28New+Age%2C+2006%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jamestown1","files":17,"time":1152444295,"description":"NFO-file created by PostAssistant v009\nDate : 7/9/2006  --  Time : 2:49:51 AM\n \nArtist     : Code Indigo\nAlbum      : Chill\nSource     : CD\nYear       : 2006\nGenre      : New Age\nLabel      : AD Music\n\nCodec      : Lame 3.96 \nQuality    : VBR, average 255kbps, joint stereo\n\nID3-Tag    : Yes, Version 1 &amp; 2.3\n\nPosted By  :  on 09-07-2006\n\n\nIncluded   : This Info-File (NFO)\n             Frontcover\n\nTracklisting\n------------\n01 (9:02) Autumn Fades\n02 (4:37) Chill\n03 (1:14) Vapour Tales\n04 (8:15) Ten Degrees Per Second\n05 (0:57) Vapour Trails\n06 (6:08) Back With The Weather (Calm Front)\n07 (4:57) Back With The Weather (Storm Surge)\n08 (5:43) Vapour\n09 (7:44) Cultures\n10 (5:34) Culture Shift\n11 (3:08) Vapour Tails\n12 (3:35) Lost Radio (Tuning In)\n13 (3:15) Lost Radio (Program 1)\n14 (5:45) Lost Radio (Program 2)\n15 (6:02) Lost Radio (Timing Out)\n\nPlaying Time : 75:56\nTotal Size   : 138 MB\n\n\nNew Age band Code Indigo is one of AD Music&amp;#039;s most prominent acts. With its imaginative combination of keyboards, guitar, samples and voice, their music compares to that of the Enigma, Deep Forest and instrumental Pink Floyd. The 1995 debut album &amp;#039;For Whom The Bell&amp;#039; is considered a seminal album, while the 2003 release &quot;TimeCode&quot; has become one of New Age radio show Echoes Radio USA &quot;Essential top 25 chillout albums&quot;.\n\n---------\nChill review\n\n\nThe new album from Code Indigo is their most assured and satisfying to date. The band consists of David Wright and Robert Fox with Andy Lobban on guitar and Dave Massey on rhythms and bass programming. The musical template has been refined and honed into an impressively mature and confident musical vision. This is apparent from the opening track, &amp;#039;Autumn Fades&amp;#039; which begins slowly with melancholic strings and piano motif, interspersed with Lobban&amp;#039;s excellent guitar which enters with a plaintive cry. At around the four and a half minute mark, the percussion steps up the pace a little and the strings add more atmosphere to accompany the soaring guitar which take the track to a great climax and then cross fades into the more lush and gentle &amp;#039;Chill&amp;#039; . \nHere the atmosphere is more subdued with strings, percussion and piano predominating and then subtle guitar phrases add a little extra colour to the wonderfully downbeat ambience. Cross fading into the more abstract tones of &amp;#039;Vapour Tales&amp;#039;, which adds distant voice samples serving as a prelude to &amp;#039;Ten Degrees Per Second&amp;#039; which steps up the pace a little with percussion added to the mix. At just over two and a half minutes a wonderfully downbeat melancholic air permeates the track and Lobban&amp;#039;s guitar lifts the piece to greater heights. A superb track to lift the spirits and affirm all that is great with this band. \n\n&amp;#039;Back with The Weather, Calm Front&amp;#039; strips the sound down to percussion, rhythm guitar and orchestral tones with a superb ethnic vocal sample adding splashes of colour. &amp;#039;Storm Surge&amp;#039; continues in similar vein but gradually builds the atmosphere and intensity and has a great end sequence featuring an impressive guitar climax. \n\n&amp;#039;Vapour&amp;#039; relaxes the atmosphere with a drifting, hypnotic tone poem of piano, echoed radio samples, synth and guitar textures cross fading into &amp;#039;Cultures&amp;#039;. The percussion is subtly ethnic, and again some highly effective, hypnotic samples enhance the mix, and yet another winning memorable melody is deployed before the guitar returns to add a little more bite before the primary theme is revisited. &amp;#039;Culture Shift&amp;#039; adds marimba sequences as the mood shifts down a little as guitar provides the main focus before the gradual crossfade into the more abstract territory of &amp;#039;Vapour Tails&amp;#039;. \n\n&amp;#039;Lost Radio (Tuning In)&amp;#039; begins with what I think is a sample from the classic radio broadcast of &amp;#039;War of the Worlds&amp;#039; by Orson Welles before a terrific piano piece emerges reminiscent of Robert Fox&amp;#039;s palette, (I may well be out of turn here and I use this as merely a descriptive device), on &amp;#039;Lost Radio Program 1&amp;#039;. &amp;#039;Program 2&amp;#039; has a clever bass sequence and continues with the guitar and keyboards adding great phrases to the mix. \n\nFinally, &amp;#039;Tune Out&amp;#039; concludes the set with, at first, soft, almost subliminal, piano and strings and downbeat keyboard work which sounds to me like David Wright&amp;#039;s compositional touch, again I may be wrong, but it is a fitting, if low key, ending to a great album. I wish all those who bought Dave Gilmour&amp;#039;s recent solo outing could hear this album. Whatever the undoubted merits of the former release, I have played and enjoyed Code Indigo more. \n\nTo compare &amp;#039;Chill&amp;#039; to Pink Floyd seems a little lazy, and guilty of all the hallmarks of the hyperbole sometimes seen in review listings, but I genuinely believe that Code indigo deserve to be heard to enable people to make up their own minds. If my own personal experience is anything to go by, with individuals instantly converted, then a wider audience is theirs, if, and I know it is a big IF, they can only be heard. This has been true of other New Age artists I know, but that does not make it any easier to take. \n\n&amp;#039;Chill&amp;#039; is the finest Code Indigo album so far and that in itself is a great achievement.\n\n\n\n\n","torrent":{"xt":"urn:btih:d9736d5009e7d8d8afe83acb7ffd88e15313cfca","amp;dn":"Code+Indigo+-+Chill+%28New+Age%2C+2006%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9736d5009e7d8d8afe83acb7ffd88e15313cfca","infoHashBuffer":{"type":"Buffer","data":[217,115,109,80,9,231,216,216,175,232,58,203,127,253,136,225,83,19,207,202]},"announce":[],"urlList":[]}}