{"title":"Elgar - The Dream of Gerontius [1965]","uid":4756977,"size":141370484,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:da710bd0fcd7a3ec774438fd535b143ada8162b3&amp;dn=Elgar+-+The+Dream+of+Gerontius+%5B1965%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"john111111111111111111111","files":22,"time":1236513140,"description":"The Dream of Gerontius, popularly called just Gerontius, is an oratorio (Opus 38) in two parts composed by Edward Elgar in 1900, to text from the poem by Cardinal Newman. It relates the journey of a pious man's soul from his deathbed to his judgment before God and settling into Purgatory. It is widely regarded as Elgar's finest choral work, and by some to be his magnum opus. It was composed for the Birmingham Music Festival of 1900 and the first performance took place on 3 October 1900, in Birmingham Town Hall.\n\nNewman's poem tells the story of a soul's journey through death, and provides a meditation on the unseen world of Roman Catholic theology. Gerontius (a name derived from the Greek word geron, &quot;old man&quot;) is a devout Everyman. Elgar's setting uses most of the text of the first part of the poem, which takes place on Earth, but omits many of the more meditative sections of the much longer, otherworldly second part, tightening the narrative flow.\n\nIn the first part, we hear Gerontius as a dying man of faith, by turns fearful and hopeful, but always confident. A group of friends (also called &quot;assistants&quot; in the text) joins him in prayer and meditation. He passes in peace, and a priest, with the assistants, sends him on his way with a valediction. In the second part, Gerontius, now referred to as &quot;The Soul&quot;, awakes in a place apparently without space or time, and becomes aware of the presence of his guardian angel, who expresses joy at the culmination of her task (Newman conceived the Angel as male, but Elgar gives the part to a female singer). After a long dialogue, they journey towards the judgment throne.\n\nThey safely pass a group of demons, and encounter choirs of angels, eternally praising God for His grace and forgiveness. The Angel of the Agony pleads with Jesus to spare the souls of the faithful. Finally Gerontius glimpses God and is judged in a single moment. The Guardian Angel lowers Gerontius into the soothing lake of Purgatory, with a final benediction and promise of a re-awakening to glory.\n\nThis is a classic recording. Richard Lewis is a fine Gerontius, and Janet Baker glorious as the Angel. The weakness is the finnish bass Kim Borg - he struggles with the english pronunciation. The orchestra is good, although intonation isn't always. Barbirollis conducting is very warm and musical (and some would say sentimental - but I think this piece can take it). Overall this performance gives a rare feeling of everyone really believing in the music. This unusual commitment more than compensates for the minor weaknesses I mentioned and makes this recording rather special. Sound quality is decent but unfortunately not quite up to EMI's best standards of the period (1965). Recommended.\n\nMP3 192Kb/s","torrent":{"xt":"urn:btih:da710bd0fcd7a3ec774438fd535b143ada8162b3","amp;dn":"Elgar+-+The+Dream+of+Gerontius+%5B1965%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"da710bd0fcd7a3ec774438fd535b143ada8162b3","infoHashBuffer":{"type":"Buffer","data":[218,113,11,208,252,215,163,236,119,68,56,253,83,91,20,58,218,129,98,179]},"announce":[],"urlList":[]}}