{"title":"Japanese Lit, Slang, Study Books","uid":3823097,"size":352186349,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:da75782d81509c3e0047224f9d10d209a970e5ee&amp;dn=Japanese+Lit%2C+Slang%2C+Study+Books&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"phalos","files":5,"time":1191029616,"description":"These are some Japanese Books I&amp;#039;ve scanned.\n---\nBreaking into Japanese Literature: Seven Modern Classics in Parallel Text\nBook Description\nReading great books in the original should be the culmination of language study, \nbut reading Japanese literature unassisted is a daunting task that can defeat \neven the most able of students. Breaking into Japanese Literature is specially \ndesigned to help you bypass all the frustration and\nactually enjoy classics of Japanese literature.\n\nBreaking into Japanese Literature features seven graded stories covering a \nvariety of genres: whether it&amp;#039;s the spellbinding surrealism of Natsume Soseki&amp;#039;s \nTen Nights of Dreams, the humor of Akutagawa Ryunosuke&amp;#039;s fable of temple life \n(&quot;The Nose&quot;), or the excitement of his historic thrillers (&quot;In a\nGrove&quot; and &quot;Rashomon&quot;), you are sure to find a story that appeals to you in this \ncollection.\n\nThe unique layout-with the original Japanese story in large print, an easy-to-\nfollow English translation and a custom dictionary-was created for maximum \nclarity and ease of use. There&amp;#039;s no need to spend time consulting reference \nbooks when everything you need to know is right there in front of your\nnose.\n\nTo make Japanese literature fun, Breaking into Japanese Literature also has some \nunique extra features: mini-biographies to tell you about the authors&amp;#039; lives and \nworks, individual story prefaces to alert you to related works of literature or \nfilm, and original illustrations to fire your imagination.\nBest of all, MP3 sound files of all the stories have been made available for \nFREE on the Internet.\n\nBreaking into Japanese Literature provides all the backup you need to break \nthrough to a new and undiscovered world-the world of great Japanese fiction. All \nthe hard work has been taken care of so you can enjoy the pleasures of the mind. \nWhy not take advantage?\n\nLearn\no 50% of all common-use kanji covered\no Kanji entry numbers given for follow-up study\no Japanese + English translation + custom dictionary on the same page\no Every single kanji word explained\n\nListen\no Free download of sound files from the Net\n\nLook\no 7 original atmospheric illustrations\n\nLink\no Original stories for Kurosawa&amp;#039;s Rashomon and Dreams\n\nAll the stories in this book are available on the Internet as MP3 sound files \nread by professional Japanese actors.\n\nFor students who want to consolidate their understanding of kanji, the entry \nnumbers for any of the 2,230 characters in The Kodansha Kanji Learner&amp;#039;s \nDictionary have been provided when those characters feature in Breaking into \nJapanese Literature. This makes cross-referencing a matter of\nseconds. \n---\nDirty Japanese: Everyday Slang from &quot;What&amp;#039;s Up?&quot; to &quot;F*ck Off!&quot;\n Book Description\nInvaluable for those traveling to Japan, this guide features useful sidebars \nfeaturing English expressions commonly used in Japan. Pronunciation guides, a \nreference dictionary, sample dialogues, and an offensiveness-rating system from \n&quot;use at will&quot; to &quot;use at your own risk&quot; also help readers learn to communicate \neffectively.\n---\nJapanese in MangaLand: Workbook 1\nBook Description\nAs the popularity of manga in this country continues to soar, so does the desire \nof its fans to learn Japanese in order to appreciate it in its original \nlanguage. The three volumes in the Japanese in MangaLand series combine the \nenjoyment of reading manga with an innovative and entertaining\napproach to language instruction.\nNow comes the Japanese in MangaLand Workbook 1, a perfect way for readers to \npractice and assimilate what they learned in the first volume. The Workbook \noffers more than 150 complementary activities, divided into six sections that \nenable students to practice writing hiragana, katakana and kanji, as\nwell as to optimize the vocabulary and grammar that were taught in the textbook \nitself. An exciting special feature-24 pages of a Rakujo manga created \nexclusively for this workbook-further enhances the learning experience.\n---","torrent":{"xt":"urn:btih:da75782d81509c3e0047224f9d10d209a970e5ee","amp;dn":"Japanese+Lit%2C+Slang%2C+Study+Books","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"da75782d81509c3e0047224f9d10d209a970e5ee","infoHashBuffer":{"type":"Buffer","data":[218,117,120,45,129,80,156,62,0,71,34,79,157,16,210,9,169,112,229,238]},"announce":[],"urlList":[]}}