{"title":"[Robert D. Morrison,Gwen O'Sullivan]Environmental Forensics Proc","uid":11194101,"size":13801571,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:daaf64cccfa49f5df0b2a2a9668d15d44aabf8ea&amp;dn=%5BRobert+D.+Morrison%2CGwen+O%27Sullivan%5DEnvironmental+Forensics+Proc&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zombie_rox","files":1,"time":1413054104,"description":"This publication includes peer-reviewed manuscripts from the 2013 International Network of Environmental Forensics (INEF) Conference held at Pennsylvania State College, USA. INEF is an organization founded by environmental forensic scientists for the express purpose of sharing and disseminating environmental forensic information to the international scientific community. This professionally edited book is the third of a series of INEF conference publications chronicling the current state of the art in environmental forensics. Since the first INEF conference held in Qingdao, China in 2008, significant advances in the state of the art in environmental forensics have occurred, especially in the fields of compound specific isotope analysis (CSIA), biological and petroleum hydrocarbon pattern recognition and the use of advanced multivariate techniques for interpreting environmental forensics data. Of note in these proceedings is the application of environmental forensic techniques to examine contaminant issues associated with hydrofracking which has received considerable international attention in the past several years. Providing an update on the advancement and refinement of environmental forensic techniques, this book is aimed at scientists, regulators, academics and consultants from throughout the world.\n\nProduct Description\nAbout the Author\nRobert Morrison has a B.S. in Geology, a M.S. in Environmental Studies, a M.S. in Environmental Engineering and a Ph.D. in Soil Physics from the University of Wisconsin at Madison. He has worked for 38 years as an environmental consultant on projects related to soil and groundwater contamination, including site investigations and remediation. His current specialization is in the forensic review and interpretation of scientific data for the purpose of identifying the source and age of a contaminant release. Gwen O'Sullivan is currently an environmental chemist with Trium Environmental Solutions Inc. (TRIUM). In this role she is responsible for project management, business development, litigation support, and independent scientific investigation. She has B.Sc. in Environmental Sciences from University of Limerick in 1999, and a Ph.D from the Environmental Engineering Research Center within the department of Engineering at Queen's University of Belfast in 2004. She has worked on numerous projects and designed and managed environmental forensics investigations involving compounds of major concern. \n\nPublisher: Royal Society of Chemistry; Gld edition (9 July 2014)\nLanguage: English\nISBN-10: 1849739447\nISBN-13: 978-1849739443","torrent":{"xt":"urn:btih:daaf64cccfa49f5df0b2a2a9668d15d44aabf8ea","amp;dn":"%5BRobert+D.+Morrison%2CGwen+O%27Sullivan%5DEnvironmental+Forensics+Proc","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"daaf64cccfa49f5df0b2a2a9668d15d44aabf8ea","infoHashBuffer":{"type":"Buffer","data":[218,175,100,204,207,164,159,93,240,178,162,169,102,141,21,212,74,171,248,234]},"announce":[],"urlList":[]}}