{"title":"Captain Blood - The Classic Film Scores for Errol Flynn","uid":11498742,"size":318024247,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:dace90f261bddab85813abbb704a4c2add98ac7c&amp;dn=Captain+Blood+-+The+Classic+Film+Scores+for+Errol+Flynn&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"metro369","files":9,"time":1416317194,"description":"Sony Classical, down to a select number of highly marketable releases each year, has rarely been in the reissue business, and it's unclear how the label came to reissue this album, originally released in 1974 as an LP on RCA's venerable Red Seal label. Perhaps it was because film scores are one of classical music's growth segments, and Sony wanted to test the waters for future releases in the genre. The reissue is a successful one in any event. The sound and the performances, with Charles Gerhardt conducting the National Philharmonic Orchestra, have held up well. The program includes not only music from Captain Blood (1935) but also suites from seven other Errol Flynn films, including a short selection from Hugo Friedhofer's score for The Sun Also Rises, made just two years before Flynn's death in 1959. As such, the album traverses several eras in film music history. But most of the music comes from the pens of the German immigrant composers who came to Hollywood in the 1930s and set the tone for an entire cultural system: in this case Erich Korngold and Max Steiner, with one short contribution from Franz Waxman, as well. The focus on Errol Flynn makes sense, for, as Tony Thomas, Rudy Behlmer, and Clifford McCarty write in the original liner notes, &quot;The great swashbuckler and the era of great romantic movie music set sail on the same tide.&quot; The splendid cuts from The Sea Hawk and Captain Blood will sound familiar to anyone who has watched late-night movies on television for any length of time, and they virtually define the sword-and-sea atmosphere of these films. But what's even more interesting is to watch these composers adapt their styles to later developments in Flynn's career. He moved, oddly enough, into the Western, resulting in some unbelievable plots designed to explain the arrival of the supposedly Irish Flynn (he was actually Australian, from Tasmania) in the Old West. But sample Steiner's score for Dodge City (track 5), with its Tchaikovskian spaces and romantic melodies deployed to imagine an open prairie quite different from the ones Aaron Copland was working on at the same time. These scores are enjoyable not only for film buffs but for anyone who has ever wanted to think a little bit about movie music and its history. Highly enjoyable; well worth the reissue. Kudos to Sony","torrent":{"xt":"urn:btih:dace90f261bddab85813abbb704a4c2add98ac7c","amp;dn":"Captain+Blood+-+The+Classic+Film+Scores+for+Errol+Flynn","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dace90f261bddab85813abbb704a4c2add98ac7c","infoHashBuffer":{"type":"Buffer","data":[218,206,144,242,97,189,218,184,88,19,171,187,112,74,76,42,221,152,172,124]},"announce":[],"urlList":[]}}