{"title":"National Geographic WILD SEX","uid":4995059,"size":4403286063,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:dba32aa0c09c1c7cff55435b62eb290aeffa7f01&amp;dn=National+Geographic+WILD+SEX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"junoon","files":7,"time":1247238583,"description":"Wild Sex tells the amazing stories and bizarre behaviours that lie behind this universal urge and shows the extraordinary strategies animals use to ensure success in the highly competitive world of sex. For humans, Sex is for pleasure, for the continuation of generations, and has served evolutionary purposes. Males and females of the animal world are out for their own benefit. They rely on peculiar sexual strategies to achieve their goals with the risk of violence or death often not very far away.\n\nAnimals have to find a way around conflict, and seek to satisfy their need to procreate in any way they can. Homosexuality, incest, hermaphrodite sex orgies, and necrophilia, you name it - animals do it.\n\nEach episode explores a different aspect of sexual behaviour, from the belligerence of the dominant male and the cunning strategies of the female, to the concepts of group sex and sexual advertising. Wild Sex combines accurate science and informative images to deconstruct and explain the strategies and behaviours used in sex. It reveals the strange but true facts behind animal reproduction.","torrent":{"xt":"urn:btih:dba32aa0c09c1c7cff55435b62eb290aeffa7f01","amp;dn":"National+Geographic+WILD+SEX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dba32aa0c09c1c7cff55435b62eb290aeffa7f01","infoHashBuffer":{"type":"Buffer","data":[219,163,42,160,192,156,28,124,255,85,67,91,98,235,41,10,239,250,127,1]},"announce":[],"urlList":[]}}