{"title":"Dune Wars (Mac)","uid":8515834,"size":3088708210,"categoryP":"games","categoryS":"mac","magnet":"?xt=urn:btih:dc2cd9e4ab4202ef500df82fefbfc3b13a01dde2&amp;dn=Dune+Wars+%28Mac%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ryballs","files":-1,"time":1369727339,"description":"Dune Wars: A Civilization IV mod based on Frank Herbert's epic Dune saga.\n\n* Play as your favorite characters from the books, and vanquish the characters you hate the most!\n* No game set on Dune would be complete without sandworms. Put out spotters to see them coming, or they will lay waste to your armies or spice harvesters and then vanish beneath the sand. \n* Explore the desert terrain using thopters. Nagivate through sandstorms and wind-traps.\n* Combat between the knife-wielding Fremen and the sword-wielding elite Sardaukar is fast and bloody.\n* Are you ready to become the sole ruler of Dune, and in turn, control the Universe?\n\nThe best mod I have ever seen.. Four years in the making. A Dune fans wet dream.\n\nPorted to mac by myself. Includes Civilization IV, Beyond the Sword Expansion (Required for Dune Wars), Dune Wars 1.9.7 mod, Better Graphics mod (for Dune Wars) and Dune Music mod.\n\nNote: Game defaults to full-screen 1024x768 but you can change to windowed mode or a higher resolution (widescreen supported) in Advanced, Options, Graphics once the game loads. Antialiasing is set at 2x for compatibility but feel free to increase if your graphics card can handle it.\n\nEnjoy and please seed.","torrent":{"xt":"urn:btih:dc2cd9e4ab4202ef500df82fefbfc3b13a01dde2","amp;dn":"Dune+Wars+%28Mac%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc2cd9e4ab4202ef500df82fefbfc3b13a01dde2","infoHashBuffer":{"type":"Buffer","data":[220,44,217,228,171,66,2,239,80,13,248,47,239,191,195,177,58,1,221,226]},"announce":[],"urlList":[]}}