{"title":"Couples Therapy Season 2 WEB-DL.x264","uid":9766130,"size":3419424401,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:dcbd0f88d3a6affa37a462963d2f62606e1d07d2&amp;dn=Couples+Therapy+Season+2+WEB-DL.x264&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"RKSTR","files":10,"time":1394880246,"description":"Cast\nCourtney Stodden And Doug Hutchison\n\nNik Richie And Shayne Lamas\n\nAlex McCord And Simon van Kempen\n\nJoel 'JoJo' And Tashaunda Hailey \n\nTodd 'Too Short' Shaw And Monica Payne\n\n1.Couples Therapy Begins\nReleased Oct 03, 2012\nRelationship expert Dr. Jenn Berman and her staff of therapists welcome the celebrity couples to an intense program designed to fix even the most troubled relationships.\n\n2.Opening Up\nReleased Oct 10, 2012\nOn the first night of Couples Therapy, the drama surrounding Courtney Stodden and Doug Hutchison's controversial marriage continues when Doug demands an apology from Nik for calling him a child molester\n\n3.Communication Issues\nReleased Oct 17, 2012\nShayne's emotional breakdown continues, but Dr. Jenn is able to convince her to stay and fight for her marriage. Nik half-heartedly apologizes to Doug for calling him a child molester, but the tension between them remains\n\n4.Exposing the Real Issues\nReleased Oct 21, 2012\nDoug has an emotional breakdown during couples yoga when he's forced to do it alone because Courtney has not yet arrived. In a group about trust, Courtney admits that her relationship with her ex-boyfriend undermines her relationship with Doug.\n\n5.Power Dynamics\nReleased Oct 24, 2012\nNik threatens to leave therapy because he feels Shayne is isolating herself and unwilling to take part in the process. Doug and Courtney get a wake-up call when Dr. Jenn decides to implement a new house rule.\n\n6.Playing By the Rules\nReleased Oct 31, 2012\nAfter Dr. Jenn enforces a dress code in the house, she takes Courtney shopping to get her more appropriate and respectful clothing. During an intense process group focused on childhood trauma, Alex and Tiny share their heartbreaking stories.\n\n7.Dourtney's Aftermath\nReleased Nov 07, 2012\nWith Doug and Courtney gone, the rest of the couples rejoice, happy to be free of the constant drama. Shayne reacts by tearing down Doug's mural in his room, Simon prances about in his Speedo, and Nik even creates a t-shirt that says &quot;Dourtney Is Dead&quot;.\n\n8.Putting Love to the Test\nReleased Nov 14, 2012\nCourtney and Doug return to the house, and swear that they are returning with an open heart, but not everyone in the house is buying it. Dr. Jenn meets with Courtney's mother, Krista, to get some answers about why she allowed Courtney to marry Doug.\n\n9.Final Confrontations\nReleased Nov 21, 2012\nWith only a few days left at Couples Therapy, some of the couples have found themselves on a slippery slope as things seem to be getting much worse before they start to get better.\n\n10.Season Finale\nReleased Nov 28, 2012\nWith only two short days left until the couples complete their therapy and leave the house, Dr. Jenn and her staff work frantically to tie up any loose ends. One of the couples decides to finish the process with an unexpected wedding.","torrent":{"xt":"urn:btih:dcbd0f88d3a6affa37a462963d2f62606e1d07d2","amp;dn":"Couples+Therapy+Season+2+WEB-DL.x264","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dcbd0f88d3a6affa37a462963d2f62606e1d07d2","infoHashBuffer":{"type":"Buffer","data":[220,189,15,136,211,166,175,250,55,164,98,150,61,47,98,96,110,29,7,210]},"announce":[],"urlList":[]}}