{"title":"Johnny Cash - I Walk The Line (Beat Club) (2nafish)","uid":5635314,"size":94234628,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:dccd6df5a7e2161c99fbed8c56e0b95deb8b3309&amp;dn=Johnny+Cash+-+I+Walk+The+Line+%28Beat+Club%29+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1276820701,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;I Walk the Line&quot; is a song written by Johnny Cash and recorded in 1956. A 1970 movie drama of the same name, starring Gregory Peck, featured a soundtrack of Johnny Cash songs including the title song. In 2005, a biographical film entitled Walk the Line was produced starring Joaquin Phoenix as Johnny Cash and Reese Witherspoon as June Carter, directed by James Mangold.\n\nThe song appears on the game Karaoke Revolution Country.\n\nCash scored his first number one hit with the song and it is the source of the title of the 2005  biopic Walk the Line (as well as the non-biographical 1970 movie mentioned above).\n\nThe song is very simple and like most Cash songs, the lyrics tell more of a story than the music conveys. (You've got a way to keep me on your side/You give me cause for love that I can't hide/For you I know I'd even try to turn the tide).\n\nIt is based upon the &quot;boom-chicka-boom&quot; or &quot;freight train&quot; rhythm common in many of Cash's songs. In the original recording of the song, there is a key change between each of the five verses, and Cash hums the new root note before singing each verse. The final verse, a reprise of the first, is sung a full octave lower than the first verse. According to Cash, he loved the sound of a snare drum, but drums were not used on country music back then, so he placed a piece of paper in his guitar strings and created his own unique &quot;snare drum&quot;. From that point onwards, at many concerts, Cash would tell the story and perform the song the same way.\n\nThe unique chord progression for the song was inspired by an accidental backwards playback on Cash's tape recorder while he was in the Air Force. Later, he wrote the lyrics in a backstage dressing room in Gladewater, Texas in 1955, after a discussion with fellow performer Carl Perkins encouraged him to adopt &quot;I Walk the Line&quot; as the song title. Cash originally intended the song as a slow ballad, but producer Sam Phillips preferred a faster arrangement, which Cash grew to like as the uptempo recording met with success.\n\nOnce while performing the song on his TV show, Cash told the audience, with a smile, &quot;People ask me why I always hum whenever I sing this song. It's to get my pitch.&quot; The humming was necessary since the song required Cash to change keys several times while singing it.\n\nThe song was originally recorded at Sun Studio on April 2, 1956, and was released on May 1. It spent six weeks at the top spot on the U.S. country Juke Box charts that summer, one week on the C&amp;W Jockey charts and number two on the C&amp;W Best Seller charts. &quot;I Walk the Line&quot; crossed over and reached number nineteen on the pop music charts.\n\nThe song was re-recorded four times during Cash's career. In 1964 for the I Walk the Line album, again in 1969 for the At San Quentin album, in 1970 for the I Walk the Line soundtrack, and finally in 1988 for the Classic Cash: Hall of Fame Series album.\n\nIn 2004, Rolling Stone ranked the song at #30 on their list of the 500 Greatest Songs of All Time.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:dccd6df5a7e2161c99fbed8c56e0b95deb8b3309","amp;dn":"Johnny+Cash+-+I+Walk+The+Line+%28Beat+Club%29+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dccd6df5a7e2161c99fbed8c56e0b95deb8b3309","infoHashBuffer":{"type":"Buffer","data":[220,205,109,245,167,226,22,28,153,251,237,140,86,224,185,93,235,139,51,9]},"announce":[],"urlList":[]}}