{"title":"A Brief History of Cocaine","uid":7824626,"size":8690241,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dd19071f98ce3ffdcae01fcb8ba5c5187968d52b&amp;dn=A+Brief+History+of+Cocaine&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mdusanjay","files":1,"time":1352903535,"description":"\nSteven B. Karch MD FFFLM, &quot;A Brief History of Cocaine&quot;\nEnglish | ISBN: 0849397758 | 2005 | PDF | 224 pages \n\nA Brief History of Cocaine, Second Edition provides a fascinating historical insight into the reasons why cocaine use is increasing in popularity and why the rise of the cocaine trade is tightly linked with the rise of terrorism The author illustrates the challenges faced by today's governments and explains why current anti-drug efforts have had only a limited effect on this global market.\n\nThis updated edition reexamines the impact of cocaine production, trade, and consumption on society beginning in the 16th century. It shows how the commercialization of cocaine was driven by cartels of Swiss and German pharmaceutical companies and private enterprises across Europe, Asia, and the United States. The author shows how government policies slowly transformed from trade, shipping, and manufacturing regulations, with little or no success in stemming the flow of drugs. The book describes how anti-drug laws, treaties, and costly initiatives involving crop substitution, crop suppression, interdiction, and international cooperation were first attempted more than 400 years ago and why these strategies failed for Colonial Spain and later backfired on the League of Nations. The author shows how economic necessity among growers, the environmental impact of pesticides, the potential for genetic engineering of coca plants, and other loopholes have actually been counterproductive, undermining the current efforts to curb the cocaine trade.\n\nFeaturing new and reorganized chapters, A Brief History of Cocaine, Second Edition contains the latest data and statistics relating drug trafficking to terrorism, and explains recent trends in worldwide production, consumption, cost competition, and international transport. This book offers a well-rounded historical perspective that is ideal for criminal justice practitioners, teachers, students, and anyone interested in this topic.","torrent":{"xt":"urn:btih:dd19071f98ce3ffdcae01fcb8ba5c5187968d52b","amp;dn":"A+Brief+History+of+Cocaine","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd19071f98ce3ffdcae01fcb8ba5c5187968d52b","infoHashBuffer":{"type":"Buffer","data":[221,25,7,31,152,206,63,253,202,224,31,203,139,165,197,24,121,104,213,43]},"announce":[],"urlList":[]}}