{"title":"HISTORY OF POP AND ROCK MUSIC - part 578","uid":11715573,"size":569642780,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:dd23f11a661f34d498257d77c44c56f45fc285d2&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+578&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"pupovaczlatko","files":10,"time":1424554904,"description":"\n\n                          T.REX  -   Hot Love  (1971)\n                          SHOCKING BLUE  - Oh Lord  (1973)\n                          PILOT  -  Magic   (1974)\n                          BROTHERHOOD OF MAN  -  Lady  (1974) \n                         \n\n\n            &quot;Hot Love&quot; is a song by the British glam rock band T. Rex, released in 1971. It was the group's first number one on the UK Singles Chart, where it remained at the top for six weeks beginning in March 1971. It was also the first song to feature Howard Kaylan and Mark Volman (ex-The Turtles) on backing vocals, the single, however, did not fare as well in the US, where it only peaked at number 72 on the Hot 100. The song reached number 47 in Canada in June 1971 and number 12 in South Africa.\n\n            &quot;Magic&quot; is a popular 1974 song by Scottish pop rock band Pilot, and was the first hit single for the group. It was written by William Lyall and Pilot's David Paton for their debut album, From the Album of the Same Name.  It charted most successfully in Canada, where it reached No. 1, topping the RPM national singles chart on 19 July 1975, and received a gold certification. It climbed as far as #11 on the UK Singles Chart and reached No. 5 during the summer of 1975 in the United States on the Billboard Hot 100.\n\n            Shocking Blue was founded in 1967 by Robbie van Leeuwen. The group had a minor hit in 1968 with &quot;Lucy Brown is Back in Town&quot;. After Mariska Veres took over the vocals, the group charted a world-wide hit with the song &quot;Venus&quot;, which peaked at No. 3 in the Netherlands in 1969. The song reached No. 1 on the U.S. Billboard Hot 100 in February 1970. It subsequently sold 350,000 copies in Germany, and topped the U.S. chart for three weeks, the first song from the Netherlands to do so. It sold over one million copies there by January 1970, and received a gold record awarded by the Recording Industry Association of America. Global sales exceeded five million copies. Later songs - including &quot;Hello Darkness&quot; (1970), &quot;Shocking You&quot;, &quot;Blossom Lady&quot; and &quot;Out of Sight, Out of Mind&quot; (1971), &quot;Inkpot&quot;, &quot;Rock in the Sea&quot; and &quot;Eve and the Apple&quot; (1972) and &quot;Oh Lord&quot; (1973) were successful in Europe, Latin America and Asia, but failed to chart in the U.S..\n\n             &quot;Lady &quot; is a song written by  Tony Hiller. The song is the third track on  Brotherhood of Man' s album &quot;Good Things Happening &quot;.(1974)  &quot;Good Things Happening&quot; is the first album released by the new lineup of pop group Brotherhood of Man. This lineup consisted of Martin Lee, Lee Sheriden, Nicky Stevens and Sandra Stevens and was to be the main lineup of the group's history and would hold for the next ten albums","torrent":{"xt":"urn:btih:dd23f11a661f34d498257d77c44c56f45fc285d2","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+578","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd23f11a661f34d498257d77c44c56f45fc285d2","infoHashBuffer":{"type":"Buffer","data":[221,35,241,26,102,31,52,212,152,37,125,119,196,76,86,244,95,194,133,210]},"announce":[],"urlList":[]}}