{"title":"The Fat Switch by Dr. Richard Johnson (PDF)","uid":10126581,"size":95019668,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:deebd01f6a3b3c5fc02d65e5c8ea17b6deca2f52&amp;dn=The+Fat+Switch+by+Dr.+Richard+Johnson+%28PDF%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1399771356,"description":"The classic teaching is that too much food intake plus too little exercise equals fat. However, this book makes the strong case that obesity does not result from gluttony and idleness, but rather because we have activated a &quot;fat switch&quot; similar to that used by animals in the wild to increase fat stores. In this book Dr Johnson takes the reader on a medical detective story to find the fat switch and to learn how to reverse it to bring back health once more. The story includes discussions of emperor penguins, the art of Peter Paul Rubens; Friar Tuck; Falstaff; the Columbian World Exposition of 1893; the Yanomamo Indians of Venezuela; the Inuit of the Arctic, San women with steatopygy (characterized by massive behinds); the gastric brooding frog (possibly extinct); hummingbirds; the desert gerbil; the gray whale; the bar-tailed godwit; the marine clam worm; and the great racehorse Secretariat. The story includes studies of wild animals, laboratory based experiments, clinical research, and history. Dr Richard Johnson makes the compelling case that certain foods, especially fructose from added sugars, may be driving the epidemics of obesity and diabetes. The book not only makes a compelling case for how the fat switch is turned on, but also state of the art science on how to prevent, treat, and potentially cure obesity. The book is highly illustrated (68 figures) and highly referenced, but is aimed for the lay reader who wants to know not only how to prevent and cure obesity but why it is occurring so rampantly in society.\n\n","torrent":{"xt":"urn:btih:deebd01f6a3b3c5fc02d65e5c8ea17b6deca2f52","amp;dn":"The+Fat+Switch+by+Dr.+Richard+Johnson+%28PDF%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"deebd01f6a3b3c5fc02d65e5c8ea17b6deca2f52","infoHashBuffer":{"type":"Buffer","data":[222,235,208,31,106,59,60,95,192,45,101,229,200,234,23,182,222,202,47,82]},"announce":[],"urlList":[]}}