{"title":"Video Production Handbook 4th Edition{BBS}","uid":6698484,"size":47057785,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:df1f50bb7dc64a6bb14bb80593d46b77d627cc52&amp;dn=Video+Production+Handbook+4th+Edition%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1316870947,"description":"Techniques matter! Great ideas don't automatically translate into great programs. It's not enough simply to show what is going on. The way you present your subject will influence how your audience responds. You need to choose your picture and sound carefully, to convey your ideas in an interesting, persuasive way. This book will show you how.\n\nVideo Production Handbook shows the full production process, from inception of idea to final distribution. The book focuses especially on why each step occurs as it does and provides guidance in choosing the simplest methods of creating the shots you want in your video project. Concentrating on the techniques and concepts behind the latest equipment, this book demonstrates the fundamental principles needed to create good video content on any kind of budget.\n\nSuitable for students and beginning videographers, the new edition of this classic text retains its clarity and directness but has been completely revised and updated.\n\nThis practical sourcebook has been specially prepared to give you an at-a-glance guide to quality video program-making on a modest budget. Emphasis throughout is on excellence with economy; whether you are working alone or with a small multi-camera group. The well-tried techniques detailed here will steer you through the hazards of production, helping you to avoid those frustrating, time-wasting problems, and to create an effective video program.\n\nFor many years Video Production Handbook has helped students and program-makers in a wide range of organizations. Now in its thoroughly revised 4th edition, Video Production Handbook guides you step-by-step, explaining how to develop your initial program ideas and build them into a successful working format. It covers the techniques of persuasive camerawork, successful lighting and sound treatment, and video editing. You will find straightforward up-to-the-minute guidance with your daily production problems, and a wealth of practical tips based on the authors' personal experiences.\n\n\n* Highly visual: hundreds of full-color illustrations demonstrate techniques\n* Modern: Up-to-date information on current equipment, techniques, and new distribution outlets such as the Web and mobile phones \n*  Balanced: Production techniques are covered in detail, but ideas and creative problem solving are given equal weight\n* A complete resource: Detailed teaching ancillaries are available for instructors\nSee all Editorial Reviews\nProduct Details\n\n    * Print Length: 352 pages\n    * Publisher: Focal Press; 4 edition (September 19, 2008)\n    * Language: English","torrent":{"xt":"urn:btih:df1f50bb7dc64a6bb14bb80593d46b77d627cc52","amp;dn":"Video+Production+Handbook+4th+Edition%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df1f50bb7dc64a6bb14bb80593d46b77d627cc52","infoHashBuffer":{"type":"Buffer","data":[223,31,80,187,125,198,74,107,177,75,184,5,147,212,107,119,214,39,204,82]},"announce":[],"urlList":[]}}