{"title":"Dance Derailism Volume 1 to 10","uid":6806777,"size":1767282718,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:df8c437112a2fc0c2078213e51adacf3cc03cfda&amp;dn=Dance+Derailism+Volume+1+to+10&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Derailist","files":-1,"time":1320891388,"description":"07-04-11 - Dance Derailism Vol. 10\n\nLike 'Who dat girl'? Then you're gonna love the remix! Champion was a is pretty nice too. This release is pretty girlish, not that that is bad because all tracks are nice, as usual.\nBitrate: 320kbit | Size: 178.8 MB | Length: 77:41\n\n    Far East Movement Ft. Ryan Tedder - Rocketeer (Frankmusic Rmx)\n    Nirvana - Smells Like Teen Spirit (G.Ros Cold Remix)\n    Flo Rida Ft. Akon - Who Dat Girl (Syskey Remix)\n    Loick Essien - Love Drunk (Seamus Haji &amp; Paul Emanuel Club Mix)\n    Pitbull Ft. T-Pain - Hey Baby (Amor &amp; V1t Remix)\n    Static Revenger &amp; Vandalism - Vegas (Solovey Remix)\n    Rio - When The Sun Goes Down (Dmitriy Beloff Bootleg '11)\n    Jessie J. - Do It Like A Dude (MyToyBox Extended Mix)\n    Ke$ha - We R Who We R (Funkefeller Remix)\n    Lady Gaga - Born This Way (Liam Keegan Club Mix)\n    Shontelle - Impossible (Superdef &amp; Jecto Club Mix)\n    Sultan &amp; Ned Shepard Ft. Nadia Ali - Call My Name (Spencer &amp; Hill Remix)\n    Chipmunk Ft. Chris Brown - Champion (MyToyBox &amp; Dave Silcox Extended Mix)\n\n30-03-11 - Dance Derailism Vol. 9\n\nThe'Natty Rico Sax Rework' of Illmerica by Wolfgang Gartner is something worth listening if you're into that style. I guess Scary Monsters &amp; Nice Sprites would've fit better in the Techno page, oh well now you'll have something completely different!\n\nBitrate: 320kbit | Size: 170.6 MB | Length: 78:12\n\n    Far East Movement Ft. Ryan Tedder - Rocketeer (Chew Mix)\n    Kaskade &amp; Tiesto Ft. Haley Gibby - Only You (Ken Loi Remix)\n    Lambda - Hold On Tight (Rutger Van Gelder Remix)\n    Micha Moor Ft. Terri B. - Keep On Rising\n    Wolfgang Gartner - Illmerica (Natty Rico Sax Rework)\n    Don Diablo Ft. Dragonette - Animale (Oliver Remix)\n    Klaas &amp; Bodybangers - Freak (Bodybangers Mix)\n    Pitbull Ft. T-Pain - Hey Baby (Aj Fire Remix)\n    Tony Igy - Astronomia (Fast Foot Remix)\n    William Naraine - If I Could Fall (Jack &amp; Joy Heavenly Remix)\n    Jesse Voorn Ft. Fab Morvan - Everything Is Possible (Robbie Rivera Remix)\n    Skrilles - Scary Monsters &amp; Nice Sprites (Zedd &amp; Disco Demons &amp; Audiolook Remix)\n    Paul Van Dyk Ft. Jennifer Brown - We Are Alive (Thomas Gold Remix)\n\n29-03-11 - Dance Derailism Vol. 8\n\nCheck out the 'Child In Time' remix by Kopernik! Decently mixed old with new! We all know Grenade by now, this remix just extends it's lifespan by a few weeks for me!\n\n Bitrate: 320kbit | Size: 168.1 MB | Length: 72:58\n\n    Tinchy Stryder Ft. Melanie Fiona - Let It Rain (7th Heaven Mix)\n    Enrique Iglesias - Tonight (Beatwalker Remix)\n    Ace Of Base - All For You (French Kiff Club Mix)\n    David Guetta -Just A Little More Love (Thomas Geel Remix)\n    Ian Carey Ft. Snoop Dogg &amp; Bobby Anthony - Last Night\n    Daniel Dee Ft. Soliaris - I Pray (Gain Trouble Remix)\n    Deep Purple - Child In Time (Kopernik In Rock Remix)\n    Kevin Rufold &amp; Lil Wayne - Let It Rock (Vit Remix) \n    Klubbheads - Hiphopping (Handyman &amp; Amor Remix)\n    Hurts - Sunday (Seamus Haji Radio Edit)\n    Far East Movement Ft. Ryan Tedder - Rocketeer (Bimbo Jones Club Mix)\n    Fragma Vs. Chuckie - Toca's Miracle (Mobin Master Bootleg)\n    Bruno Mars - Grenade (Passion Pit Remix)  \n\n22-03 - Dance Derailism Vol. 7\n\nIt has come to some sort of rhythm, one compilation a week. Sorry, I do act like I have a real life sometimes xD. I'm just whipping my hear back and forth for no reason whatsoever. Anyways, here's volume 7!\n\nBitrate: 320kbit | Size: 159.2 MB | Length: 72:34\n\n    Barbarellas - Body Rock (Riff &amp; Rays Extended Mix)\n    Adrian Lux - Teenage Crime (Axell &amp; Henrik B Remode)\n    Robyn - Hang With Me (Avicii's Exclusive Club Mix)\n    Uffie Ft. Pharrel - ADD SUV (Armand Van Helden Vocal Remix)\n    Burns &amp; Fred Falke - Y.S.L.M. (Treasure Fingers Remix)\n    McLean - My Name (Ian Carey Remix)\n    Switchfoot - Always (Max Vangeli &amp; AN21 Remix)\n    Wynter Gordon - Dirty Talk (Laidback Luke Remix)\n    Fatboy Slim &amp; Lazy Rich - Weapon Of Choice '10 (Lazy Rich Remix)\n    Edward Maya Ft. Vika Jigulina - Desert Rain (AG Remix)\n    Willow Smith - Whip My Hair (Funk3d Club Remix)\n    David Guetta - Just A Little More Love (Dj.Dstar '11 Big Room Remix)\n\n15-03 - Dance Derailism Vol. 6\n\nSix six six the numbers of the beast!\n\nBitrate: 320kbit | Size: 164.9 MB | Length: 71:39\n\n    Flo Rida Ft. Akon - Who Dat Girl (Promise Land Club Mix)\n    JLS Ft. Tinie Tempah - Eyes Wide Shut (Liam Keegan Club Mix)\n    Martin Solveig - Hello (Rave Radio Re-Shake)\n    Armin Van Buuren &amp; Sophie Ellis Baxtor - Not Giving Up On Love (Samuele Sartini Remix)\n    Fedde Le Grand - Put Your Hands Up For Detroit (Virus Remix)\n    Kristine - Boy Just Think Twice (Edward Maya Extended Rework)\n    Las Vegas - Set You Free (Scarmix &amp; Remakerz Remix)\n    Basto Vs. eSquire - Gregory's Not Over Now (eSquire Bootleg)\n    Deadmau5 - Raise Your Weapon (Ron Reeser Assault Mix)\n    Funkerman Ft. J.W. - Fallin' In Love (Digital Mode &amp; Layla Moore Remode)\n    Wadmue Project - King Of My Castle (Andreo Vandalize Remix)\n    Alesha Dixon Ft. Jay Sean - Every Little Part Of Me (Steve Smart &amp; Westfunk Radio Mix)\n\n08-03 - Dance Derailism Vol. 5\n\nThe 5th compilation! Nothing really special here, just a collection of awesome remixes! Well, the longest road is an outstanding track, check it out!\n\nBitrate: 320kbit | Size: 163.3 MB | Length: 74:40\n\n    Jls Ft. Tinie Tempah - Eyes Wide Shut (Funk3d Club Remix)\n    Lady Gaga - Just Dance (Patrick G. Remix)\n    Offer Nissim Ft. Maya - Freak Control (Club Mix)\n    Ultrabeat - Pretty Green Eyes (Love C '11 Remix)\n    Afrojack Vs. Way Out West Ft. Tricia Lee Kelshall - Replica Of Mindcircus (Dave Dresden Mashup)\n    Flo Rida Ft. Akon - Who Dat Girl (Deniz Koyu Remix)\n    Britney Spears - Hold It Against Me (Two Guys Remix)\n    Mike Posner - Please Don't Go (Hype Jones &amp; Pierce Fulton Remix)\n    Roger Sanchez - Lost '11 (Solovey Remix)\n    30 Seconds To Mars Ft. Kanye West - Hurricane (Nifra Bootleg)\n    Morgan Page - The Longest Road (Deadmau5 Remix + Marko Cindric Piano Intro Edit)\n    Carra &amp; Rudari Ft. Sam Wood - Music In Me (Lysark &amp; Da Brozz Remix)\n\n23-02 - Dance Derailism Vol. 4\n\n4th installment of the carefully selected dance genre music tracks!\n\nBitrate: 320kbit | Size: 181.9 MB | Length: 78:59\n\n    Laidback Luke - TimeBomb (Federand Remix)\n    Keri Hilson - Pretty Girl Rock (Cahill Club Mix)\n    Joachim Garraud - The Computer (Kaskade Mix)\n    Pendulum - The Island (Tom Fall Pjanoo Remix)\n    Redroche Vs. Armstrong - Make Your Move '11 (Tristan Garner Mix)\n    Rihanna - Only Girl (Philty House Remix)\n    Swedish House Mafia - One (Tigran Oganezov Rework)\n    Nelly Furtado - Night Is Young (Sylvane Club Mix)\n    Adam Lambert - If I Had You (Fabio Brand Rework Club Mix)\n    Jason Parker Ft. Jemini - Shine (Club Mix)\n    Rihanna - Only Girl (VinylBreaker Special 4 Sami Bootleg Mix)\n    Selena Gomez &amp; The Scene - Naturally (VinylBreaker Reworked Bootleg Mix)\n    Enrique Iglesias - Tonight (Bit Error Explicit Vocal Mix)\n\n22-02-11 - Dance Derailism Vol. 3\n\nThird Dance Derailism compilation. I personally like Raise Your Weapon from Deadmau5 very much!\n\nBitrate: 320kbit | Size: 175.6 MB | Length: 76:24\n\n    Robbie Rivera Ft. Ozmosis - Keep On Going (Cold Blank Remix)\n    Sirens - Bossy (Liam Keegan Radio Edit)\n    Enrique Iglesias - Tonight (Dresden &amp; Johnston Dirty Radio Edit)\n    Alex Milano &amp; Yastreb - Pretty Fly '11 Booty Mix)\n    Eminem Ft. Lil Wayne - No Love (Justin Sane Remix)\n    Taio Cruz Ft. Kylie - Higher (Justin Sane Club Mix)\n    Usher - More (Olli Collins &amp; Fred Portelli Remix)\n    Daft Punk - Fall (DLG Lazor Legacy Mix)\n    Deadmau5 - Raise Your Weapon (Justin Michael Rework)\n    Rihanna Ft. Drake - What's My Name (Mikael Wills Remix)\n    Akon - Beautiful (BuzzShakerZz Remix)\n    Edward Maya Ft. Vika Jiguline - Desert Rain (Extended Mix)\n    Three 6 Mafia Ft. Tiesto Ft. Flo Rida &amp; Sean Kingston - Feel It (Ftampa Remix)\n    Enrique Iglesias Ft. Ludacris - Tonight (Richard Vission Solmatic Remix)\n\n19-02-11 - Dance Derailism Vol. 2\n\nThe second music compilation dubbed Dance Derailism!\n\nBitrate: 320kbit | Size: 156.2 MB | Length: 73:41\n\n    The Prodigy - Warriors Dance (Far Too Load RmX)\n    Rihanna - Love The Way You Lie Part II (Stack Club RmX)\n    Stromae - House Lielujah (Shameboy RmX)\n    Schilled Ft. Anggun - Innocent Lies (Jerry Ropero &amp; Stefan Gruenwald RmX)\n    Jodie Conner - Now Or Never (Dawood Club Mix)\n    Rihanna Ft. Drake - What's My Name (Lorri Reconstruction Mix)\n    Adele - Rolling In The Deep (Keljet RmX)\n    Flo Rida - Turn Around (Steve Smart &amp; WestFunk Radio Edit)\n    Bruno Mars - Grenade (Curis RmX)\n    Usher - Dj Got Us Fallin In Love Again (Jump Smokers Radio Edit)\n    The Ting Tings - Hands (Ralphi Rosario Radio Edit)\n    Florence And The Machine - Cosmic Love (David Berrie RmX)\n    Coolio - Gangstas Paradise '10 (Video Mix)\n    Inna - Sun Is Up (Feel It Music '11 Club Mix)\n\n08-02-11 - Dance Derailism Vol. 1\n\nThe first of many Dance compilation to come! 320kbit mp3!\n\nBitrate: 320kbit | Size: 167.3 MB | Length: 74:09\n\n    Duffy - Well, Well, Well (Dan Clare Club Remix)\n    Asian Trash Boy - Whisper (Black Sushi Remix)\n    GrooveshakerZ - Don't Leave Me Again (Club Rework)\n    Dan Balan - Justifiy Sex (Nik Blaze &amp; Perov Extended Remix)\n    Madina - You &amp; I (Fifth Avenue Mix)\n    Pendulum - The Island (Madeon Remix)\n    Sia - Clap Your Hands (Fred Falke Remix)\n    Akon - Right Now (UniSelf Radio Edit)\n    DMX - X Gon' Give It To Ya (Sunglasses Dj's Club Mix)\n    Laurent Wolf - No Stress (Naytove &amp; Dirty Neats Remix)\n    Nelly - Just A Dream (Braincreator Sexy Remix)\n    Usher - More (RedOne Jimmy Joker Remix)\n    4 Strings - Summer Sun (Relaxion Remix)\n    Kaskade &amp; TiÃƒÂ«sto Ft. Haley Gibby - Only You\n    September - Resuscitate Me (Buzz Junkies Radio Edit)\n    Usher - Dj Got Us Falling In Love Again (Adrian Blasco &amp; Sergi Moreno Remix) ","torrent":{"xt":"urn:btih:df8c437112a2fc0c2078213e51adacf3cc03cfda","amp;dn":"Dance+Derailism+Volume+1+to+10","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df8c437112a2fc0c2078213e51adacf3cc03cfda","infoHashBuffer":{"type":"Buffer","data":[223,140,67,113,18,162,252,12,32,120,33,62,81,173,172,243,204,3,207,218]},"announce":[],"urlList":[]}}