{"title":"VirtualBox 5.0.14 [MAC OS X]","uid":13462009,"size":94424613,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:dfafbc2a628bdbeddda160acd56040c13f33fe74&amp;dn=VirtualBox+5.0.14+%5BMAC+OS+X%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"iAlexander","files":1,"time":1454891565,"description":"MADE IN UKRAINE\r\n\r\nVirtualBox 5.0.14 – x86 virtualization software.\r\n\r\nVirtualBox is a family of powerful x86 virtualization products for enterprise as well as home use. Not only is VirtualBox an extremely feature rich, high performance product for enterprise customers, it is also the only professional solution that is freely available as Open Source Software under the terms of the GNU General Public License (GPL).\r\nPresently, VirtualBox runs on Windows, Linux and Mac hosts and supports a large number of guest operating systems including but not limited to Windows (NT 4.0, 2000, XP, Server 2003, Vista, Windows 7, Windows 8, Windows 10), DOS/Windows 3.x, Linux (2.4, 2.6, 3.x and 4.x), Solaris and OpenSolaris, OS/2, and OpenBSD.\r\nVirtualBox is being actively developed with frequent releases and has an ever growing list of features, supported guest operating systems and platforms it runs on. VirtualBox is a community effort backed by a dedicated company: everyone is encouraged to contribute while innotek ensures the product always meets professional quality criteria.\r\n\r\nWhat's new in version 5.0.14:\r\n- GUI: properly limit the number of VCPUs to the number of physical cores on OS X.\r\n- Audio: fixed a bug which prevented loading a saved state of a saved guests with HDA emulation.\r\n- Audio: don't crash if the backend is unable to initialize.\r\n- Audio: fixed audio capture on Mac OS X.\r\n- Storage: fixed a possible crash when attaching the same ISO image multiple times to the same VM.\r\n- BIOS: properly report if two floppy drives are attached.\r\n- USB: fixed a problem with filters which would not capture the device under certain circumstances.\r\n- ExtPack: black-list Extension Packs older than 4.3.30 due to incompatible changes not being properly handled in the past.\r\n- Windows hosts: fixed a regression which caused robocopy to fail.\r\n- Linux hosts: properly create the /sbin/rcvboxdrv symbolic link.\r\n- Mac OS X hosts: several fixes for USB on El Capitan.\r\n- Linux Additions: fixes for Linux 4.5.\r\n\r\nMADE IN UKRAINE","torrent":{"xt":"urn:btih:dfafbc2a628bdbeddda160acd56040c13f33fe74","amp;dn":"VirtualBox+5.0.14+%5BMAC+OS+X%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dfafbc2a628bdbeddda160acd56040c13f33fe74","infoHashBuffer":{"type":"Buffer","data":[223,175,188,42,98,139,219,237,221,161,96,172,213,96,64,193,63,51,254,116]},"announce":[],"urlList":[]}}