{"title":"Barbarella (1968) 720p BrRip x264 - CLOWNSEC (PhreakyFlix)","uid":9295862,"size":2681088202,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:dfd47c458540d7c9e362e0821da2d4371a287ab0&amp;dn=Barbarella+%281968%29+720p+BrRip+x264+-+CLOWNSEC+%28PhreakyFlix%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clownsec","files":-1,"time":1386152977,"description":"Barbarella (1968) 720p BrRip x264 - CLOWNSEC (PhreakyFlix)\n\n\nA voluptuous outer space agent travels to another galaxy in search of a missing inventor in this science fiction send-up. Barbarella (Jane Fonda), an interstellar representative of the united Earth government in the 41st century, is dispatched to locate scientist Durand Durand, whose positronic ray, if not recovered, could signal the end of humanity. Outfitted in an array of stunning Star Trek/Bond girl outfits and cruising around in a plush, psychedelic spaceship, Barbarella travels to the Tau Seti system and promptly crash-lands. She then spends the rest of the film discovering the joys of interstellar sex with a keeper of feral children (Ugo Tognazzi), a blind, beatific angel (John Phillip Law), and an inept revolutionary named Dildano (David Hemmings). Slowly but surely, she also finds her way to Durand Durand by moving from one exotic, Wizard of Oz-style locale to another. Along the way, she meets the kindly Professor Ping (a surprisingly verbal Marcel Marceau), a Eurotrash dominatrix named the Great Tyrant (Rolling Stones gal pal Anita Pallenberg), and the Concierge (Milo O'Shea), a strangely familiar lackey of the Great Tyrant who tries to destroy Barbarella with his great big organ of love. Jean-Claude Forest, who created the character Barbarella in 1962 for V-Magazine, served as visual advisor on the adaptation. The film's missing scientist character famously inspired the band name of '80s pop stars Duran Duran (who altered the spelling slightly). Almost two decades later, the film also inspired electronic act Matmos, which was named after the aqueous personification of evil unleashed by the Concierge at the movie's climax. ~ Brian J. Dillard, Rovi\n\nBROUGHT TO YOU BY CLOWNSEC * HONK *","torrent":{"xt":"urn:btih:dfd47c458540d7c9e362e0821da2d4371a287ab0","amp;dn":"Barbarella+%281968%29+720p+BrRip+x264+-+CLOWNSEC+%28PhreakyFlix%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dfd47c458540d7c9e362e0821da2d4371a287ab0","infoHashBuffer":{"type":"Buffer","data":[223,212,124,69,133,64,215,201,227,98,224,130,29,162,212,55,26,40,122,176]},"announce":[],"urlList":[]}}