{"title":"Cannabis Collection - Hemplands - the Hempire strikes back","uid":7438065,"size":2111705088,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:e0a9496e8b0b52f4792ed776711a7ce45aa46286&amp;dn=Cannabis+Collection+-+Hemplands+-+the+Hempire+strikes+back&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"GRNS3","files":-1,"time":1342138684,"description":"\n\nThe Cannabis Collection - a series of educative and entertaining info dvd's\n\nPlease enjoy, share with friends and seed :)\n\n\nHemplands Conspiracy - The Hempire strikes back - part 2\n\nHemp is one of the most useful crops in the history of history of history! It used to be legal, but not any longer. Anyone who wants to make a product from hemp like a hemp handbag ,a hemp dog collar, hemp baby clothes, hemp rope, hemp shoes,  or anything has to import their hemp from another country. George Washington was a hemp farmer and has been a major part of many countries economic systems. In fact the US Constitution was written on Hemp!\nFrom its introduction into our nation's Colonial cornucopia, to its sinister criminalization in more recent times, this two part series tells the shocking story of the most amazing and maligned member of the plant kingdom, Cannabis sativa.\nThis series features a rich archive of rare historic images and insightful observations by Ken Kesey, Dr. Thomas Clark, Gatewood Galbraith, Jack Herer, Woody Harrelson, Bill Maher and many others who follow the warp and weave of this fascinating, true story of how a simple green plant went from important cash crop to sinister outlaw, to subsidized war hero, to counterculture dropout and may yet return as an environmentally friendly economic force once again.\nIncludes two spellbinding full-length programs, rare photos, film and video, along with an unprecedented collection of interviews and appearances with the best-known, most credible Hemp and agriculture authorities in the world today.\n\n\nCheck this account for updates regularly :)\n\nThanks to the peers all over the globe seeding in this collection.\n\t\t\t\t\t\t\n\t\t","torrent":{"xt":"urn:btih:e0a9496e8b0b52f4792ed776711a7ce45aa46286","amp;dn":"Cannabis+Collection+-+Hemplands+-+the+Hempire+strikes+back","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e0a9496e8b0b52f4792ed776711a7ce45aa46286","infoHashBuffer":{"type":"Buffer","data":[224,169,73,110,139,11,82,244,121,46,215,118,113,26,124,228,90,164,98,134]},"announce":[],"urlList":[]}}