{"title":"Gun - Gun [1968][2000][320 KBPS][RMSTD]","uid":11786741,"size":180499056,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e0e01b04ea28ea109e05f86f652e28000853c893&amp;dn=Gun+-+Gun+%5B1968%5D%5B2000%5D%5B320+KBPS%5D%5BRMSTD%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"LameDuck69","files":16,"time":1427779747,"description":"Gun - Gun [1968][2000][RMSTD]\n\n\n\n01 Race With The Devil\n02 The Sad Saga Of The Boy And The Bee\n03 Rupert's Travels\n04 Yellow Cab Man\n05 It Won't Be Long (Heartbeat)\n06 Sunshine\n07 Rat Race\n08 Take Off\n09 Race With The Devil (Single Version)\n10 Sunshine (Single Version)\n11 Drives You Mad\n12 Rupert's Travels (Single Version)\n---------------------------------------\n**320 KBPS CBR\n**Cover Art\n---------------------------------------\n\nFrom Amazon:\n\n\nPsychadelics meet Heavy Metal. One of My Favorites. \n-------------------------------------------------------------------------------\nThis Hard Rock rarity is one of my all time favorites when it comes to 60's power trio pyrotechniques! &quot;Yellow Cab Man&quot; and &quot;It Wont Be Long&quot; are so catchy that you'll find yourself constantly reaching to turn up the volume. The great drum beats and acid guitar riffs make you wish this recording was twice as long. Rupert's Travels is the &quot;classical gas&quot; of Hard Rock! If you like late 60's / Early 70's Hard Rock I highly recommend this overlooked classic!! \n--------------------------------------------------------------------------------\nExceptional, creative, melodic, unique, yet simply hard rock.\n--------------------------------------------------------------------------------\nA pity this is so hard to get. In the late 60's early 70's, this one album was always referenced by the hard rockers in the Virginia Beach area. It is everything an album ought to be. Every song on the album is good. A good metal group today could update the sound and cut an entire new album from it, without any other material and have a hit. \n--------------------------------------------------------------------------------\nGreat rock &amp; roll album from the 60's.\n--------------------------------------------------------------------------------\nI have the original LP of this group. Its a rock album classic! Every song on this album is good. All songs have great melody , if not great rhythm. They write their own songs, good guitar playing and makes you drive faster. The only place where its dated is the last track. \n-------------------------------------------------------------------------------- Adrian and Paul Gurvitz might be better known for their travels with Ginger Baker in the Baker Gurvitz Army, but in the late '60s the brothers helmed the heavy rock trio Gun and caught a whiff of success in the U.K. with their debut single &quot;Race with the Devil.&quot; Using the less-ethnic surname Curtis, Adrian (guitar) and Paul (bass) teamed up with drummer Louis Farrell and pounded out some distinctive psych-flavored proto-metal. Floating about in the mix along with the guitar pyrotechnics and drum workouts are brass and string sections that aren't always welcome, but &quot;Race with the Devil&quot; uses these potentially square instruments well, adding texture to an otherwise brutal stomp. &quot;Yellow Cab Man&quot; is the highlight of the set, a hard pop number with a buzzing guitar hook and frantic, heavily distorted soloing from Adrian. The obligatory freak-out comes with the finale, the 11-minute &quot;Take Off&quot; which begins with the sound of jet roar, then explodes into feedback, drum solos, backward guitars, and silly psychedelic exhortations to &quot;take a deep breath and try to count to five.&quot; Elsewhere are half-baked orchestral interludes and some questionable songwriting chops, but the band is truly firing on all cylinders throughout and their interplay is solid like a fist. When Gun pours it on, the results are visceral and exciting enough to forgive the occasional wrong turn. The album artwork is impressively grotesque for the era, a flaming mass of squirming demons that wouldn't be out of place on a Slayer T-shirt today. There isn't any Satanism invoked in the grooves of Gun, but it's a lost gem for fans of the power trio format. \n--------------------------------------------------------------------------------\nGun emerged from The Knack (UK version) which featured Paul Gurvitz on guitar (moved to bass with Gun). They had a couple of singles with a minor chart hit - She Ain't No Good - and a healthy respect for the Kinks. One of the very best psych pop songs from the period was Lights On The Wall, which was recorded during the transition to Gun. Check out the classical guitar runs. Gun represented the arrival of Paul's younger brother, Adrian Gurvitz, on &quot;machine gun&quot; guitar (everyone was watching Alvin Lee dancing the frets and wanted a piece of it). Their debut single, Race With The Devil, was fast, furious and entertaining - and was covered by several bands later. What is generally overlooked is the surprising variety that Adrian and Paul brought to this debut LP including the blistering title track before the mood changes to classically tinged Rupert's Travels. The shameless Cream homage, Sunshine, is redeemed by a dandy guitar solo and another near chart hit. The only difficult track here is Take Off which is poorly mixed to begin with and, due to excessive overdubbing, has always bordered on high powered noise. This release adds some single versions of LP tracks plus a non-LP single, Drives You Mad - a blatent effort to re-capture Race With The Devil, mostly successfully. In an earlier Repertoire version of this release, both non-LP singles including Running Wild were included. Too bad that Lights on the Wall didn't make the cut. Adrian went on to a successful MOR song writing career with global smash, Classic and personal favorite, No Fears In the Night, which almost captures the Gun glory. Paul worked with George Martin on a dandy couple of LPs with Brian Parrish on guitar (famous for the guitarwork on the Badger debut LP). Gunsight, their 2nd LP will probably be reissued shortly with a couple of really standout tracks to recommend, Head In The Clouds, with a very cool stereo mix and Angeline which has arguably one of the top 25 solos ever recorded. We can only hope that they can find room for Lights On The Wall","torrent":{"xt":"urn:btih:e0e01b04ea28ea109e05f86f652e28000853c893","amp;dn":"Gun+-+Gun+%5B1968%5D%5B2000%5D%5B320+KBPS%5D%5BRMSTD%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e0e01b04ea28ea109e05f86f652e28000853c893","infoHashBuffer":{"type":"Buffer","data":[224,224,27,4,234,40,234,16,158,5,248,111,101,46,40,0,8,83,200,147]},"announce":[],"urlList":[]}}