{"title":"Hostages.S01E03.HDTV.x264-LOL","uid":9017334,"size":223068178,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e0e4457547b65c4982cf8d9d938feee0a0fc34b0&amp;dn=Hostages.S01E03.HDTV.x264-LOL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Thhaque","files":2,"time":1381214214,"description":"Hostages\n\nGenre: Drama\nYear: 2013\nCountry: USA\nDirector: Jeffrey Nachmanoff \nCasts: Toni Collette, Quinn Shephard, Mateus Ward, Lola Cook, Tyler Elliot Burke and etc.\n\n.: Plot :.\nDr. Ellen Sanders, a premiere surgeon, is thrust into a chilling political conspiracy when her family is taken hostage by rogue FBI Agent Duncan Carlisle. Ellen and her family are held captive in their home by Carlisle, a desperate man doing the wrong thing for the right reasons, who orders her to assassinate the President when she operates on him. His highly skilled accomplices include his brother-in-law Kramer, whose loyalty to Carlisle will be tested; quick-tempered and intimidating Archer, an ex-military man with a razor-sharp tongue; and the only woman involved, Sandrine, a mysterious last-minute replacement to the team. With her family's life in peril, Ellen faces an incomprehensible moral dilemma in order to save her overbearing husband Brian, her secretive daughter Morgan and her not-so-innocent son Jake. In this high-stakes standoff between Ellen and Carlisle, fraught with tremendous national and personal consequences, the choices between right and wrong become even more blurred.","torrent":{"xt":"urn:btih:e0e4457547b65c4982cf8d9d938feee0a0fc34b0","amp;dn":"Hostages.S01E03.HDTV.x264-LOL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e0e4457547b65c4982cf8d9d938feee0a0fc34b0","infoHashBuffer":{"type":"Buffer","data":[224,228,69,117,71,182,92,73,130,207,141,157,147,143,238,224,160,252,52,176]},"announce":[],"urlList":[]}}