{"title":"7 Days to Die A12.5 (64-bit Windows) ","uid":12278776,"size":1059792082,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e11967446b249e5bdfbc8a290b9c1a14543bb793&amp;dn=7+Days+to+Die+A12.5+%2864-bit+Windows%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Neowarex","files":1,"time":1440387498,"description":"This is the Alpha 12.5 version. Cracked originally by 3DMGAME and adapted to 12.5 by Gamematrix. Ready to play!\n\nAlthough for some odd reason the torrent shows 1 seeder for a long time, not only am I seeding this from a dedicated server (1gbit up/down) there are also several other seeders.\n\nFor those who have this version and want to play online, you're welcome to join our server at:\n\nServer:or 198.50.154.222 port 26900\n\nOur server has several custom anti cheat protections and will permanently ban you if you exploit/cheat on our server.\n\nThe info is also posted on the website at\n\nWe also highly recommend using Teamspeak at the same IP in order to team up with other players and get the news and the newest version!\n\nOpen 24/7, Full PVP with air drops and a lot of zombies and bears!\n\nWe have banned and will continue to ban all cheaters permanently from the server, this version has helped protect against cheating very well.\n\n===========================================\nPLEASE DO NOT FORGET TO\n\nChange your USERNAME and STEAMACCOUNTID on the 3DMGAME.INI file located in the game folder in order to avoid issues while joining servers.\nSteamAccountID must be changed TO A RANDOM NUMBER BETWEEN 1 AND 4294967295 (WE RECOMMEND A HIGH NUMBER TO AVOID GETTING THE SAME ID AS SOMEONE ELSE)\n\n===========================================\n\nPLEASE SUPPORT THE DEVELOPERS AND BUY THE GAME IF YOU LIKE IT AND CAN AFFORD IT! IT TRULY IS A MASTERPIECE IN THE MAKING AND WE HAVE BOUGHT MANY COPIES ALREADY!\n\nWE OFFER THE CRACKED SERVER SO THOSE LESS FORTUNATE CAN ALSO ENJOY THE GAME!\n\n\nEnjoy!","torrent":{"xt":"urn:btih:e11967446b249e5bdfbc8a290b9c1a14543bb793","amp;dn":"7+Days+to+Die+A12.5+%2864-bit+Windows%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e11967446b249e5bdfbc8a290b9c1a14543bb793","infoHashBuffer":{"type":"Buffer","data":[225,25,103,68,107,36,158,91,223,188,138,41,11,156,26,20,84,59,183,147]},"announce":[],"urlList":[]}}