{"title":"Blue Floyd - Begins [320k MP3]","uid":11610359,"size":345145764,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e16c1790d88099fced0e53ff02d65023048998b6&amp;dn=Blue+Floyd+-+Begins+%5B320k+MP3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"smbdownload","files":-1,"time":1417445217,"description":"BLUE FLOYD endeavors to deconstruct the classic compositions of the legendary PINK FLOYD into their primal, elemental form. As much an homage to the influence of Howlin' Wolf, Willie Dixon and Muddy Waters as a rediscovery of both FLOYD classics and rarities, BLUE FLOYD plays iconoclastically familiar songs, heard again as if for the first time.\n\nBEGINS features the original BLUE FLOYD line-up of Allen Woody (Gov't Mule / Allman Brothers Band), Matt Abts (Gov't Mule / Dickey Betts Band), Marc Ford (The Black Crowes / Burning Tree), Johnny Neel (The Allman Brothers Band), Berry Oakley Jr. (Robby Krieger / Bloodline). In 2000 a bunch of musicians from some of the best jam bands - like Black Crowes, Allman Brothers, Gov't Mule - got together to play the music of Pink Floyd. The shows soon got legendary and as this wonderful release shows with very good reason.\n\nMuch like the Mahavishnu Project this is superb musicians interpreting some classic material and really putting their own stamp on it. In fact they are taking the music of PF and taking it to new and strange places. Seemingly intended to blow the minds of the audience as well as themselves.\n\nMark Ford on some creative guitar, Matt Abs who quite simply is one of the best drummers around, Johnny Neal a deeply psychedelic keyboardplayer and fine harpsolist, the late, great Allan Woody on div. stringed instruments and Berry Oakley, Jr. on some rather discreet bass. Together they make some pure, profound, psychedelic fun. As a bonus we get two Beatles tracks.\n\n\nTrack Listing [320k MP3]\n\nDisc: 1\n\n1. HAL 9000 Intro / Shine On You Crazy Diamond\n2. Have A Cigar\n3. Fearless\n4. Interstellar Overdrive / Wish You Were Here\n5. Drums\n6. Set The Controls For The Heart Of The Sun\n7. Hey You / Another Brick In The Wall Pt. 2\n\nDisc: 2\n\n1. In The Flesh / Sheep\n2. Money\n3. Us &amp; Them / Jam\n4. Young Lust\n5. Beatjam - Come Together\n6. Beatjam - Taxman","torrent":{"xt":"urn:btih:e16c1790d88099fced0e53ff02d65023048998b6","amp;dn":"Blue+Floyd+-+Begins+%5B320k+MP3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e16c1790d88099fced0e53ff02d65023048998b6","infoHashBuffer":{"type":"Buffer","data":[225,108,23,144,216,128,153,252,237,14,83,255,2,214,80,35,4,137,152,182]},"announce":[],"urlList":[]}}