{"title":"Worms","uid":6032119,"size":12234284,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e1b5d12608d8a3163c63fded19d40d15ad6c7c47&amp;dn=Worms&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"FatFreddy16","files":2,"time":1292112685,"description":"Worms is an artillery video game developed by Team17 and released in 1995. It is the first game in the Worms series of video games and was initially only available for the Amiga. Later it was ported to other platforms.\n\nWorms is a turn based game where a player controls a team of worms against other teams of worms that are controlled by a computer or human opponent. The aim is to use various weapons to kill the worms on the other teams and have the last surviving worm(s).\n\nWorms is a turn based artillery game, similar to other early games in the genre such as Scorched Earth. The game is set on a two-dimensional field. The players control a team of worms, each consisting of four members. The objective is to kill every member of the opposing team(s) within a set time limit per round. Each turn, which lasts from 45 to 100 seconds, a player may move a selected worm and use one or more of the available weapons and tools.\n\nThe weapons include simple firearms like the shotgun and uzi, alongside a variety of heavy weapons such as the bazooka (the default selection), cluster grenades and airstrikes. The game also includes a number of 'secret' weapons (available through cheat codes on options screens or 'weapon drops' during the game) such as the Banana Bomb and exploding sheep, for which the series has become famous.\n\nAlso available are various tools such as the 'girders' - primarily used to add protection - as well as the 'drill', 'blowtorch' and 'ninja rope', which are primarily available for greater mobility across the playing field.","torrent":{"xt":"urn:btih:e1b5d12608d8a3163c63fded19d40d15ad6c7c47","amp;dn":"Worms","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1b5d12608d8a3163c63fded19d40d15ad6c7c47","infoHashBuffer":{"type":"Buffer","data":[225,181,209,38,8,216,163,22,60,99,253,237,25,212,13,21,173,108,124,71]},"announce":[],"urlList":[]}}