{"title":"Male, Female: The Evolution of Human Sex Differences [2nd Ed]","uid":10026227,"size":37442843,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e1dc29775c3977911736a32cacc8118a92fc7f1d&amp;dn=Male%2C+Female%3A+The+Evolution+of+Human+Sex+Differences+%5B2nd+Ed%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"Parad0x1","files":-1,"time":1398272526,"description":"Male, Female - The Evolution of Human Sex Differences [Second Edition] (2009) by David C. Geary.pdf\n\nWhy do girls tend to earn better grades in school than boys? Why are men still far more likely than women to earn degrees in the fields of science, technology, engineering, and mathematics? And why are men on average more likely to be injured in accidents and fights than women? These and many other questions are the subject of both informal investigation in the media and formal investigation in academic and scientific circles. In his landmark book Male, Female: The Evolution of Human Sex Differences, author David Geary provided the first comprehensive evolutionary model to explain human sex differences. Using the principles of sexual selection such as female choice and male-male competition, the author systematically reviewed and discussed the evolution of sex differences and their expression throughout the animal kingdom, as a means of not just describing but explaining the same process in Homo sapiens. Now, over ten years since the first edition, Geary has completed a massive update, expansion and theoretical revision of his classic text. New findings in brain and genetic research inform a wealth of new material, including a new chapter on sex differences in patterns of life history development; expanded coverage of genetic research (e.g. DNA finger printing to determine paternity as related to male-male competition in primates); fatherhood in humans; cross-cultural patterns of sex differences in choosing and competing for mates; and genetic, hormonal, and socio-cultural influences on the expression of sex differences. Finally, through his motivation to control framework (introduced in the first edition and expanded in The Origin of Mind, 2005), Geary presents a theoretical bridge linking parenting, mate choices, and competition, with children's development and sex differences in brain and cognition. The result is an even better book than the original--a lively and nuanced application of Darwin s insight to help explain our heritage and our place in the natural world.\n\n555 pages\nPublisher: American Psychological Association (APA); 2 edition (November 1, 2009)\nLanguage: English\nISBN-10: 1433806827\nISBN-13: 978-1433806827","torrent":{"xt":"urn:btih:e1dc29775c3977911736a32cacc8118a92fc7f1d","amp;dn":"Male%2C+Female%3A+The+Evolution+of+Human+Sex+Differences+%5B2nd+Ed%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1dc29775c3977911736a32cacc8118a92fc7f1d","infoHashBuffer":{"type":"Buffer","data":[225,220,41,119,92,57,119,145,23,54,163,44,172,200,17,138,146,252,127,29]},"announce":[],"urlList":[]}}