{"title":"ABIT BX166M drivers","uid":12753907,"size":141795174,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:e228cf5b35a70806425fdd982d3b04b715e02db0&amp;dn=ABIT+BX166M+drivers&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Fox-1","files":1,"time":1447421997,"description":"*** Read Me First ***\r\n\r\n\r\nDear Customer:\r\n\r\nWelcome to the ABIT Computer Corporation products CD-ROM. \r\n\r\nOn this disc we have provided a lot of useful information for your convenience. Please first \r\nread the information below.\r\n\r\nNote: For the best screen capture quality, install the VGA drivers and set desktop\r\nto 800*600 using True color.\r\n\r\n*****************\r\n* User's Manual *\r\n*****************\r\n\r\nThe User's manuals are provided as Adobe PDF files. These PDF files provide extra information \r\nsuch as graphics showing the BIOS screens. If you do not already have an Adobe Reader, you \r\nshould go to the &quot; Acrobat Reader Install &quot; section first, then install the reader to read the \r\nuser's manuals.\r\n\r\nAlso, on some ABIT CD-ROMs we have provided several listings for motherboard models using the \r\nsame chipset (and same drivers) on the same CD-ROM. If there is more than one model on this \r\nCD-ROM, then please choose the model(s) and the appropriate languages from the given choices.\r\n\r\n***********\r\n* Drivers * \r\n***********\r\n\r\nIn this section we have provided &quot;IDE Master&quot; drivers and the &quot;PCI Bridge Driver For Windows 95&quot;\r\n(Intel 82371xB INF Installer) as well as &quot; Flash &quot; utility files and an &quot;IDE HDD low level \r\nFormat utility&quot;. \r\n\r\n*&quot;IDE Master&quot; includes Windows 95, Windows NT and OS/2 IDE Bus Master drivers. You can choose\r\n the appropriate operating system according to the OS that you use and install that driver. \r\n\r\n*In the &quot;Flash&quot; section you will need to save the file first to a floppy disk in your floppy \r\n drive before moving the file to your hard drive and executing it.  Please read the text file in \r\n this folder first.  This utility facilitates flashing your BIOS to a newer version if necessary.\r\n\r\n*Direct click &quot;PCI Bridge Driver For Windows 95&quot; in this section, then you can install the Intel \r\n 82371xB INF driver for Windows 95.  This driver solves the Windows 95 &quot;PCI Bridge&quot; identity \r\n problem. (i.e., eliminates the question mark appearing in the PCI Bridge section.)\r\n\r\n*&quot;IDE HDD Low Level Format Utility&quot; provided by AWARD. You must be careful to use this low level  \r\n hard disk formatting utility.  In most situations you will not have any need to use this \r\n particular program.\r\n\r\n*Ultra ATA/66 Driver: Although we have provide the Ultra ATA/66 driver diskette, for backup\r\n reasons, we put the driver on the CD-ROM. Therefore, if you lose your Ultra ATA/66 driver \r\n diskette or your diskette is damaged, you still can get the driver from the CD-ROM.\r\n \r\n\r\nNote: Please install the Intel 82371xB INF driver first, then you will be able to install the \r\n      IDE Bus Master driver as well. \r\n\r\n************\r\n* Web Site *\r\n************\r\n\r\nWe have also included the contents of the ABIT Web Site for your convenience, please take this \r\nopportunity to check the site out more closely. It has lots of useful information. \r\n\r\n*These files are in both the html folder and index.htm files.\r\n*News and BIOS updates pages will not be able to be read and or downloaded. Please go to \r\n our WEB site to retrieve the most current news and BIOS updates.\r\n\r\n****************\r\n* Screen Saver *\r\n****************\r\n\r\nYou are welcome to install our cool ABIT Screen Saver for your enjoyment.  The screen saver \r\nprogram included can be used with Windows 3.1, Windows 95 and Windows NT. \r\n\r\n    You can install our Screen Saver with music (abitsvt.exe) or without music \r\n    (abitsv.exe). Due to the file size we have provided you with two choices.\r\n\r\n    *For Windows 3.1, please run abitsv31.exe.\r\n    *These three files can be found in the directory scrnsavr, please enjoy it!\r\n\r\n*************************************\r\n* Adobe Acrobat Reader Installation *\r\n*************************************\r\n\r\nGo to this section to Install the Adobe Acrobat Reader, so that you can read the PDF files \r\nin our User's Manual section.\r\n\r\n*****************\r\n* Freeware Area *\r\n*****************\r\n\r\nWe have provided two useful programs for you, one is Inforia Quest 98 (IQ98),and the other is \r\nthe PointCast business network, OEM version.  You can go to the respective directory to read \r\nthe &quot;Readme.txt&quot; or &quot;Readme.doc&quot; file for more detailed information about these two software \r\nprograms separately.\r\n\r\n************************\r\n* HighPoint XStore Pro *\r\n************************\r\n\r\nWe have provided a useful and powerful utility in our product package, HighPoint Xstore Pro. \r\nXStore Pro is a hard disk enhancement utility which can improve system performance.\r\n\r\nWhen you install XStore Pro, you can choose to install CD Xpress at the same time. CD Xpress\r\nwas created to accelerate the accessing speed of the CD-ROM drive by utilizing the hard drive's \r\nhigh performance.\r\n\r\nFor detailed information, please refer to the appendix of the user's manual.\r\n\r\nNote: You can only install one Bus Master Driver at a time in your system, or the drivers will \r\n      result in conflict and cause system hangs. Please make sure you don't have any Bus Master \r\n      Driver installed in your system before you install XStore Pro! You must remove all \r\n      components of the previous Bus Master Driver before you install XStore Pro to your system.\r\n      For example, you cannot install both the Intel bus master driver and HighPoint XStore Pro \r\n      in your system, otherwise it will cause system conflicts when you install the second bus \r\n      master driver!\r\n\r\n************************\r\n*   Hardware Doctor    *\r\n************************\r\n\r\nWinbond Hardware Doctor is a self-diagnostic system for PCs and must be used with the Winbond \r\nchipset: W83781D/W83782D/W83783S IC series products. It will protect your PC hardware by \r\nmonitoring several critical items including power supply voltages, CPU &amp; system fan speeds, and \r\nCPU and system temperatures. \r\n\r\nFor detailed information, please refer to the appendix of the user's manual. Not every models in\r\nthis CD-ROM can support these functions.\r\n\r\n*******************\r\n* Readme Me First *\r\n*******************\r\n\r\nThis button will launch this file for you.\r\n\r\n\r\nNote: All brand names and trademarks are the property of their respective owners","torrent":{"xt":"urn:btih:e228cf5b35a70806425fdd982d3b04b715e02db0","amp;dn":"ABIT+BX166M+drivers","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e228cf5b35a70806425fdd982d3b04b715e02db0","infoHashBuffer":{"type":"Buffer","data":[226,40,207,91,53,167,8,6,66,95,221,152,45,59,4,183,21,224,45,176]},"announce":[],"urlList":[]}}