{"title":"[Clips4sale] Cory Chase - Sydney Cole in Major Dilema","uid":14778614,"size":359583727,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:e22a3735a483b819be00d528f8c6c79693f5a881&amp;dn=%5BClips4sale%5D+Cory+Chase+-+Sydney+Cole+in+Major+Dilema&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"enterdrone","files":1,"time":1464970665,"description":"Sydney_Cole_in_Major_Dilemmasd.mp4\r\nSize: 359583727 bytes (342.93 MiB), duration: 00:22:19, avg.bitrate: 2148 kb/s\r\nAudio: aac, 48000 Hz, stereo (und)\r\nVideo: h264, yuv420p, 960x540, 29.97 fps(r) (und)\r\n\r\nAdded: 4/3/16\r\n\r\nScene One: Thrill suck\r\n\r\nSydney loves the thrill of fucking in places she shouldn't be. The thought of getting caught sucking and fucking you makes her wet with anticipation. You and her break into her neighbors house and sneak into her bathroom. Just as Sydney is about to suck you off you hear Cory walk into her bedroom. It's not long before you hear moaning from the other room. Sydney watches as her neighbor masturbates on her bed.\r\n\r\nSydney! What are you doing in my bathroom! Cory screams. I'm going to call your mother She says. Quickly Sydney tries to talk her out of getting in trouble. You watch as Cory blackmails her to strip and give her a show. Cory rubs her pussy as Sydney strips naked and sucks your cock. The two girls rub themselves, Cory getting in on the action and sucking you. Your cock wet, Cory guides Sydney on top of you and masturbates as she fucks you.\r\n\r\nScene Two: Thrill fuck\r\n\r\nBeing guided and watched by the hot older woman is such a turn on for Sydney. Her breast bounce in you face as she fucks you. You push her down and fuck her on the bed in every way you can think of. Her young body and tight pussy keep you on the edge. Make her cum Cory demands, making out with Sydney and making her quiver.\r\n\r\nSydney cums and Cory thinks it's your turn. With the girls mouths open you cum all over their lust filled slutty faces. Share Cory tells her and the girls lick the cum off each other. This will have to happen again Cory demands.\r\nCategory: TABOO\r\nRelated Categories: TABOO, CUMSHOTS, MILF\r\nKeywords: sydney cole, taboo, luke longly, cory chase, blowjob, blow job, cum shot, fucking","torrent":{"xt":"urn:btih:e22a3735a483b819be00d528f8c6c79693f5a881","amp;dn":"%5BClips4sale%5D+Cory+Chase+-+Sydney+Cole+in+Major+Dilema","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e22a3735a483b819be00d528f8c6c79693f5a881","infoHashBuffer":{"type":"Buffer","data":[226,42,55,53,164,131,184,25,190,0,213,40,248,198,199,150,147,245,168,129]},"announce":[],"urlList":[]}}