{"title":"Flax oil as a true aid against arthritis, heart infarction, canc","uid":6381818,"size":1589223,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e2d038a7a3d1a94a84e530d07f094f539a80cdc2&amp;dn=Flax+oil+as+a+true+aid+against+arthritis%2C+heart+infarction%2C+canc&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"flaxindia","files":1,"time":1305056168,"description":"After three decades of research Dr. Budwig,  sixtime nominee for the Nobel\nAward, found that the blood of seriously ill cancer patients was always,\nwithout exception, deficient in certain important essential ingredients\nwhich included substances called phosphatides and lipoproteins. (The blood\nof a healthy person always contains sufficient quantities of these essential\ningredients. However, without these natural ingredients cancer cells grow\nwild and out of control.)\n\n\nBlood analysis showed a strange greenish-yellow substance in place of the\nhealthy red oxygen carrying hemoglobin that belongs there. This explained\nwhy cancer patients weaken and become anemic. This startling discovery led\nDr. Budwig to test her theory.\n\n\nShe found that when these natural ingredients where replaced over\napproximately a three month period, tumors gradually receded.The strange\ngreenish elements in the blood were replaced with healthy red blood cells as\nthe phosphatides and lipoproteins almost miraculously reappeared. Weakness\nand anemia disappeared and life energy was restored. Symptoms of cancer,\nliver dysfunction and diabetes were completely alleviated.\n\n\nDr. Budwig then discovered an all natural way for people to replace those\nessential ingredients their bodies so desperately needed in their daily\ndiet. By simply eating a combination of just two natural and delicious\nfoods not only can cancer be prevented but in case after case it was\nactually cured. (These two natural foods, organic flax seed oil &amp; cottage\ncheese) must be eaten together to be effective since one triggers the\nproperties of the other to be released.)\n\n\nAfter more than 10 years of solid clinical application, Dr. Budwig\\'s natural\nformula has proven successful where many orthodox remedies have failed. Dr.\nBudwig\\'s formula has been used therapeutically in Europe for prevention of:\nCancer! Arteriosclerosis, Strokes, Cardiac Infarction, Heartbeat\n(irregular), Liver (fatty degeneration), Lungs (reduces bronchial\nspasms), Intestines (regulates activity). Stomach Ulcers (normalizes\ngastric juices), Prostate (hypertopic), Arthritis (exerts a favorable\ninfluence), Eczema (assists all skin diseases), Old age (improves many\ncommon afflictions), Brain (strenghthens activity), Immune Deficiency\nSyndromes (multiple sclerosis, autoimmune illnesses)\n\n\nThousands have flocked to hear Dr. Budwig lecture all over Europe. The many\npeople Dr. Budwig\\'s formula has helped testify to the benefits of her\nremarkable discovery.\n\n\n","torrent":{"xt":"urn:btih:e2d038a7a3d1a94a84e530d07f094f539a80cdc2","amp;dn":"Flax+oil+as+a+true+aid+against+arthritis%2C+heart+infarction%2C+canc","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e2d038a7a3d1a94a84e530d07f094f539a80cdc2","infoHashBuffer":{"type":"Buffer","data":[226,208,56,167,163,209,169,74,132,229,48,208,127,9,79,83,154,128,205,194]},"announce":[],"urlList":[]}}