{"title":"Indian Made Easy (gnv64)","uid":15374833,"size":79371185,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e3ababa71338f2dc2010316072c95df0989cfd16&amp;dn=Indian+Made+Easy+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gnv65","files":4,"time":1469180712,"description":"Indian Made Easy\r\nby Amandip Uppal\r\nMurdoch Books | September 2016 | ISBN-10: 1743368585 | ePUB | 75.6 mb\r\n\r\nWhilst Indian food is an incredibly popular cuisine, cooking it on a day-to-day basis can take time and lots of preparation which can be problematic for the busy home cook. In this timely and unique book, Amandip Uppal strips back the process of cooking Indian food to pave the way for a new, casual approach to cooking with both well-known and lesser-known Indian spices and ingredients that fit easily into day-to-day life. Blending traditional and contemporary Indian cuisine, Amandip's recipes breathe a new lease of life into well-known dishes whilst holding true to tradition. Broken into chapters titled Light Bites; Vegetables and Lentils; Fish, Meat and Poultry; Breads and Rice; Salads; Pickles and Chutneys; and Desserts and Drinks, Indian Made Easy contains quick, uncomplicated recipes for every occasion, as well as information on pantry staples, basics and must-have spices, and a fabulous menu planner to help you put together opulent feasts and wonderful combinations of tastes, textures and flavours. Cook up Lamb kofta with saffron creme fraiche and Tamarind rice with Onion; learn how to make Coriander stuffed naan and Sesame and ginger chicken skewers; please the veggies with dishes like Aubergine with chilli and pomegranate dressing and a cheat's Dhal makhani; and sate your sweet tooth with Pistachio kulfi or a Pomegranate, lime and rosewater granita. Indian Made Easy is a beautiful and delicious cookbook that brings Indian cookery up-to-date for the modern, busy cook.\r\n\r\nAbout the Author\r\nUK-based author Amandip Uppal is a former stylist and writer. Amandip worked for many years at The Times, and later became the Deputy Fashion Editor of Conde Nast Traveler. Drawing on her life-long love of design and food, she created ChilliHotChocolate.com - an online kitchen and dining emporium.\r\n\r\nCONTENTS\r\nINTRODUCTION\r\nPANTRY / LARDER\r\n15 MUST-HAVE SPICES\r\nLIGHT BITES\r\nVEGETABLES AND LENTILS\r\nFISH, MEAT AND POULTRY\r\nBREADS AND RICE\r\nSALADS\r\nPICKLES AND CHUTNEYS\r\nDESSERTS AND DRINKS\r\nBASICS\r\nMENU IDEAS\r\nINDEX\r\nCOPYRIGHT \r\n \nhttps://s31.postimg.org/5wltph06z/Indian_Made_Easy.jpg","torrent":{"xt":"urn:btih:e3ababa71338f2dc2010316072c95df0989cfd16","amp;dn":"Indian+Made+Easy+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3ababa71338f2dc2010316072c95df0989cfd16","infoHashBuffer":{"type":"Buffer","data":[227,171,171,167,19,56,242,220,32,16,49,96,114,201,93,240,152,156,253,22]},"announce":[],"urlList":[]}}