{"title":"Lightwave 9.3.1 OSX","uid":4245752,"size":40099714,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:e402b45d9a4c491c9ba132aa70f91e3d27137209&amp;dn=Lightwave+9.3.1+OSX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"RvDam","files":1,"time":1213780446,"description":"Looking for a 3D animation system? There are many out there, from super simple to those built for rocket scientists, but what you need is a program that works the way you do. Smart and efficient. A program that&amp;#039;s intuitive and responsive. Powerful enough to tackle any job, yet simple enough to be mastered by a single artist.\n\nAt NewTek, our goal is to develop cutting-edge and feature-rich products which allow ordinary people to do extraordinary things. We have a history of revolutionizing the industry with powerful, easy to use tools that work like you do - and don&amp;#039;t break the bank in the process. It is our mission to make it realistic for you to realize your dreams, no matter where they take you, from architectural visualization, to independent production and major studio visual effects.\n\n&quot;The ponint is, the entire program received a good tune and those areas you\ntexture and render monkeys use is where you will see the greatest benefit.\nYour renders will render faster, look better and give you more options.\nIt&amp;#039;s one hell of an upgrade.&quot;\n\nKevin Quattro, CG Supervisor, CSI: Miami\nVisual Effects Artist, Battlestar Galactica, Firefly, Serenity\n\nYou&amp;#039;ll find LightWave is the most complete and robust 3D system right out of the box anywhere at any price. It is a thriving, dynamic system, ever evolving to meet the needs of our users. We work closely on a day-to-day basis with LightWave artists so that we know exactly what you are trying to accomplish. The LightWave renderer is first class, best in show and infinitely easier to set up and use than any other, not to mention the fact that unlimited render nodes are free!\n\nWe take great pride in the fact that LightWave artists have won more Emmy Awards than those using any other package. We are proud of the fact that our user community is the most passionate, most active and most helpful in the industry. LightWave is more than a 3D program, it is a business, it is an art form, it is a film, it is a game, it is realistic, it is cartoonish, it is moving, it is still... it is whatever you make of it.\n","torrent":{"xt":"urn:btih:e402b45d9a4c491c9ba132aa70f91e3d27137209","amp;dn":"Lightwave+9.3.1+OSX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e402b45d9a4c491c9ba132aa70f91e3d27137209","infoHashBuffer":{"type":"Buffer","data":[228,2,180,93,154,76,73,28,155,161,50,170,112,249,30,61,39,19,114,9]},"announce":[],"urlList":[]}}