{"title":"The Sally Lockhart Mystery Collection - Philip Pullman (4 Books)","uid":6060785,"size":552121175,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:e4f329ac09b743c6272e0a7a431d21952e0b8576&amp;dn=The+Sally+Lockhart+Mystery+Collection+-+Philip+Pullman+%284+Books%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"Lucy1948","files":52,"time":1293111711,"description":"All are unabridged and read by Anton Lesser. Books 1 and 2 are from CD and books 3 and 4 from Cassette. (32 kbps / 22kHz Mono, Fraunhofer CBR).\n\n\n\n1. *The Ruby in the Smoke* 6 Hours 34 Mins\nIn 1872, sixteen-year-old Sally Lockhart finds a message her late father left for her. The message convinces her that his death was not, as she had thought, accidental. She finds herself walking along Chatham Seafront, she is searching for a man called Marchbanks. The visit to Chatham was just the beginning of the mystery of the Ruby of Agrapur and the cursed seven blessings.\n\n2. *The Shadow in the North* 9 Hours 5 Mins\nIt is 1878. Following a fraudulent medium's ramblings, a Scottish magician's visions, and a transport ship's disappearance, Sally finds that she must seek help from old friends, and finds herself losing all she holds dear trying to uncover the truth behind the North Star, the Steam Gun, and Bellman.\n\n3. *The Tiger in the Well* 13 Hours 24 Mins\nIt is 1881. A trap has been sprung, a trap which has been in preparation for years. The barely-human Tzaddik is behind this, and his demons are far greater than anything Sally Lockhart can muster. With the law, the Tzaddik's henchmen, and luck against her, she is forced to go undercover, leaving behind her family and friends as she is sucked into the well...\n\n4. *The Tin Princess* 9 Hours 3 Mins\nIt is 1882. Jim finds Adelaide, a girl who went missing as a poor urchin during Sally's first encounter with danger, and finds that she has married into the royal family of Razkavia, a small country near Germany. However, resentment is rife within the palace, and plots develop to dethrone the family and join Germany. Only the Eagle can stop them.","torrent":{"xt":"urn:btih:e4f329ac09b743c6272e0a7a431d21952e0b8576","amp;dn":"The+Sally+Lockhart+Mystery+Collection+-+Philip+Pullman+%284+Books%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4f329ac09b743c6272e0a7a431d21952e0b8576","infoHashBuffer":{"type":"Buffer","data":[228,243,41,172,9,183,67,198,39,46,10,122,67,29,33,149,46,11,133,118]},"announce":[],"urlList":[]}}