{"title":"Faithless - Reverence [1996]","uid":9501937,"size":375554762,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e5089c2c04865d8d6053fb5b82250ba4f799cb68&amp;dn=Faithless+-+Reverence+%5B1996%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GenXRock","files":-1,"time":1390242114,"description":"Review by Amy Hanson  [-]\nMaxi Jazz, the maestro behind Faithless, is well titled as &quot;the grand oral disseminator.&quot; The tales he spins make this album a manifesto, religious experience, sexual escapade, and 24-hour rave all rolled up into one tightly constructed package. As Jazz explored hip-hop through the 1980s and his path converged with dub superstar Jah Wobble, the ultra funky Jamiroquai, and the Soul II Soul amalgamation (among others), the foundation was laid for the delicious blend of genres and sounds that would break through in the mid-'90s. Reverence is the culmination of all those experiences, as Jazz unleashes a fat packet worth of songs that are really an acid house tapestry in disguise. This album is best heard in one sitting, where all its styles work together to tell the story. But break it apart, peel the layers back, and the songs stand alone as well. The hypnotic title track serves nicely as an introduction, before it's waylaid by the downtempo soul ballad &quot;Don't Leave,&quot; which is replete with needle, pops, and skips throughout. &quot;Salva Mea,&quot; &quot;Insomnia,&quot; and &quot;Dirty Ol' Man,&quot; three very different songs, tangle themselves together and pick up the thread from &quot;Reverence.&quot; &quot;Angeline,&quot; meanwhile, emerges as a perfectly impassioned love song. The U.S. release includes the bonus &quot;Monster Mix Radio Edit&quot; of &quot;Insomnia.&quot; Maxi Jazz hits a deep chord with this album. It's clubby enough for the kiddies, but is incredibly complex beyond the dancefloor. The songs are great, the beats are compelling, and it's almost impossible to not bounce around the room while listening. But this album is also a collection of shadows, of mirror images, where songs mimic one another before spinning off to do their own thing. Moments are caught and lost, tangled, and straightened out. Really, it's brilliant. (4/5)","torrent":{"xt":"urn:btih:e5089c2c04865d8d6053fb5b82250ba4f799cb68","amp;dn":"Faithless+-+Reverence+%5B1996%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5089c2c04865d8d6053fb5b82250ba4f799cb68","infoHashBuffer":{"type":"Buffer","data":[229,8,156,44,4,134,93,141,96,83,251,91,130,37,11,164,247,153,203,104]},"announce":[],"urlList":[]}}