{"title":"The Science of Fitness with Tamilee: I Want Those Abs!","uid":7970545,"size":213908302,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:e56f87330c363ebd09a3a008655144cd83ac0735&amp;dn=The+Science+of+Fitness+with+Tamilee%3A+I+Want+Those+Abs%21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"acer47x","files":1,"time":1356818012,"description":"We've all seen someone walk by on the street and though, &quot;I want to look like that!&quot; But that ideal physique is always just out of reach - no matter how many diets or exercises we try, the body we want always seems unattainable. Now, renowned fitness instructor Tamilee Webb has used groundbreaking scientific research to find the best possible workouts for each part of the body and every level of student. By going into the lab to study each muscle group and test every exercise, Tamilee has been able to develop fitness routines that will provide the maximum benefit for your body, inside and out. With a master's degree in exercise science, more than 20 chart-topping fitness videos to her credit including &quot;Buns of Steel&quot;, and three best-selling books, Tamilee is and undisputed expert in the science of fitness. Tamilee has combined her personal experience and scientific knowledge into a user-friendly format that will have you looking great and feeling health. Her no-hype, down-to-earth attitude and step-by-step instructions make it easy to follow along, and her routines are designed to fit into any lifestyle. No matter what your body type or schedule, Tamilee can help you to feel great and achieve the body you've always dreamed of. You'll soon have people looking at you and thinking, &quot;I want that body!&quot; I WANT THOSE ABS! No one knows how to get rock hard abs better than Tamilee Webb. With I want Those Abs, she has taken every abdominal exercise into the lab and tested each one to design the most efficient ab workout ever. Start out with the 15-minute beginner's routine, working your way up to the advanced, or do the complete workout for maximum benefit to your body. Just two to three times a week and you'll be showing off your flat, firm abs to the world. What are you waiting for? Get the abs you want today!","torrent":{"xt":"urn:btih:e56f87330c363ebd09a3a008655144cd83ac0735","amp;dn":"The+Science+of+Fitness+with+Tamilee%3A+I+Want+Those+Abs%21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e56f87330c363ebd09a3a008655144cd83ac0735","infoHashBuffer":{"type":"Buffer","data":[229,111,135,51,12,54,62,189,9,163,160,8,101,81,68,205,131,172,7,53]},"announce":[],"urlList":[]}}