{"title":"The Complete Thyroid Book, 2nd Edition{BBS}","uid":6716407,"size":2960990,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e5ae10ac0e03c0b24e7e407c0e4ee598070abe24&amp;dn=The+Complete+Thyroid+Book%2C+2nd+Edition%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1317576966,"description":"The only book you need to understand and treat your thyroid condition\n\nCombining the expertise of two pioneers in the field--world-renowned thyroid specialist Kenneth Ain, M.D., and bestselling thyroid author and bioethicist M. Sara Rosenthal, Ph.D.--The Complete Thyroid Book provides all the essential information on the diagnosis, options, and treatment of thyroid disease.\n\nCompletely updated with the latest research, this book provides a comprehensive look at tests, scans, and state-of-the-art therapies and treatments for every type of thyroid condition.\n\nThe Complete Thyroid Book, now revised and updated, is your source for information on:\n\n    * Thyroid hormone and all other medications used in thyroid treatment\n    * Thyroid disease in special populations, including pregnant women, menopausal women, infants, children, and the elderly\n    * Nutrition, environmental issues, and public health\n\nThis second edition of The Complete Thyroid Book gives you expert advice based on the latest research.\nFrom the Back Cover\n\nThe only book you need to understand and treat your thyroid condition\n\nThe Complete Thyroid Book combines the expertise of the perfect team, both pioneers in thyroid disease--renowned thyroid specialist Kenneth Ain, M.D., and bestselling thyroid author and thyroid patient M. Sara Rosenthal. Together, they provide you with all the information you need to understand your thyroid disorder, treatment, and options, in language you can understand.\n\nCovering both state-of-the-art and standard-of-care treatments for every thyroid condition imaginable, this comprehensive resource gives you vital information on:\n\n    * The basics--what the thyroid does and how it works\n    * Thyroid tests, scans, medication, and treatments\n    * Hypothyroidism, hyperthyroidism, and thyroid hormone\n    * Autoimmune thyroid disease and thyroid eye disease\n    * Thyroid nodules, goiter, and thyroid cancer\n    * Thyroid disease in pregnancy and menopause and among seniors, infants, and children\n    * Thyroid disease and obesity, heart disease, fatigue, and mental health\n    * Nutrition and complementary therapies \n\n--This text refers to an out of print or unavailable edition of this title.\nSee all Editorial Reviews\nProduct Details\n\n    * Paperback: 384 pages\n    * Publisher: McGraw-Hill; 2 edition (August 19, 2010)\n    * Language: English\n    * ISBN-10: 0071743480\n    * ISBN-13: 978-0071743488","torrent":{"xt":"urn:btih:e5ae10ac0e03c0b24e7e407c0e4ee598070abe24","amp;dn":"The+Complete+Thyroid+Book%2C+2nd+Edition%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5ae10ac0e03c0b24e7e407c0e4ee598070abe24","infoHashBuffer":{"type":"Buffer","data":[229,174,16,172,14,3,192,178,78,126,64,124,14,78,229,152,7,10,190,36]},"announce":[],"urlList":[]}}