{"title":"Delight in the Seasons (gnv64)","uid":9058551,"size":53759650,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e5b27ee6d7066577b0ef17992944510a2452f792&amp;dn=Delight+in+the+Seasons+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gnv65","files":-1,"time":1382003431,"description":"Delight in the Seasons - Crafting a Year of Memorable Holidays and Celebrations\nby Lisa M. Pace\nNorth Light Books | January 2012 | ISBN-10: 1440313636 | ePUB | 51.2 mb &lt;a href=&quot;\nhttp://www.amazon.com/Delight-Seasons-Crafting-Memorable-Celebrations/dp/1440313636&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Delight-Seasons-Crafting-Memorable-Celebrations/dp/1440313636&lt;/a&gt;\n\nLisa Pace is at it again, this time with projects and techniques that will have you celebrating the seasons in style!\nLet Lisa and her pretty vintage style inspire you with techniques that will expand your perceptions of what papercrafting can be. You'll create beautiful projects and embellishments using a wide variety of both everyday and unexpected materials, while paying homage to your fondest memories of Christmas, summer vacation, Halloween and more.\n\nIn Delight in the Seasons you'll find:\n-    40 step-by-step techniques, to be used as demonstrated or adapted to meet your style and needs.\n-    20 gallery pieces that combine multiple techniques into entirely new and charming projects.\n-    A delightful variety of sample projects including home, seasonal and party decor, greeting cards, ornaments, scrapbook layouts and more.\n-    Endless inspiration as Lisa shares the memories and moments that inspired each project.\n\nSo gather your supplies, add a dash of inspiration (and maybe some glitter) and delight in the seasons with Lisa Pace!\n\nAbout the Author &lt;a href=&quot;\nhttp://g-ecx.images-amazon.com/images/G/01/ciu/5f/c3/49c615f9c10d0ac1d18841.L._V379592081_SX200_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://g-ecx.images-amazon.com/images/G/01/ciu/5f/c3/49c615f9c10d0ac1d18841.L._V379592081_SX200_.jpg&lt;/a&gt;\nLisa lives in Frisco, Texas with her husband and two daughters. She started scrapÂ­booking in 2006. Her first book &quot;Delight In The Details,&quot; was published in January of 2010 by North Light Books/F+W Media Inc. In November of 2011, she collaborated with Pink Persimmon and released  vintage inspired stamp line &quot;Antiquated Collection by Lisa M. Pace&quot;. In January of 2012 her second book &quot;Delight In The Seasons&quot; was published by North Light Books/F+W Media Inc..\nLisa recently finished working on third technique based book &quot;Delight In The Art of Collage&quot; with North Light Books/F+W Media Inc., which is scheduled for publication in January 2014.\nIn April of 2012, she attended Ranger University and became a Ranger Certified Educator.\nIn May of 2007, she was picked as one of 5 master scrapÂ­bookers in Martha Stewart's scrapÂ­booking contest and August of 2007, was chosen as a 2008 Memory Makers Master.\nHer work has been published in magazines such as Memory Makers, ScrapÂ­books etc., Better Homes and Gardens and ScrapÂ­booking &amp; Cards Today as well as numerous idea books like Holiday Home, ScrapÂ­book Trends, Paper Trends, Paper Creations and ScrapÂ­booking &amp; Beyond.","torrent":{"xt":"urn:btih:e5b27ee6d7066577b0ef17992944510a2452f792","amp;dn":"Delight+in+the+Seasons+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5b27ee6d7066577b0ef17992944510a2452f792","infoHashBuffer":{"type":"Buffer","data":[229,178,126,230,215,6,101,119,176,239,23,153,41,68,81,10,36,82,247,146]},"announce":[],"urlList":[]}}