{"title":"The Unarmed Truth: Fast and Furious - John Dodson Audiobook MP3","uid":11196657,"size":257525872,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:e6063c021442cd1ed8e56226d93670dab4c783c2&amp;dn=The+Unarmed+Truth%3A+Fast+and+Furious+-+John+Dodson+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Squiddy82","files":-1,"time":1413100600,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nThe Unarmed Truth: My Fight to Blow the Whistle and Expose Fast and Furious\n\nWritten by: John Dodson\nNarrated by: John Pruden\nLength: 8 hrs and 54 mins\nUnabridged Audiobook\nRelease Date:12-03-13\n\nAfter the terror attacks of September 11, 2001, John Dodson pulled bodies out of the wreckage at the Pentagon. In 2007, following the shooting massacre at Virginia Tech, Dodson walked through the classrooms, heartbroken, to cover up the bodies of the victims.\n\nThen came Arizona - the American border.\n\nTen days before Christmas, 2010, ATF agent John Dodson awoke to the news he had dreaded every day as a member of the elite team called the Group VII Strike Force: a US border patrol agent named Brian Terry had been shot dead by bandits armed with guns that had been supplied to them by ATF. Was this an inevitable consequence of the Obama administration's Project Gunrunner, set in place one year earlier, ostensibly to track Mexican drug cartels?\n\nBrian Terry's murder would not only change John Dodson's life forever; it would reveal a scandal so unthinkably unpatriotic that it forced President Barack Obama to claim executive privilege and caused Attorney General Eric Holder to be held in contempt of Congress.\n\nFederal Agent John Dodson, an ex-military man, took an oath to defend the world's greatest country and proudly considered himself a walking patriotic example of the American Dream. Brian Terry, ex-military like Dodson, was only 40 years old, a family man who served his country by working for the government.\n\nDodson was terrified when the next phone call came, one with the potential to destroy his career, his family, and his life. CBS investigative journalist Sharyl Attkisson asked Dodson to go public with what he knew about Fast and Furious. To Agent Dodson, this meant blowing the whistle. But to the family of Agent Terry, it was a chance to save lives and right a wrong. As he took a fight from the border towns of Arizona to a showdown in the halls of Congress, Dodson clung to the hope that truth would prevail, that he would be redeemed, and that Brian Terry's death would not be in vain.","torrent":{"xt":"urn:btih:e6063c021442cd1ed8e56226d93670dab4c783c2","amp;dn":"The+Unarmed+Truth%3A+Fast+and+Furious+-+John+Dodson+Audiobook+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e6063c021442cd1ed8e56226d93670dab4c783c2","infoHashBuffer":{"type":"Buffer","data":[230,6,60,2,20,66,205,30,216,229,98,38,217,54,112,218,180,199,131,194]},"announce":[],"urlList":[]}}