{"title":"Hogtied------HT-29372 Ashlynn Leigh and Odile MP4","uid":8204794,"size":2942753608,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:e63ecdb346cb2c7ff795c400daeea8345932cc48&amp;dn=Hogtied------HT-29372+Ashlynn+Leigh+and+Odile+MP4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"merzedes","files":-1,"time":1362093605,"description":"20 year old Ashlynn &amp; ginger Odile get shown the ropes &amp; defiled!\n\nFeb 28, 2013 - Performers: Ashlynn Leigh and Odile \n\n\nMP4 + Pics.        \n\n\nWelcome both Ashlynn and Odile to HogTied. Both bitches are up for a hard challenge today with uncomfortable rope bondage predicaments, pain, and VERY intense orgasm play. First up is Ashlynn Leigh. This hot 20 year old Texan gets turned out with rope bondage. We begin with her tied in a nice bent over straddle spread. Her cute bubbly personality quickly becomes turned on and fascinated by the bondage and the inescapable aspect of her tie. Her nice round ass is clearly on display for the taking. A nice cold anal hook is added, fingers in her tight young cunt, and a good flogging to redden that butt.\n\nSecond, Ashlynn is bound in a standing worm tie predicament. Claire alternates tormenting her with the cane and the tazapper, making Ashlynn shock herself in the pussy! Our inexperienced starlet is pulled up even further to balance on her toes and then vibrated to orgasm. Her bondage is transitioned on the ground into a nice HogTie. Orgasm after orgasm is wrenched out of her pussy and ass and clit. Again and again the 20 year old can't stop from cumming.\n\nFinally, welcome red head Odile. Claire is not easy on this one. Odile starts in a modified steer tie on the floor. On her face is a ball gag, panty hose, her panties, and then its all taped on over the mouth, creating a breathing and sensory predicament. Claire torments Odile, playing with her like a piece of meat and then transitions Odile into a full suspension. Adding nipple clamps and a nice ass treatment, we want to see this bitch cum!\n\nScreens   &lt;a href=&quot;\nhttp://www.hogtied.com/site/shoot.jsp?shootId=29372&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.hogtied.com/site/shoot.jsp?shootId=29372&lt;/a&gt;\n\n10 000 uploads and counting, 11k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n\n","torrent":{"xt":"urn:btih:e63ecdb346cb2c7ff795c400daeea8345932cc48","amp;dn":"Hogtied------HT-29372+Ashlynn+Leigh+and+Odile+MP4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e63ecdb346cb2c7ff795c400daeea8345932cc48","infoHashBuffer":{"type":"Buffer","data":[230,62,205,179,70,203,44,127,247,149,196,0,218,238,168,52,89,50,204,72]},"announce":[],"urlList":[]}}