{"title":"The Market for Liberty - Morris Tannehill","uid":11709943,"size":253233,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e69108b5ed2872c7d00798e41f204d93d3f019ae&amp;dn=The+Market+for+Liberty+-+Morris+Tannehill&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"starxteel","files":1,"time":1424285452,"description":"\nThe Market for Liberty is an anarcho-capitalist book written by Linda and Morris Tannehill, which according to Karl Hess has become &quot;something of a classic.&quot; It was preceded by the self-published Liberty via the Market in 1969. Mary Ruwart credits the Tannehill's book with winning her over to anarcho-capitalism. Doug Casey was also converted to anarcho-capitalism after reading the book at the behest of Jarret Wollstein. According to the Ludwig von Mises Institute, it was written just following a period of intense study of the writings of both Ayn Rand and Murray Rothbard. It was the first significant anarcho-capitalist work to hit the libertarian movement, coming into print a year before Rothbard's Power and Market although Rothbard's book had been written earlier.\n\nLike Rothbard's Man, Economy, and State, The Market For Liberty opposes statutory law and advocates natural law as the basis for society; however, unlike MES which explains what sort of libertarian legal code the market would create in an anarcho-capitalist society, TMFL points out that society would not be lawless in the absence of the state. Conversely, The Market for Liberty, spends a great deal of time outlining how different businesses and organizational structures would interact in a laissez-faire society, and how these interactions would create checks which would ultimately keep the tendency for crime low. In keeping with radical free market principles, the book is skeptical about the potential for violent anarcho-capitalist revolution to bring about good outcomes","torrent":{"xt":"urn:btih:e69108b5ed2872c7d00798e41f204d93d3f019ae","amp;dn":"The+Market+for+Liberty+-+Morris+Tannehill","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e69108b5ed2872c7d00798e41f204d93d3f019ae","infoHashBuffer":{"type":"Buffer","data":[230,145,8,181,237,40,114,199,208,7,152,228,31,32,77,147,211,240,25,174]},"announce":[],"urlList":[]}}