{"title":"Larisa Shepitko - Voskhozhdeniye aka The Ascent (1977)","uid":4189685,"size":1451350016,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e74ef618eccb820b24e5a7258d2f758064f2f737&amp;dn=Larisa+Shepitko+-+Voskhozhdeniye+aka+The+Ascent+%281977%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"Lepowski","files":2,"time":1210880329,"description":"Filling a request from the Freakyflicks forum. This is not my rip and it was originally uploaded by borose on Karagarga. I have also stolen a lot of his original description.\n\nMy upload ain\\&amp;#039;t great, but I will keep this baby seeded for a long time so bear with me :)\n\n\n\nThis is one of the greatest WW2 Soviet films, together with Klimov\\&amp;#039;s \\&quot;Come and See.\\&quot; And the connections with Tarkovsky\\&amp;#039;s spiritualism mentioned in the review below are very true.\n\n\nLars Andersson from Stockholm, Sweden wrote this on IMDB:\n[quote]A Soviet masterpiece\n\nIn the Belarus of 1942, two Soviet soldiers are captured by Nazi-friendly Belarusians. In captivity, the attitude of the two men toward their fate differs greatly. One of the soldiers manages to find an inner strength and spirituality, incomprehensible to the other man. Larisa Shepitko\\&amp;#039;s last film is one of the most beautiful war films in cinema history.\n[img]http://img162.imageshack.us/img162/5426/bscap0005yy.jpg[/img]\n\nThe cinematography, by Vladimir Chuchnov, is incredible - particularly in the opening sequence, where long, slow, tracking shots depicting the solitude and almost desperate nature of winter landscape in rural Belarus set the mood perfectly. It is easy to draw comparison to Tarkovsky\\&amp;#039;s films, even more so since Tarkovsky\\&amp;#039;s alter ego Anatoli Solonitsyn has a small but important part in The Ascent.\n[img]http://img162.imageshack.us/img162/8441/bscap0017ew.jpg[/img]\n\n\nThe acting is overall brilliant, especially by Boris Plotnikov, in the part of Sotnikov. The film reveals an old-fashioned belief in the strength of religious passion, which feels related to characters such as Dostoyevsky\\&amp;#039;s Prince Myshkin, or Tarkovsky\\&amp;#039;s Stalker. However, this is not a weakness of the film, but rather one of its greatest strengths.\n[img]http://img239.imageshack.us/img239/3738/bscap0034wz.jpg[/img]\n\nThe religious content seems so honest, and human, that it is impossible not to be moved. The emotional richness of the film cannot be overstated; the answer is not as simplified as a short summary of the plot would make you think. The slow development of the characters, and the emphasis on their complicated relationships to each other, are somewhat reminiscent of The Commissar, another great Soviet film.\n[img]http://img160.imageshack.us/img160/3513/bscap0046fs.jpg[/img]\n\nThe Ascent deserves a second watching, as well as a third, and a tenth. It continues to provide interesting ideas, beautiful images, and emotional complexity.\n[img]http://img160.imageshack.us/img160/1514/bscap0052dy.jpg[/img][/quote]\n\n\n\nRip specs:\n\nSource: dvd\n\nCD1: \nFile: 691 MB (691 MB), duration: 0:43:50, type: AVI, 1 audio stream(s), quality: 90 % \nVideo : 631 MB, 2014 Kbps, 25.0 fps, 672*496 (4:3), XVID = XVID Mpeg-4 \nAudio : 60 MB, 192 Kbps, 48000 Hz, 2 channels, 0x55 = MPEG Layer-3 \n\nCD2: \nFile : 692 MB (692 MB), duration: 1:00:47, type: AVI, 1 audio stream(s), quality: 78 % \nVideo : 608 MB, 1400 Kbps, 25.0 fps, 672*496 (4:3), XVID = XVID Mpeg-4 \nAudio: 83 MB, 192 Kbps, 48000 Hz, 2 channels, 0x55 = MPEG Layer-3, \n\nStandalone-friendly\n\nThe subs are hard subs.\n\n\n*********************************** FREAKYFLICKS ************************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n\n\n\\&amp;#039;If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE\\&amp;#039;","torrent":{"xt":"urn:btih:e74ef618eccb820b24e5a7258d2f758064f2f737","amp;dn":"Larisa+Shepitko+-+Voskhozhdeniye+aka+The+Ascent+%281977%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e74ef618eccb820b24e5a7258d2f758064f2f737","infoHashBuffer":{"type":"Buffer","data":[231,78,246,24,236,203,130,11,36,229,167,37,141,47,117,128,100,242,247,55]},"announce":[],"urlList":[]}}