{"title":"Rio Bravo 1959 x264 AAC Eng Ger Spa plus subtitles","uid":4975097,"size":727916358,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e7933c03488668ec6e6bc6324568ecbdf151bf01&amp;dn=Rio+Bravo+1959+x264+AAC+Eng+Ger+Spa+plus+subtitles&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"siggomar","files":10,"time":1245960024,"description":"Rio Bravo\nYear: 1959\nDirector: Howard Hawks\nFilm length: 2h20\n\nvideo codex: H.264 AVC 720 x 400 (16/9) Color\naudio codex: He-AAC Stereo 64 kb/s for each language\n\nlanguages: English, Deutsch, Spanish\nsubtitles: English, Deutsch, Spanish\n\nSet in Texas during the late 1860s, Rio Bravo is a story of men (and women) and a town under siege. Presidio County Sheriff John T. Chance (John Wayne) is holding Joe Burdette (Claude Akins), a worthless, drunken thug, for the murder of an unarmed man in a fight in a saloon -- the problem is that Joe is the brother of wealthy land baron Nathan Burdette (John Russell), who owns a big chunk of the county and can buy all the hired guns he doesn't already have working for him. Burdette's men cut the town off to prevent Chance from getting Joe into more secure surroundings, and then the hired guns come in, waiting around for their chance to break him out of jail. Chance has to wait for the United States marshal to show up, in six days, his only help from Stumpy (Walter Brennan), a toothless, cantankerous old deputy with a bad leg who guards the jail, and Dude (Dean Martin), his former deputy, who's spent the last two years stumbling around in a drunken stupor over a woman that left him. Chance's friend, trail boss Pat Wheeler (Ward Bond), arrives at the outset of the siege and tries to help, offering the services of himself and his drovers as deputies, which Chance turns down, saying they're not professionals and would be too worried about their families to be good at anything except being targets for Burdette's men; but Chance does try to enlist the services of Wheeler's newest employee, a callow-looking young gunman named Colorado Ryan (Ricky Nelson), who politely turns him down, saying he prefers to mind his own business. In the midst of all of this tension, Feathers (Angie Dickinson), a dance hall entertainer, arrives in town and nearly gets locked up by Chance for cheating at cards, until he finds out that he was wrong and that she's not guilty -- this starts a verbal duel between the two of them that grows more sexually intense as the movie progresses and she finds herself in the middle of Chance's fight. Wheeler is murdered by one of Burgette's hired guns who is, in turn, killed by Dude in an intense confrontation in a saloon. Colorado throws in with Chance after his boss is killed and picks up some of the slack left by Dude, who isn't quite over his need for a drink or the shakes that come with trying to stop. Chance and Burdette keep raising the ante on each other, Chance, Dude, and Colorado killing enough of the rancher's men that he's got to double what he's paying to make it worth the risk, and the undertaker (Joseph Shimada) gets plenty of business from Burdette before the two sides arrive at a stalemate -- Burdette is holding Dude and will release him in exchange for Joe. This leads to the final, bloody confrontation between Chance and Burdette, where the wagons brought to town by the murdered Wheeler play an unexpected and essential role in tipping the balance.\n\nmore reviews: &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Rio_Bravo_(1959_film)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Rio_Bravo_(1959_film)&lt;/a&gt; &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0053221/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0053221/&lt;/a&gt;","torrent":{"xt":"urn:btih:e7933c03488668ec6e6bc6324568ecbdf151bf01","amp;dn":"Rio+Bravo+1959+x264+AAC+Eng+Ger+Spa+plus+subtitles","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e7933c03488668ec6e6bc6324568ecbdf151bf01","infoHashBuffer":{"type":"Buffer","data":[231,147,60,3,72,134,104,236,110,107,198,50,69,104,236,189,241,81,191,1]},"announce":[],"urlList":[]}}