{"title":"The Medieval Islamic Civilization - C. 12 (Thought, Philosophy3)","uid":12111351,"size":239916182,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e7c5526c5682d2b83d66ccc576a31d2ef6801b23&amp;dn=The+Medieval+Islamic+Civilization+-+C.+12+%28Thought%2C+Philosophy3%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"moman73","files":27,"time":1436582662,"description":"The Medieval Islamic Civilization - Collection 12 (Thought, Philosophy 3):\n\nWe have 27 titles here:\n\n-  Adamson - Al-Kindi (2007)\n\n-  Bladel - The Arabic Hermes; from Pagan Sage to Prophet of Science (2009)\n\n-  Calverley &amp; Pollock (Trans. &amp; Eds.) - Nature, Man and God in Medieval Islam; al-Bydawi's Text Tawali' al-Anwar min Matali' al-Anzar (2002)\n\n-  Crone - Roman, Provincial and Islamic Law; The Origins of the Islamic Patronate (1987)\n\n-  Fakhry - Islamic Philosophy, Theology and Mysticism; a Short Introduction (1997)\n\n-  Ghazanfar (Ed.) - Medieval Islamic Economic Thought; Filling the Great Gap in European Economics (2003)\n\n-  Goldziher - Introduction to Islamic Theology and Law (1981)\n\n-  Hammond - The Philosophy of Alfarabi and Its Influence on Medieval Thought (1947)\n\n-  Hughes - The Texture of the Divine; Imagination in Medieval Islamic and Jewish Thought (2004)\n\n-  Inglis (Ed.) - Medieval Philosophy and the Classical Tradition; In Islam, Judaism and Christianity (2002)\n\n-  Jamil ur Rehman - The Philosophy and Theology of Averroes (1921)\n\n-  Kahl - The Dispensatory of Ibn at-Tilmid; Arabic Text, English Translation, Study, and Glossaries (2007)\n\n-  Koenig &amp; Al-Shohaib - Health and Well-Being in Islamic Societies; Background, Research, and Applications (2014)\n\n-  Leonard - Islam; Her Moral and Spiritual Values (1909)\n\n-  McGregor -  Sanctity and Mysticism in Medieval Egypt, The Wafa Sufi Order and the Legacy of Ibn 'Arabi (2004)\n\n-  Milchert - Ahmad ibn Hanbal (2006)\n\n-  Mirakhor &amp; Askari - Islam and the Path to Human and Economic Development (2010)\n\n-  Netton - Al-Farabi and His School (1992)\n\n-  Sachedina - Islamic Biomedical Ethics; Principles and Application (2009)\n\n-  Sayeed - Women and the Transmission of Religious Knowledge in Islam (2013)\n\n-  Shuraydi - The Raven and the Falcon; Youth versus Old Age in the Medieval Arabic Literature (2014)\n\n-  Steenbergen - Order Out of Chaos; Patronage, Conflict and Mamluk Socio-Political Culture, 1341-1382 (2006)\n\n-  Stiles - An Islamic Court in Context; an Ethnographic Study of Judicial Reasoning (2009)\n\n-  Swain (Ed.) - Seeing the Face, Seeing the Soul; Polemon's Physignomy from Classical Antiquity to Medieval Islam (2007)\n\n-  van Berkel et al - Crisis and Continuity at the Abbasid Court; Formal and Informal Politics in the Caliphate of al-Muqtadir, .. (2013)\n\n-  Weiss - The Search for God's Law; Islamic Jurisprudence in the Writing of Sayf al-Din al-Amidi, rev. ed. (2010)\n\n-  Yazaki - Islamic Mysticism and Abu Talib al-Makki; the Role of the Heart (2013)","torrent":{"xt":"urn:btih:e7c5526c5682d2b83d66ccc576a31d2ef6801b23","amp;dn":"The+Medieval+Islamic+Civilization+-+C.+12+%28Thought%2C+Philosophy3%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e7c5526c5682d2b83d66ccc576a31d2ef6801b23","infoHashBuffer":{"type":"Buffer","data":[231,197,82,108,86,130,210,184,61,102,204,197,118,163,29,46,246,128,27,35]},"announce":[],"urlList":[]}}