{"title":"The Church of Mercy - Pope Francis - Audiobook MP3","uid":10706674,"size":130928080,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:e894c1e99bfc2c8afacd5d5a96aac46970e1ddbd&amp;dn=The+Church+of+Mercy+-+Pope+Francis+-+Audiobook+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Squiddy82","files":-1,"time":1407300575,"description":"MP3 CBR 64k Joint Stereo.\n\nAndroid users - This will work best with dedicated audiobook reader apps, such as Listen Audiobook Player.\n\niTunes users - When added to your library, iTunes will classify these MP3 files as music by default. To change to audiobook, browse music library in album view, right-click the album, and select &quot;Get Info&quot; from the context menu. Under [Options,] select [x] Media Kind: Audiobook, [x] Remember position: Yes, [x] Skip when shuffling: Yes. This will allow you to transfer the book to your iOS device while keeping it separate from your music collection. This will also keep your track position when listening in iTunes.\n\n\nThe Church of Mercy: A Vision for the Church\n\nWritten by: Pope Francis\nNarrated by: Paul Michael\nLength: 4 hrs and 34 mins\nFormat: Unabridged\nRelease Date:04-20-14\n\nIn the year since he was elected, Pope Francis' simple message of mercy, service, and renewal has spread to every corner of the world. Through his gentle demeanor, selfless actions, and welcoming call for service to others, he has captured the attention of a world longing for an authentic message of hope - we want to hear what he has to say.\n\nCollected from Pope Francis' speeches, homilies, and papers presented during the first year of his papacy, The Church of Mercy is the first Vatican-authorized book detailing his vision for the Catholic Church. From how to be citizens of the world to answering God's call for evangelization, Pope Francis' deep wisdom reminds us that the Church must move beyond its own walls and joyfully take God's mercy wherever suffering, division, or injustice exists.\n\nNamed Time magazine's 2013 &quot;Person of the Year&quot;, Pope Francis is helping the Church continue toward an authentic Christianity that is faithful to the Gospel and resonant with the world's greatest needs. The Church of Mercy encourages each of us to ignite the flame within to help share the light of Christ and revitalize the Church. ","torrent":{"xt":"urn:btih:e894c1e99bfc2c8afacd5d5a96aac46970e1ddbd","amp;dn":"The+Church+of+Mercy+-+Pope+Francis+-+Audiobook+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e894c1e99bfc2c8afacd5d5a96aac46970e1ddbd","infoHashBuffer":{"type":"Buffer","data":[232,148,193,233,155,252,44,138,250,205,93,90,150,170,196,105,112,225,221,189]},"announce":[],"urlList":[]}}