{"title":"Samurai Spy (1965)","uid":4789240,"size":688424514,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e9370b930fcdfac7497928bfae80ca52a6dd8627&amp;dn=Samurai+Spy+%281965%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"jgordon20904","files":2,"time":1237657493,"description":"Commentary for Japanese movie Samurai Spy (1965)\n-------------------------------------------------------------------------------\n\nThe legendary samurai Sasuke Sarutobi tracks a the spy Nojiri, while a mysterious figure named Sakon leads a band of men on their own quest for the wily Nojiri. By tale's end, no one knows just who is who and what side anyone is on. \n-------------------------------------------------------------------------------\nA Classic Piece of Japanese Cinema, 26 December 2005\n\nI cannot believe that the first review of this movie is considered as &quot;silly&quot;. I must say that if one were to watch this movie without bias they would have one of the best cinematic experiences of their life. I saw the new, digitally restored widescreen cut on IFC. The cinematography is gorgeous and the acting matches the script. I was completely enthralled by every frame on the screen. The story is complex, but that is what pulls you in to the story. We see Japan in the year 1614, after the Battle of Sekigahara. The Tokugawa and Toyotomi clans are on the brink of another war, even though the Toyotomi clan was defeated 14 years prior. Koji Takahashi is Sarutobi Sasuke a samurai that works for the Sanada clan, a group of spies who have not announced their allegiance officially, but are generally for Toyotomi. Sasuke is the classic reluctant hero. He cherishes life and wishes not to fight even though he is plunged in a world of treachery and deceit. His friend, Mitsuaki is a double agent and causes Sasuke to fall into the middle of a battle of secrecy between the spy clans of Tokugawa and Toyotomi. There are so many plot twists and interesting characters that you cannot help but become absorbed by this film. I do not want to discredit someone's opinions, but the first review of this film is a bit misguided. I urge the reader of this review to pick up the Criterion DVD of this film and have an experience that you will cherish forever. \n-------------------------------------------------------------------------------\nA convoluted but highly enjoyable early ninja-samurai chambara, 18 April 2006\n\nJapan's output of samurai related movies peaked both commercially and creatively in the sixties before starting to dwindle into outrageous gore and comic book adaptations in the seventies. These versions of the Japanese swordplay movie, referred to as &quot;chambara,&quot; were sophisticated tales of morality and politics, not simple romance and martial arts, which was popular in Hong Kong wuxia scene at the time. Lead by the great Akira Kurosawa, who established a new way of filming and presenting period pieces with classics like SEVEN SAMURAI, Japanese genre film-makers continued to pursue a sense of realism, tapping into post-war anxieties, all while subtly criticizing the political atmosphere at the time. Eventually though, new directors came and put their own spin on the genre, which is where SAMURAI SPY and its director, Masahiro Shinoda come in.\n\nThe story, like most chambara at the time, is based on historical fact, although, like many other chambara movies, it was also based on a novel, one entitled Ten Heroes of Sanada. The movie opens with the battle at Sekigahara, where the Tokugawa clan solidified its dominance over Japan, breaking the Toyotomi clans political power. While having been defeated, the Toyotomi were not completely destroyed, and they still had loyal retainers, including the infamous Yukimura Sanada. It is against this backdrop that folk hero Sasuke Sarutobi comes into the picture, working for the Sanada clan, and mostly wishing to maintain the uneasy peace that has come down on the country. Unfortunately for him, one of the spies working for the Yagyu, who owe fealty to the Tokugawa, wishes to defect to the Sanada clan, and he wants to enlist Sasuke's help. This leads to Sasuke being followed by crooked information dealers, rival ninjas, and a gaggle of local sheriffs and swordsman who wish to use the situation for their own personal gain.\n\nThe story itself does not even try to be accurate to history, and the novel it was based on, written in the Meiji era, probably didn't either. Sasuke Sarutobi is a folk hero, an invincible warrior type, and the story basically just sticks him in the middle of this complicated situation and pushes him around all over the place. The story line happens around Sasuke, as he hardly takes part in the events, and actually says so on numerous occasions throughout. This actually works well, as a hero, he comes off as cool, James Bond-ish, and a bit more clever than he probably should. Director Shinoda also keeps things visually interesting, mostly by panning furiously, something that was not done terribly often in such movies. This might have been intentional though, not only because the whipping movements, intense close-ups, and odd angles are visually arresting, but also because they emulate the muddled atmosphere of the story filled with double-crosses and hidden agendas. More than just being a fun little movie, there is a great deal of effort to portray the conflict between the rival spy clans as a metaphor for the cold war, which was no doubt more poignant in 1965. It does not descend into simple solutions or pantomime performance though, remaining dignified in spite of its political stances. If you wish, just ignore it, as it doesn't help or hinder the movie's entertainment value.\n\nBut while the visuals are easy to recognize as being stylized, the fight sequences may put some people off. With the exception of the opening mass battle, which was comprised of stock footage,the action is more like the ninja flicks that Sonny Chiba made, like SHOGUN'S SHADOW, the action is stylized, more kinetic than realistic. Kurosawa started the realism trend, as before the 2nd World War, the use of swordplay was operatic, much like the often maligned genre of wuxia from Hong Kong and Taiwan. SAMURAI SPY uses ninja tricks like reverse filmed jumps, hidden trampolines, and throwing weapons that apparently cannot be dodged or avoided. While none of this looks or sounds interesting compared to some of the complicated stunt work and sfx that has infested recent movies, this was special for something released at the time. Also special is the cast, which includes Koji Takahashi as Sasuke, and genre actor Kei Sato as one of the villains. The ever amusing Tetsuro Tamba gets another chance to show off his acting and swordplay abilities as the white clad and leprous Sakon Takatani, easily the most interesting of the villains.\n\nSAMURAI SPY is a pretty enjoyable movie, and one that not everybody is going to appreciate. The trick is to not expect great cinema, but just sit back and enjoy the double crosses and goofy martial arts fighting. For fans of martial arts movies, it's quite enjoyable to see early indications of where the genre's presentation of screen fighting would eventually end up before practically dying in the late eighties. This is comic book styled fun, not to be over-analyzed, but enjoyable in its willingness to entertain. ","torrent":{"xt":"urn:btih:e9370b930fcdfac7497928bfae80ca52a6dd8627","amp;dn":"Samurai+Spy+%281965%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9370b930fcdfac7497928bfae80ca52a6dd8627","infoHashBuffer":{"type":"Buffer","data":[233,55,11,147,15,205,250,199,73,121,40,191,174,128,202,82,166,221,134,39]},"announce":[],"urlList":[]}}