{"title":"Risen 3 - Titan Lords","uid":10864121,"size":4642141963,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e9fba4dabf6db45ffe86ef8bb01437642977c04a&amp;dn=Risen+3+-+Titan+Lords&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dougstamper","files":-1,"time":1408904838,"description":"Genre: RPG, 3D, 3rd Person\n\nWorld of Risen 3 by all the gods and the Titans suffered from wars, when the earth creates a new threat. The young soldier gets a kick out of the shadows and loses his soul. It acts as a way to regain lost in the darkness that is spreading around the world. His powerful allies can be expelled magicians. To get their help, he must track them refuge on Taranis also known as Thunder Island. Guarded guards, mages are looking for in the depths of the bowels of Taranis crystals filled with magical energy. Whether the player to join the guardians to contact the magi? Or he will choose other guild Risen 3 to achieve your goal? You decide!\nFeatures:\n- Freedom. Explore the world completely free, handle the job at your convenience. Tasks can be executed in different ways and the result will be different. Go through the game and develop your character the way you want.\n- Research. Discover new tasks and characters as you progress in the diverse world of Risen 3: Titan Lords. In the quaint medieval towns, damp and dismal mines, supernatural world of shadows - all offers countless possibilities to explore.\n- A new combat system. Introducing amended combat system with new techniques and movements, bringing even more variety in the battle.\n- The magic is back! Magic crystals returned, bringing with them new destructive combat capabilities. Master the elements lightning, fire and ice. Crush your enemies, or use a variety of auxiliary magic skills to facilitate your journey. The choice is yours!\n- Guilds and factions. Join one of the three guilds unlike anything. Each of them will offer its own unique equipment, skills and tasks that allow you to completely different ways to achieve the goal. Expand the plans of smaller communities, trying to change the balance of power in their favor. Be careful with those you trust - someone they can just pretend to be your friend, in pursuit of their own interests insidious.\n\nSystem Requirements:\nOS: Windows Vista SP2 / 7 SP1 / 8.\nProcessor: Dual Core 2.4 GHz\nMemory: 2 GB\nGraphics: 512 MB\n??Hard Drive: 7.5 GB\n\n\nBy Doug Stamper.\n","torrent":{"xt":"urn:btih:e9fba4dabf6db45ffe86ef8bb01437642977c04a","amp;dn":"Risen+3+-+Titan+Lords","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9fba4dabf6db45ffe86ef8bb01437642977c04a","infoHashBuffer":{"type":"Buffer","data":[233,251,164,218,191,109,180,95,254,134,239,139,176,20,55,100,41,119,192,74]},"announce":[],"urlList":[]}}