{"title":"The Fault in Our Stars - Colpa delle Stelle (2014) [DVD9 - Mul","uid":12390395,"size":7811649573,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:ea0844d32c395d3322e33f50a2fee3133fd920ab&amp;dn=The+Fault+in+Our+Stars+-+Colpa+delle+Stelle+%282014%29+%5BDVD9+-+Mul&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"JackieALF","files":106,"time":1441884987,"description":"\n\n\nThe Fault in Our Stars - Colpa delle Stelle\n\nThx to the Original Uploader (?)\n\nOriginal Title: The Fault in Our Stars\nCountry: Usa\nYear: 2014\nGenres: Drama, Romantic\nDirector: Josh Boone\nScreenplay: Scott Neustadter, Michael H. Weber\nPhotography: Ben Richardson\nProduction: 20th Century Fox\n\nShailene Woodley -&gt; Hazel Grace Lancaster\nAnsel Elgort -&gt;  Augustus &quot;Gus&quot; Waters\nLaura Dern -&gt; Frannie Lancaster\nNat Wolff -&gt; Isaac\nSam Trammell -&gt; Michael Lancaster\nWillem Dafoe -&gt; Peter Van Houten\nLotte Verbeek -&gt; Lidewij Vliegenthart\n\n\nPlot\n\n\nHazel Grace Lancaster, (Shailene Woodley) an intelligent and sarcastic Indianapolis teenager, has terminal thyroid cancer that has spread to her lungs. Believing she is depressed, Hazel's mother (Laura Dern) urges her to attend a cancer patients' support group to make friends. During a support meeting, Hazel meets Augustus Waters, (Ansel Elgort) a teenager who has lost a leg from bone cancer. Augustus invites Hazel to his house, where they bond. They agree to read each other's favorite novels; Hazel recommends An Imperial Affliction to Augustus, a novel about a cancer-stricken girl named Anna that parallels Hazel's experience. Augustus gives Hazel Counter Insurgence. After Augustus finishes the book, he expresses frustration with the novel's abrupt ending. Hazel explains that the novel's mysterious author, Peter Van Houten, retreated to Amsterdam following the novel's publication, and has not been heard from since.\n\nWeeks later, Augustus tells Hazel he has traced Van Houten's assistant, Lidewij, and has corresponded with Van Houten by email. Hazel writes to him to ask about the novel's ambiguous ending; Van Houten replies that he is only willing to answer in person. Hazel asks her mother if she can travel to Amsterdam, but she rejects it because of financial and medical constraints. Augustus surprises Hazel with tickets to Amsterdam donated by a charitable foundation.\n\nDays before the trip, Hazel suffers from pleural effusion and is sent to an intensive care unit (ICU). Her doctors are eventually persuaded to allow the trip. Hazel and Augustus arrive in Amsterdam and are presented with reservations for an expensive restaurant, paid for by Van Houten. During the meal, Augustus confesses his love for Hazel. They meet Van Houten, but are shocked to find he is a mean-spirited alcoholic; Lidewij arranged the meeting and their dinner on his behalf. Van Houten, angered by his assistant's actions, taunts Hazel for seeking answers to a piece of fiction and belittles her medical condition.\n\nAs the two leave the author's residence dejected, Lidewij invites them to go sightseeing to make up for their experience. The three visit the Anne Frank House, where Hazel struggles to climb the house's many stairs. At the end of the tour, Augustus and Hazel kiss to the applause of fellow tourists. They spend that night together in their hotel, and have sex for the first time. The next day, Augustus tells Hazel that his cancer has relapsed and spread throughout his body and is terminal. After their return to Indianapolis, Augustus' health worsens. Hazel receives a desperate call from Augustus late at night after he tries to get a new pack of cigarettes at the gas station. He is taken to the ICU for a few days and realizes he is close to death. Augustus invites his blind best friend Isaac (Nat Wolff) and Hazel to his pre-funeral, where they deliver eulogies they prepared. Hazel quotes Van Houten's text, and tells him she would not trade their short time together for anything.\n\nAugustus dies eight days later. At his funeral, Hazel is astonished to find Van Houten in attendance. He tells her he maintained correspondence with Augustus after Amsterdam and that Augustus had demanded he attend his funeral to make up for the spoiled trip. He tells Hazel that his novel is based on the experiences of his daughter Anna, who died from leukemia at a young age. Van Houten tries to tell Hazel about the fate of Anna's mother; he gives Hazel a piece of paper. Hazel, still upset with his behavior in Amsterdam, crumples up the paper and asks him to leave. Later, talking with Isaac, Hazel learns that Augustus had asked Van Houten to help him write a eulogy for her. She retrieves the crumpled paper and reads Augustus' words, which state his acceptance of death and his love for Hazel. Hazel lies on her back on her lawn looking up at the stars, smiling as she remembers Augustus and says &quot;Okay&quot;.\n\n\n\nGeneral Info\n\nCompression: No\nMovie Quality: DVD9\nSize: 7629 Mb\nLanguages: English, French, German, Italian Ac3 5.1, Commentary by Josh Boone and John Green\nSubtitles: English, French, German, Italian\nColors\nRuntime: Cinematografic version. 120 min., Extended version 127 min.\nMenu:Yes\nExtra: Promotional Featurettes, Gallery, Theatrical trailer\n\n\nScreenshots\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt2582846/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt2582846/&lt;/a&gt;","torrent":{"xt":"urn:btih:ea0844d32c395d3322e33f50a2fee3133fd920ab","amp;dn":"The+Fault+in+Our+Stars+-+Colpa+delle+Stelle+%282014%29+%5BDVD9+-+Mul","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea0844d32c395d3322e33f50a2fee3133fd920ab","infoHashBuffer":{"type":"Buffer","data":[234,8,68,211,44,57,93,51,34,227,63,80,162,254,227,19,63,217,32,171]},"announce":[],"urlList":[]}}