{"title":"Hey Marseilles - To Travels &amp; Trunks [2008][EAC/FLAC]","uid":11735796,"size":384242207,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ea11b035a6832b85559f7e68264c75b6f5905200&amp;dn=Hey+Marseilles+-+To+Travels+%26amp%3B+Trunks+%5B2008%5D%5BEAC%2FFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":1,"uploader":"dickspic","files":18,"time":1425564951,"description":"\nFLAC / Lossless / Log (100%) / Cue\nLabel/Cat#: CD Baby / Onto Entertainment #12954\nCountry: USA\nYear: June 29, 2010\nGenre: indie folk\nFormat:CD\n\n1. Marseilles\n2. To Travels &amp; Trunks\n3. Cannonballs\n4. Rio\n5. Cities\n6. Gasworks\n7. Someone to Love\n8. Hold the Morning\n9. Calabasas\n10. You Will Do For Now\n11. From a Terrace\n12. Cigarettes\n13. Goodbye to Versailles\n\nHey Marseilles fittingly refers to their seven-person outfit as &quot;folkestra,&quot; featuring a trumpet, accordion, viola, the occasional series of hand claps, and so on and so forth. Despite their bulky roster, their full-length debut To Travels and Trunks is a most graceful journal of passages far and hearts longing, letters written in cursive over long drives and sea rides.\n\nAs its title suggests, the album is in many ways a reflection on place, both physically and on a personal level, hitting tones both ruminative and romantic. One the one hand are nods to &quot;water towers and midwest towns&quot; (&quot;Cannonballs&quot;) and the rambunctious romp of &quot;Rio,&quot; but songs also ponder &quot;halos and hubris&quot; (&quot;You Will Do For Now&quot;), rebellion and complacence, and all the weight of closing doors to explore others. Ultimately, the question goes far beyond &quot;Where?&quot; and into whether you're willing to &quot;leave your love, your life to see the world go by&quot; (&quot;From A Terrace&quot;).\n\nStill, a desire to be anywhere but here comes through not only lyrically but in the motion of each piece from one style or mood to another more dramatic. This is underscored in &quot;Calabasas&quot; as it simmers from heavy, rocking chords into an arresting stretch of strings in one of the most intense turns of the entire album. The idea goes even further as &quot;Cigarettes&quot; shifts from a straightforward folk ditty to looming the full band into an epic plea for what once was. No song is stagnant, though some move more quietly than others. &quot;Cities&quot; begins with blue and jazzy piano, gradually drawing in drums and layers of subtle harmonies and finally melting into a meditation on &quot;cities alive with loneliness.&quot; In my imagination, those melancholic sighs of verse enter with their hands in their pockets, tiredly watching the cold, loveless dark of the alley ways from a pool of streetlight. The words of this song are few (a single verse repeated as if to echo in the emptiness), yet it is this very simplicity that gives this song such a superlative poignance.\n\nHey Marseilles' virtuosity lies in their diligence to place each note just so, as if each beat were bijoux delicately traced one by one. The poetry of their lyrics and their complex, evocative chamber pop charm are as much Paris sidewalk as patio swing or Seattle skyline, and you'll find that the end to this album is as unwanted as the end to a voyage of your own. An instrumental piece closes this album the same way it was opened, with waltzing, wistful piano akin to the small melody of a music box serving as a final testament to the gems within. Cleverly enough, the piece is titled &quot;Goodbye Versailles.&quot; You can consider it your own farewell to a thing of beauty.\n\nThe 2010 remastered version has been released in preparation for a national advertising campaign. It contains one additional track, &quot;Gasworks.&quot;","torrent":{"xt":"urn:btih:ea11b035a6832b85559f7e68264c75b6f5905200","amp;dn":"Hey+Marseilles+-+To+Travels+%26amp%3B+Trunks+%5B2008%5D%5BEAC%2FFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea11b035a6832b85559f7e68264c75b6f5905200","infoHashBuffer":{"type":"Buffer","data":[234,17,176,53,166,131,43,133,85,159,126,104,38,76,117,182,245,144,82,0]},"announce":[],"urlList":[]}}