{"title":"Andrew Hill - 1969 - Lift Every Voice (2001) [FLAC]","uid":8625651,"size":524523557,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ea190fee921082b05433e3c5ab82e7b6f8ed0450&amp;dn=Andrew+Hill+-+1969+-+Lift+Every+Voice+%282001%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":-1,"time":1372502267,"description":"proper eac rip with art log and cue\n\nThe CD reissue of Andrew Hill's remarkably advanced fusion of voices and jazz quintet not only resuscitates the long out of print 1969 LP Lift Every Voice from oblivion, it adds an entire unreleased, untitled album from 1970, more than doubling the original playing time. Having once composed a jazz opera, Hill usually treats his voices in a sustained operatic manner, but this is not a classical-jazz fusion; the voices are fastened onto a pure jazz quintet base. This is highly unusual, to say the least, yet it works surprisingly well, whether in wild wordless scat passages or when employed in the freedom-conscious lyrics of the title track. On the original Lift Every Voice album, Hill is joined by trumpeter Woody Shaw (who gets off some wicked muted licks on &quot;Ghetto Lights&quot;), an impassioned Carlos Garnett on tenor sax, Richard Davis on bass, and Freddie Watts on drums. This quintet is hardly a complacent hard bop outfit; like many of Hill's Blue Note bands, it searches and ruminates, backed by Watts' shifting, at times funky, rhythms. The 1970 album expands the palette of voices from seven to nine, and Hill's backup band changes over completely, featuring the always-crackling Lee Morgan on trumpet; Bennie Maupin's still-developing hard-edged tenor sax, bass clarinet, and dancing flute; Ron Carter on bass; and Ben Riley on drums. The concept is the same as it was in 1969, but Hill's material isn't quite as striking -- hence one probable reason why the album was shelved. Also, this music was perhaps too way out there for the traditional hard bop Blue Note audience and not commercial enough for the label's emerging R&amp;B slant. In any case, these would be among Hill's last sessions for Blue Note, after which he would shift operations to Colgate University en route to a doctorate. ","torrent":{"xt":"urn:btih:ea190fee921082b05433e3c5ab82e7b6f8ed0450","amp;dn":"Andrew+Hill+-+1969+-+Lift+Every+Voice+%282001%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea190fee921082b05433e3c5ab82e7b6f8ed0450","infoHashBuffer":{"type":"Buffer","data":[234,25,15,238,146,16,130,176,84,51,227,197,171,130,231,182,248,237,4,80]},"announce":[],"urlList":[]}}