{"title":"Kenny Rogers - The Last Ten Years (2nafish)","uid":6021362,"size":129763332,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:eae228edf15dbc830a00a13ad0a3b1017a00de6d&amp;dn=Kenny+Rogers+-+The+Last+Ten+Years+%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1291803160,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\nWater &amp; Bridges is an album by American country music singer Kenny Rogers. It was released on March 21, 2006 via Capitol Records Nashville. The album accounted for three singles: &quot;I Can't Unlove You,&quot; &quot;The Last Ten Years (Superman)&quot; and &quot;Calling Me,&quot; all of which charted on Hot Country Songs. These songs respectively reached peaks of 17, 56 and 53.\n\nThom Jurek of Allmusic rated the album three stars out of five, saying that it &quot;isn't a perfect record, but it's a sincere one.&quot;\n\nKenneth Donald Rogers (born August 21, 1938), better known as Kenny Rogers, is an American country music singer-songwriter, photographer, record producer, actor and entrepreneur. He has charted more than 120 hit singles across various music genres and topping the country and pop album charts for more than 200 individual weeks in the United States alone.\n\nTwo of his albums, The Gambler and Kenny, are featured in the About.com poll of &quot;The 200 Most Influential Country Albums Ever&quot;. He was voted the &quot;Favorite Singer of All-Time&quot; in a 1986 joint poll by readers of both USA Today and People. He has received hundreds of awards for both his music and charity work. These include AMAs, Grammys, ACMs and CMAs, as well as a lifetime achievement award for a career spanning six decades in 2003.\n\nLater success includes the 2006 album release, Water &amp; Bridges, an across the board hit, that peaked at #5 in the Billboard Country Albums sales charts, also charting high in the Billboard 200. The first single from the album, &quot;I Can't Unlove You,&quot; was also a chart hit. Remaining a popular entertainer around the world, the following year he completed a tour of the United Kingdom and the Ireland telling BBC Radio 2 DJ Steve Wright, his favorite hit was &quot;The Gambler&quot;. He has also acted in a variety of movies and television shows, most notably the title roles in Kenny Rogers as The Gambler and the MacShayne series as well as his appearance on the Muppet Show. Rogers currently resides in Nicholson, Georgia.\n\nRogers was born &quot;Kenneth Ray Rogers&quot; in Houston, Texas in 1938, the fourth of seven children born to Lucille (nÃƒÂ©e Hester), a nurse, and Edward Floyd Rogers, a carpenter. Rogers graduated from Jefferson Davis High School in Houston. According to the Texas birth records, his middle given name is Ray and he is sometimes credited in his film roles as &quot;Kenneth Ray Rogers&quot;.\n\nHe has been married five times. His fourth wife was actress Marianne Gordon Rogers. His current wife is the former Wanda Miller. He has a daughter and four sons.\n\nAs of 2005, Rogers had become an avid Atlanta Thrashers fan, and can often be seen at Philips Arena taking in a game.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:eae228edf15dbc830a00a13ad0a3b1017a00de6d","amp;dn":"Kenny+Rogers+-+The+Last+Ten+Years+%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eae228edf15dbc830a00a13ad0a3b1017a00de6d","infoHashBuffer":{"type":"Buffer","data":[234,226,40,237,241,93,188,131,10,0,161,58,208,163,177,1,122,0,222,109]},"announce":[],"urlList":[]}}