{"title":"The Complete Works of Pliny The Younger - Pliny The Younger","uid":13142259,"size":3362051,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:eb48ab57b25793fea5a2ebea173c1b74911db396&amp;dn=The+Complete+Works+of+Pliny+The+Younger+-+Pliny+The+Younger&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1451995500,"description":"The letters of Pliny the Younger have preserved for posterity a precious portrait of First Century life, detailing the daily routines of the Roman times and the men and women that inhabited the author’s world. The famous account of the eruption of Vesuvius and Emperor Trajan’s advice concerning the treatment of Christians are among the letters’ fascinating treasures. The Ancient Classics series provides eReaders with the wisdom of the Classical world, with both English translations and the original Latin texts. This comprehensive eBook presents the complete works of Pliny the Younger, with beautiful illustrations, informative introductions and the usual Delphi bonus material. (Version 1)\r\n\r\n• Beautifully illustrated with images relating to Pliny's life and works\r\n\r\n• Features the complete extant works of Pliny, in both English translation and the original Latin\r\n\r\n• Concise introductions to the letters and other works\r\n\r\n• Excellent formatting of the texts\r\n\r\n• Easily locate the letters or works you want to read with individual contents tables\r\n\r\n• Includes Pliny's rare oration PANEGYRICUS TRAIANI, first time in digital print\r\n\r\n• Provides a special dual English and Latin text, allowing readers to compare the epistles – ideal for students\r\n\r\n• Features a bonus biography - discover Pliny's ancient world\r\n\r\n• Scholarly ordering of texts into chronological order and literary genres","torrent":{"xt":"urn:btih:eb48ab57b25793fea5a2ebea173c1b74911db396","amp;dn":"The+Complete+Works+of+Pliny+The+Younger+-+Pliny+The+Younger","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb48ab57b25793fea5a2ebea173c1b74911db396","infoHashBuffer":{"type":"Buffer","data":[235,72,171,87,178,87,147,254,165,162,235,234,23,60,27,116,145,29,179,150]},"announce":[],"urlList":[]}}