{"title":"Why Marriages Succeed or Fail","uid":7857393,"size":232272155,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:ece2ca1e56ff0b9ccfced1dcd893c77aa171eafc&amp;dn=Why+Marriages+Succeed+or+Fail&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"cloak-and-dagger","files":-1,"time":1353807001,"description":"If You Love Your Mate but Your Marriage Seems to Be Off Track, Then This Book Is for You Psychologist John Gottman has spent 20 years studying what makes a marriage last. Now you can use his tested methods to evaluate, strengthen, and maintain your own long-term relationship. This breakthrough book guides you through a series of self-tests designed to help you determine what kind of marriage you have, where your strengths and weaknesses are, and what specific actions you can take to help your marriage.\n\nYou'll also learn:\n\n* More sex doesn't necessarily improve a marriage\n\n* Frequent arguing will not lead to divorce\n\n* Financial problems do not always spell trouble in a relationship\n\n* Wives who make sour facial expressions when their husbands talk are likely to be separated within four years\n\n* There is a reason husbands withdraw from arguments -- and there's a way around it\n\nDr. Gottman tells you how to recognize attitudes that doom a marriage -- contempt, criticism, defensiveness, and stonewalling -- and provides practical exercises, quizzes, tips, and techniques that will help you understand and make the most of your relationship. You can avoid patterns that lead to divorce, and -- Why Marriages Succeed or Fail will show you how.","torrent":{"xt":"urn:btih:ece2ca1e56ff0b9ccfced1dcd893c77aa171eafc","amp;dn":"Why+Marriages+Succeed+or+Fail","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ece2ca1e56ff0b9ccfced1dcd893c77aa171eafc","infoHashBuffer":{"type":"Buffer","data":[236,226,202,30,86,255,11,156,207,206,209,220,216,147,199,122,161,113,234,252]},"announce":[],"urlList":[]}}