{"title":"I-Doser - Black Sunshine - Apple Lossless","uid":4622583,"size":212939148,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:ed2074ce9a04001857b2e01263d94a4ef223dec6&amp;dn=I-Doser+-+Black+Sunshine+-+Apple+Lossless&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"alvinacres4848","files":1,"time":1231092763,"description":"I-Doser Black Sunshine. Highest Quality. Dose converted from .drg to .wav &amp; saved in Apple Lossless format. Read or play from iTunes convert to your favorite format from there. Keep your bitrate up!\n\nIf you prefer another format let me know. (FLAC is BS, IMO)\n\nI'll do one at a time and keep the quality up. Coming from Mac. No virus.\n\nBlack Sunshine\nRecreational (VERY STRONG)\n35 Minutes\n\nYou know a dose is good when all of a sudden our (I-Doser's) email box is spammed with high regards for a specific dose. That happened when White Crosses was released, another popular dose of ours. All everyone could talk about was White Crosses. Black Sunshine can be considered our first sequel dose. From the team who created White Crosses, comes BLACK SUNSHINE. They said they could do a dose just as good or better than White Crosses, and everybody laughed. Well, THEY DID IT! BLACK SUNSHINE  is the anti-stimulant. I wish we could easily put into words what this dose does, but it is so beyond words... let's try: It takes your brain and twists it so that everything shines with a beautiful glow, then it goes beyond and reverses all that glow deep inside you. There is no sunshine when you are looking face to face with your soul, and Black Sunshine puts you in a room with your soul and lets you two talk it out, but without talking. Communicating, with yourself, but so deep under you will strain to remember. Highly advanced, this dose attempts to bring you further under than any dose before it. Be warned, this is not a dose for everyone. If you aren't sure, stick to the lighter, more earthly, doses. A dose that can't be described. BLACK SUNSHINE.","torrent":{"xt":"urn:btih:ed2074ce9a04001857b2e01263d94a4ef223dec6","amp;dn":"I-Doser+-+Black+Sunshine+-+Apple+Lossless","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed2074ce9a04001857b2e01263d94a4ef223dec6","infoHashBuffer":{"type":"Buffer","data":[237,32,116,206,154,4,0,24,87,178,224,18,99,217,74,78,242,35,222,198]},"announce":[],"urlList":[]}}