{"title":"Jay Bell - Something Like Seasons Series 1 - 4","uid":12007924,"size":1579522409,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:ed51f8dac91e035b0b49407fdb84f67be76f9734&amp;dn=Jay+Bell+-+Something+Like+Seasons+Series+1+-+4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"katelynor","files":9,"time":1434003194,"description":"This series is the same story 4 times over ... with carry on and carry over between changes in character perspective.  I wasn't sure about the format, and found some of it tedious, but also fell in love with the characters differently in every book, shed some actual tears, and ultimately decided that I love this body of work as a whole.  \n\nSomething Like Summer\n\nThe hot Texas nights were lonely for Ben before his heart began beating to the rhythm of two words; Tim Wyman. By all appearances, Tim had the perfect body and ideal life, but when a not-so-accidental collision brings them together, Ben discovers that the truth is rarely so simple. If winning Tim's heart was an impossible quest, keeping it would prove even harder as family, society, and emotion threaten to tear them apart. Something Like Summer is a love story spanning a decade and beyond as two boys discover what it means to be friends, lovers, and sometimes even enemies\n\nSomething Like Winter\n\nThere are two sides to every story. When you're Tim Wyman, sometimes there are three. Tim hoped moving to Texas would mean a new beginning, but he soon finds himself falling into the same tired patterns. Until he meets recklessly brave Benjamin Bentley, who introduces Tim to a world of love, sex, and warmth. Certain that society won't understand what he and Ben have together, Tim struggles to protect their relationship, even if it means twisting the truth. Buried beneath his own deceptions, Tim must claw his way to the surface in the hopes of learning to fly. \n\nSomething Like Autumn\n\nFor some, love seems an impossible dream. Growing up gay in small-town Missouri, Jace Holden thought his chance would never come. When he meets Victor - a wild soul and fellow outsider - his chances of finding love go from bleak to a very uncertain, maybe. Bracing his heart, Jace chases after his desire, hoping for a warm hand to hold his tight. \n\nSomething Like Spring\n\nJason Grant doesn't have much, aside from a beat-up old guitar and knack for getting kicked out of foster homes. His latest placement is set to be just another in a long line of failures. Then he meets Caesar Hubbard, a handsome guy who lives down the hall. For the first time in his life, Jason wants to stay, which means learning to be part of a family, and not letting his feelings - or his actions - ruin his first real chance of falling in love. \n\nPlease seed and enjoy!","torrent":{"xt":"urn:btih:ed51f8dac91e035b0b49407fdb84f67be76f9734","amp;dn":"Jay+Bell+-+Something+Like+Seasons+Series+1+-+4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed51f8dac91e035b0b49407fdb84f67be76f9734","infoHashBuffer":{"type":"Buffer","data":[237,81,248,218,201,30,3,91,11,73,64,127,219,132,246,123,231,111,151,52]},"announce":[],"urlList":[]}}