{"title":"Technology, War and Fascism: Collected Papers of Herbert Marcuse","uid":11727093,"size":14456032,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ed5a78cdc2adaccc5010fe6a95f7dd26ec328d06&amp;dn=Technology%2C+War+and+Fascism%3A+Collected+Papers+of+Herbert+Marcuse&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1425114473,"description":"Herbert Marcuse is one of the most influential thinkers of our time. Born in Berlin, Marcuse studied philosophy with Husserl and Heidegger at the Universities of Freiburg and Berlin. Marcuse's critical social theory ingeniously fuses phenomenology, Freudian thought and Marxist theory; and provides a solid ground for his reputation as the most crucial figure inspiring the social activism and New Left politics of the 1960s and 1970s. The largely unpublished work collected in this volume makes clear the continuing relevance of Marcuse's thought to contemporary issues. The texts published here, dealing with concerns during the period 1942-1951, exhibit penetrating critiques of technology and analyses of the ways that modern technology produces novel forms of society and culture with new modes of social control. The material collected in Technology, War and Facism provides exemplary attempts to link theory with practice, to develop ideas that can be used to grasp and transform existing social reality.\nTechnology, War and Fascism is the first of six volumes of Herbert Marcuse's Collected Papers to be edited by Douglas Kellner. Each volume is a collection of previously un-published or uncollected essays, unfinished manuscripts and letters by one of the greatest thinkers of our time","torrent":{"xt":"urn:btih:ed5a78cdc2adaccc5010fe6a95f7dd26ec328d06","amp;dn":"Technology%2C+War+and+Fascism%3A+Collected+Papers+of+Herbert+Marcuse","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed5a78cdc2adaccc5010fe6a95f7dd26ec328d06","infoHashBuffer":{"type":"Buffer","data":[237,90,120,205,194,173,172,204,80,16,254,106,149,247,221,38,236,50,141,6]},"announce":[],"urlList":[]}}