{"title":"Belladonna.Cock.Happy.XXX.DVDRip.XviD","uid":6450418,"size":1462146066,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:ed5eae1ab883b3961b9d7e436c5c1fad68445f55&amp;dn=Belladonna.Cock.Happy.XXX.DVDRip.XviD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":6,"uploader":"chkm8te","files":39,"time":1307406374,"description":"Screens:  &lt;a href=&quot;\nhttp://4ufrom.me/viewer.php?file=08e3onx9v0f534d4bfx6.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://4ufrom.me/viewer.php?file=08e3onx9v0f534d4bfx6.jpg&lt;/a&gt;\n  &lt;a href=&quot;\nhttp://4ufrom.me/viewer.php?file=of22aii725aj0shsiw5g.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://4ufrom.me/viewer.php?file=of22aii725aj0shsiw5g.jpg&lt;/a&gt;\n  &lt;a href=&quot;\nhttp://4ufrom.me/viewer.php?file=hkm6ayvyyiwtvtl5cqp7.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://4ufrom.me/viewer.php?file=hkm6ayvyyiwtvtl5cqp7.jpg&lt;/a&gt;\n\n\nBelladonna, Brian Pumper, Kurt Lockwood, Lexington Steele, Tony T, Travis Knight\n\n\nSubtitled: &quot;Experience one whore's trip into ecstasy&quot;. As they say, you never forget how to ride a bike... it's the same for a cock! Belladonna has not had a cock in any of her holes for over 2 years. In Cock Happy, she'll take them in all 3 holes! First, Bella takes on the biggest and baddest, Lexington! She's swallowed him balls deep before, and she'll do it again in this all out ass-fucking bonanza! Next Bella gets ready to go out clubbing, unfortunately the power goes out. Not to worry, Tony the electric man comes to the rescue and gives her much more than she's paid for! Another all-anal fuck session between these two animals with nothing left to the imagination! Now it's Brian's turn for Bella. After he's caught masturbating to her in the bathroom, she offers herself to him for real! He takes advantage of the offer and gives her a nice anal cleansing! Belladonna becomes an adultress when Travis is in town for the weekend. Bye bye Bella's hubby, hello hard throbbing cock! Imagine what it would be like to have Belladonna for the night, and then wake up next to her wanting more! Time for a new mattress says Bella. Who better to deliver it than Kurt! And boy does he deliver! This guy isn't afraid of anything, and Bella isn't afraid to give it to him! From Bella's fingers in his ass to the two of them snowballing his cum! Don't miss the action! As a bonus scene, Holly Wellin finds herself in a bathroom, that wasn't intended for relieving yourself. It's for relieving everyone else. Holly sucks and fucks the anonymous cock through the glory holes as if she were trying to win a prize, and she does! The whole while, her boyfriend waits for her outside in the truck!\t","torrent":{"xt":"urn:btih:ed5eae1ab883b3961b9d7e436c5c1fad68445f55","amp;dn":"Belladonna.Cock.Happy.XXX.DVDRip.XviD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed5eae1ab883b3961b9d7e436c5c1fad68445f55","infoHashBuffer":{"type":"Buffer","data":[237,94,174,26,184,131,179,150,27,157,126,67,108,92,31,173,104,68,95,85]},"announce":[],"urlList":[]}}