{"title":"Orthopedic Physical Assessment 4e - David Magee","uid":8475634,"size":187406166,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:edc1867154ef4c87a68b5fc5a913da017bab8060&amp;dn=Orthopedic+Physical+Assessment+4e+-+David+Magee&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"siliconball","files":1,"time":1368607593,"description":"Publication Date: December 12, 2005 | ISBN-10: 141603109X | ISBN-13: 978-1416031093 | Edition: 4\n\nProviding additional value, the Enhanced Edition of Orthopedic Physical Assessment has been updated with a full color design for easier navigation and is packaged with an observational gait analysis tool on CD-ROM. This classic offers a straightforward, systematic approach to performing a neuromusculoskeletal assessment and explains the rationale behind various aspects of the assessment. Every joint of the body is covered, and separate chapters cover such specific topics as the principles of assessment, head and face, gait, posture, emergency care, and preparticipation evaluation. Complete and comprehensive in its approach, this outstanding reference covers basic science, clinical applications, and special tests. It also offers unparalleled coverage of the extremities, clear explanations of positions and movements, and extensive use of tables and illustrations including many radiographs to highlight key points.\n\nA systematic approach to performing a neuromusculoskeletal assessment and understanding the reasoning behind various aspects of the assessment. \n\nCoverage of every joint of the body, as well as chapters on specific areas such as principles of assessment, head and face, gait, posture, emergency care, and pre-participation evaluation. \n\nAssessment guidelines that detail each step of an evaluation, including history taking, observation, physical examination, differential diagnoses, and more. \n\nCase studies which provide guidance for developing differential diagnoses. \n\nMore information on peripheral nerves enables readers to differentiate between symptoms from radicular problems and those from peripheral nerve problems. \n\nCoverage of the extremities, clear explanations of positions and movements, and use of tables and illustrations (including many radiographs) to highlight key points.","torrent":{"xt":"urn:btih:edc1867154ef4c87a68b5fc5a913da017bab8060","amp;dn":"Orthopedic+Physical+Assessment+4e+-+David+Magee","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"edc1867154ef4c87a68b5fc5a913da017bab8060","infoHashBuffer":{"type":"Buffer","data":[237,193,134,113,84,239,76,135,166,139,95,197,169,19,218,1,123,171,128,96]},"announce":[],"urlList":[]}}