{"title":"Jean M. Auel Ebooks 5X (Dorien) 2Lions-Team","uid":5918201,"size":16778834,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:edc76c4885a25633bb4ceccf4717073db22d9d8a&amp;dn=Jean+M.+Auel+Ebooks+5X+%28Dorien%29+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Dorien69","files":-1,"time":1288313196,"description":"\n\n\n\nXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX\n\n  [IMG]http://i626.photobucket.com/albums/tt345/rocco64/Film%20poster/cover2.jpg[/IMG]\n\nDe Stam van de Holebeer - Jean M. Auel       \n\nDeel 1 van de serie: Earth's Children\n\nDe Stam van de Holebeer brengt ons terug naar het begin van onze beschaving, ruim 35OOO jaar geleden. De hoofdpersoon is Ayla, die de toekomst van de mensheid in haar bloed heeft. \nBij een aardbeving heeft ze haar familie verloren. \nAls ze daarna eenzaam door het woeste land trekt, wordt ze verwond door een leeuwin. Met enige tegenzin nemen de leden van de Stam haar op. \nDoor haar zuivere gelaatstrekken en grote intelligentie is zij een buitenbeentje. \nMet haar onstuimige trots probeert zij de vele taboes die de oude cultuur van de Stam beheersen te doorbreken en een eigen leven te leiden. \n'De Stam van de Holebeer' is het verhaal over het ontzagwekkende mysterie van het ontstaan van de mensheid en het drama van de menselijke strijd om te overleven. \n\n\nXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX\n\n[IMG]http://i626.photobucket.com/albums/tt345/rocco64/Film%20poster/cover3.jpg[/IMG]\n\n\n\nDe vallei van de paarden\n \nDeel 2 van de serie: Earth's Children\n\n\nJean M. Auels magistrale serie De aardkinderen vertelt het verhaal over het ontzagwekkende mysterie van het ontstaan van de mensheid en de harde strijd om te overleven in de prehistorie. \nHaar boeken hebben al miljoenen lezers meegevoerd naar de boeiende prehistorische wereld van Ayla en haar tijdgenoten. \nJean M. Auel ontving voor haar werk de Publiekprijs voor het Nederlandse Boek.\nAyla heeft de Stam van de Holenbeer, waar zij is opgegroeid, moeten verlaten. \nEenzaam en verdrietig trekt zij door het barre, prehistorische land van 35.000 jaar geleden, op zoek naar de Anderen, het volk van haar vader en moeder.\nMaar als de winter nadert, moet Ayla beschutting zoeken in een grot vlak bij een afgelegen vallei. \nDoor haar kracht en vindingrijkheid weet ze te overleven en sluit ze zelfs vriendschap met de dieren. Als ze op een dag een zwaargewonde jongeman vindt, komt ze voor een keuze te staan. \nMoet ze haar vertrouwde eenzaamheid inruilen voor de onzekerheid van menselijk gezelschap?\n`Na uitputtende research heeft Auel een fascinerend boek geschreven...een werk van pure verbeeldingskrachtÃ‚Â´. - The Guardian\n\n\n \n\n  \n\n \nXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX\n\n[IMG]http://i626.photobucket.com/albums/tt345/rocco64/Film%20poster/cover-2.jpg[/IMG]\n\n\n\nDe mammoetjagers - Jean M. Auel       \n\nDeel 3 van de serie: Earth's Children\n\n\nDe mooie en intelligente Ayla is inmiddels volwassen en in de ban van haar liefde voor Jondalar. \nMet hem trekt zij verder vanuit de vallei waar zij bescherming vonden. Hun reis brengt hen bij de stam van de MamutiÃƒÂ«rs, \nde Mammoetjagers. Hun leider is Talut, een roodharige boom van een man, met een bulderende lach en een zacht karakter. \nWanneer Ayla is geadopteerd door Mamut, de oude sjamaan van de Grote Aardmoeder, kan zij haar talenkennis en haar kundigheid op het gebied van medicijnen en heelkunde gaan gebruiken op de MamutiÃƒÂ«rs te helpen. \nMaar zij heeft er ook de fascinerende meesterbeeldhouwer Ranec ontmoet, tot wie zij zich - tegen haar wil - als door een magneet voelt aangetrokken. \nHet conflict is geboren wanneer zij in tweestrijd komt te staan. Wat weegt zwaarder... haar liefde voor de zorgzame maar jaloerse Jondalar of haar steeds sterker wordende gevoelens voor Ranec? \n\n\n \n \n \n\n \nXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX\n\n[IMG]http://i626.photobucket.com/albums/tt345/rocco64/Film%20poster/cover4.jpg[/IMG]\n\nHet dal der beloften - Jean M. Auel       \n\nDeel 4 van de serie: Earth's Children\n\nJean M. Auels magistrale serie De aardkinderen vertelt het verhaal over het ontzagwekkende mysterie van het ontstaan van de mensheid en de harde strijd om te overleven in de prehistorie. \nHaar boeken hebben al miljoenen lezers meegevoerd naar de boeiende prehistorische wereld van Ayla en haar tijdgenoten. Jean M. Auel ontving voor haar werk de Publiekprijs voor het Nederlandse Boek.\nAyla en haar geliefde Jondalar weten dat zij voor elkaar bestemd zijn en verlangen naar een thuis. Ze nemen het moeilijke besluit om de stam van de MamutiÃƒÂ«rs te verlaten en gaan op weg naar Jondalars eigen volk. \nSamen met Wolf en de paarden Winny en Renner trekken ze dwars over het Europese continent van 35.000 jaar geleden.\nDe reis door de prehistorische natuur is schitterend en opwindend, maar vol gevaren. En het is niet alleen de natuur die een bedreiging vormt. Zullen zij ooit Jondalars volk bereiken? Maar Ayla draagt het teken van de Grote Aardmoeder in zich, \nen haar bestemming gaat veel verder dan zij of Jondalar ooit kan vermoeden...\n`Spannend voor een zeer groot publiek.Ã‚Â´ - Vrij Nederland\n\n\n\n\nXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX\n\n[IMG]http://i626.photobucket.com/albums/tt345/rocco64/Film%20poster/cover5.jpg[/IMG]\n\n\nVuurplaats in Steen - Jean M. Auel       \n\nDeel 5 van de serie: Earth's Children\n\nJean M. Auels magistrale serie De aardkinderen vertelt het verhaal over het ontzagwekkende mysterie van het ontstaan van de mensheid en de harde strijd om te overleven in de prehistorie. Haar boeken hebben al miljoenen lezers meegevoerd naar de boeiende prehistorische wereld van Ayla en haar tijdgenoten. \nJean M. Auel ontving voor haar werk de Publiekprijs voor het Nederlandse Boek.\nEindelijk, na een reis vol gevaren over de grote gletsjer, arriveren Ayla en Jondalar bij het volk van de ZelandoniÃƒÂ«rs. Marthona, de moeder van Jondalar, ontvangt hen met open armen. Ook Zelandoni, de geestelijke leidster van het volk en de vrouw die Jondalar inwijdde in de liefde, \nis onder de indruk van Ayla en wil haar tot haar leerling maken. \nMaar behalve bewondering dwingt Ayla ook afgunst en wantrouwen onder de grotbewoners af. Het doet haar beseffen dat ze nog een lange weg te gaan heeft voordat Jondalars volk haar zal accepteren. Maar wil ze dat ook werkelijk? En zal de geest van de holenleeuw het toestaan?\nÃƒÂ«Het werk van Jean Auel heeft een buitengewone aantrekkingskracht op lezers van alle leeftijden. Dit laatste deel in haar prehistorische romanserie is onmogelijk neer te leggen... \nZe is een bewonderenswaardige schrijfster en ze verdient het grootst denkbare eerbetoon. - Rosamunde Pilcher\n\n\n\n \n \n\n \n \nXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX\n\n\n\n\n[IMG]http://i626.photobucket.com/albums/tt345/rocco64/Eenbedankjedaardoenwehetvoor.gif[/IMG]\n\n\n*****************************************\n\nBrought to you by Dorien\n2Lions Team\n\n\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\nto the fakers , get a life !!!\n\n********************************************* \n\n[IMG]http://i626.photobucket.com/albums/tt345/rocco64/torrent%20sites/flyer2Lions.png[/IMG]\n\n\n","torrent":{"xt":"urn:btih:edc76c4885a25633bb4ceccf4717073db22d9d8a","amp;dn":"Jean+M.+Auel+Ebooks+5X+%28Dorien%29+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"edc76c4885a25633bb4ceccf4717073db22d9d8a","infoHashBuffer":{"type":"Buffer","data":[237,199,108,72,133,162,86,51,187,76,236,207,71,23,7,61,178,45,157,138]},"announce":[],"urlList":[]}}