{"title":"Jazz, Rock, and Rebels: Cold War Politics and American Culture i","uid":8310001,"size":3265247,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:eeffd8a253f95d3b3d51d9e5f13f7194eba0e539&amp;dn=Jazz%2C+Rock%2C+and+Rebels%3A+Cold+War+Politics+and+American+Culture+i&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"tmPhoneix","files":1,"time":1364458712,"description":"Book Description\nPublication Date: March 3, 2000 | ISBN-10: 0520211391 | ISBN-13: 978-0520211391 | Edition: 1\nIn the two decades after World War II, Germans on both sides of the iron curtain fought vehemently over American cultural imports. Uta G. Poiger traces how westerns, jeans, jazz, rock 'n' roll, and stars like Marlon Brando or Elvis Presley reached adolescents in both Germanies, who eagerly adopted the new styles. Poiger reveals that East and West German authorities deployed gender and racial norms to contain Americanized youth cultures in their own territories and to carry on the ideological Cold War battle with each other. Poiger's lively account is based on an impressive array of sources, ranging from films, newspapers, and contemporary sociological studies, to German and U.S. archival materials.\nJazz, Rock, and Rebels examines diverging responses to American culture in East and West Germany by linking these to changes in social science research, political cultures, state institutions, and international alliance systems. In the first two decades of the Cold War, consumer culture became a way to delineate the boundaries between East and West. This pathbreaking study, the first comparative cultural history of the two Germanies, sheds new light on the legacy of Weimar and National Socialism, on gender and race relations in Europe, and on Americanization and the Cold War.","torrent":{"xt":"urn:btih:eeffd8a253f95d3b3d51d9e5f13f7194eba0e539","amp;dn":"Jazz%2C+Rock%2C+and+Rebels%3A+Cold+War+Politics+and+American+Culture+i","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eeffd8a253f95d3b3d51d9e5f13f7194eba0e539","infoHashBuffer":{"type":"Buffer","data":[238,255,216,162,83,249,93,59,61,81,217,229,241,63,113,148,235,160,229,57]},"announce":[],"urlList":[]}}