{"title":"Windows Washer","uid":4063217,"size":3868384,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:efe20a7e0cbf23bd7ae1b16e8ac0f3cccc78738e&amp;dn=Windows+Washer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Demonbitz","files":3,"time":1204684560,"description":"Windows Washer 6.5\n &lt;a href=&quot;\nhttp://www.webroot.com/En_US/consumer-products-windowwasher.html#&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.webroot.com/En_US/consumer-products-windowwasher.html#&lt;/a&gt;\n\n\nWhat&amp;#039;s New in Version 6.5\nWindows Vista Compatible \nExpanded application cleaning for over 470 3rd party programs \nUpdated interface makes it faster and easier to keep your privacy \nErases tracks of sites you&amp;#039;ve visited \nRemoves thousands of unnecessary files \nIncreases computer performance \nSecurely removes files using government standards \nHighly rated by independent reviews \nCan be set to clean your computer on a regular schedule\n\n\n\n\nWindows Vista? Compatible\nWebroot Window Washer now supports Microsoft&amp;#039;s Windows Vista Operating System. For more information see http://www.webroot.com/vista.\n\nExtensive Wash Areas\nWindow Washer scrubs hundreds of areas on your PC to remove unnecessary files to ensure your privacy and free up valuable disk space.\n\nBrowser Activity Eraser\nWindow Washer cleans all aspects of your browser activity, including Internet history, address bar, cache, cookies, and more. Firefox users now enjoy the same online privacy protection that users of Internet Explorer, AOL and Netscape already enjoy.\n\nPermanent Bleaching\nBleach, an encryption feature, completely overwrites files with random characters to make them unrecoverable. This feature is so powerful it exceeds the tough standards of the Department of Defense and the National Security Agency.\n\nFree Space Cleaner\nFree space on your computer contains portions of old and previously deleted files and documents. Window Washer now cleans this area making the files you deleted earlier permanently unrecoverable.\n\nOne-click Shredder\nWindow Washer lets you simply and conveniently shred a folder and all of its contents, or just a single file, in one step. Just a simple right-click will permanently overwrites these files, making them unrecoverable.\n\nCritical File Protection\nWindow Washer includes built-in safety features to help prevent you from accidentally removing important files. Alerts prompt you to confirm your request to delete special folders, like system folders, My Documents, My Photos, and others, so they remain safe from unintentional deletions.\n\nSmart Cookie Saver\nWindow Washer deletes the cookies you don&amp;#039;t want and lets you keep and save those you do. That way you maintain your preferred Internet settings and log-ins for all your favorite sites.\n\nFlexible Washes\nDuring a wash, Window Washer automatically cleans the latest versions of your favorite programs such as Microsoft Office, Google Search Toolbar, iTunes, Adobe Flash Player, Adobe Acrobat and hundreds more, to keep these programs running smoothly.\n\nAutomatic Wash Cycles\nYou can set Window Washer to automatically clean your system at specified intervals, like at shut down or start up. For added security, we recommend setting Window Washer to wash when you close your Internet browser.\n\nTotal System Erase\nWindow Washer can be set to fully erase your hard drive, files, programs and operating system for easy re-formatting. Consider using this feature if you&amp;#039;re donating or selling your PC and you don&amp;#039;t want your files to be seen by strangers.\n","torrent":{"xt":"urn:btih:efe20a7e0cbf23bd7ae1b16e8ac0f3cccc78738e","amp;dn":"Windows+Washer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"efe20a7e0cbf23bd7ae1b16e8ac0f3cccc78738e","infoHashBuffer":{"type":"Buffer","data":[239,226,10,126,12,191,35,189,122,225,177,110,138,192,243,204,204,120,115,142]},"announce":[],"urlList":[]}}