{"title":"Kobe Doin' Work- by Spike Lee (2009) (TV)","uid":4910074,"size":2417270643,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f149533a28a391567382a80c7b69c0b38252af40&amp;dn=Kobe+Doin%5C%27+Work-+by+Spike+Lee+%282009%29+%28TV%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"glicopal","files":1,"time":1243107234,"description":"Here's the deal with Kobe Doin' Work: if you're just a basketball fan, let alone a Kobe Bryant fan, this is mandatory viewing. After seeing this at the Tribeca Film Festival it was clear who this document of a basketball game, not even so much a documentary, was aimed at. For example, my brother would watch this and be hooked minute one, while my wife would steer clear faster than you can say blueberry pie. Spike Lee had a goal here and he executed it masterfully, but it's not an all-around crowd-pleaser unless, as mentioned, the whole crowd digs the Lakers and Kobe Bryant and the methods and sportsmanship of basketball in general. As someone who is neutral I had a good perspective of it, enjoying it and being interested for what it was, even as I knew I might not watch it again when it comes time for its airing on ESPN.\n\nThis is to basketball what Scorsese's Shine a Light did for the Rolling Stones - setting up dozens of cameras, we're given so many points of view and angles and set-ups on a straightforward 4-quarter-long basketball game between the Lakers and the Spurs. That it also gives unlimited options for editing and creating texture and speed and variance is a bonus for the interested viewer. At the same time there's another twist Lee implements that is clever: an audio commentary from Bryant (with occasional snippets of questions or observations from Lee) on the game, all of the decisions made in strategy and the practicality of the game, or just some of the little things that one wonders about how a player does the work on the court, the cues the player picks up from the others, the cues gaged from the opposing team, little lessons learned, mistakes, and of course goofs. On top of this, Bryant has a microphone on his jersey so we hear everything he says, from mundane to down-n-dirty leadership, throughout and even in the locker room.\n\nI was never bored by any of the action, and Lee's little flourishes of style added some verve (and of course that typical jazz score as well placed about during the game) but, again, it's a niche thing. The same viewer who was fascinated by Inside Man may not immediately go to Kobe Doin' Work. And yet I can recommend it without a doubt in my mind for its intended audience, the sports geeks and guys and girls who live for basketball. It's made by a fan for the fans. For everyone else, it's a fun viewing once, with a little of the personal side of Bryant sprinkled at the end. It is what the title says, and it's damn proud of it. 7.5/10","torrent":{"xt":"urn:btih:f149533a28a391567382a80c7b69c0b38252af40","amp;dn":"Kobe+Doin%5C%27+Work-+by+Spike+Lee+%282009%29+%28TV%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f149533a28a391567382a80c7b69c0b38252af40","infoHashBuffer":{"type":"Buffer","data":[241,73,83,58,40,163,145,86,115,130,168,12,123,105,192,179,130,82,175,64]},"announce":[],"urlList":[]}}