{"title":"Petersburg_ A Novel in Eight Ch - Andrei Bely.epub","uid":9151985,"size":2325611,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f1fbefb0c3a20a9773db356a6e23c0c84ad3acef&amp;dn=Petersburg_+A+Novel+in+Eight+Ch+-+Andrei+Bely.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"420weedman","files":1,"time":1383710970,"description":"Andrei Bely's masterpiece Petersburg is a vivid, striking story set at the heart of the 1905 Russian revolution. This Penguin Classics edition is translated from the Russian by David McDuff with an introduction by Adam Thirlwell.\n\nSt Petersburg, 1905. An impressionable young university student, Nikolai, becomes involved with a revolutionary terror organization, which plans to assassinate a high government official with a time bomb. But the official is Nikolai's cold, unyielding father, Apollon, and in twenty-four hours the bomb will explode. Petersburg is a story of suspense, family dysfunction, patricide, conspiracy and revolution. It is also an impressionistic, exhilarating panorama of the city itself, watched over by the bronze statue of Peter the Great, as it tears itself apart. Considered by writers such as Vladimir Nabokov to be one of the greatest masterpieces of the twentieth century, Bely's richly textured, darkly comic and symbolic novel pulled apart the traditional techniques of storytelling and presaged the dawn of a new form of literature.\n\nThis acclaimed translation captures all the idiosyncrasies and rhythms of Bely's extraordinary prose. It is accompanied by an introduction by Adam Thirwell discussing the novel's themes, extraordinary style and influence.\nGenre: Fiction, classics\n","torrent":{"xt":"urn:btih:f1fbefb0c3a20a9773db356a6e23c0c84ad3acef","amp;dn":"Petersburg_+A+Novel+in+Eight+Ch+-+Andrei+Bely.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1fbefb0c3a20a9773db356a6e23c0c84ad3acef","infoHashBuffer":{"type":"Buffer","data":[241,251,239,176,195,162,10,151,115,219,53,106,110,35,192,200,74,211,172,239]},"announce":[],"urlList":[]}}