{"title":"The Training of O------ToO-17985 Bobbi Starr","uid":7026166,"size":4180565441,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:f2504a597de54bfbc54651bdede7867ba4316cd2&amp;dn=The+Training+of+O------ToO-17985+Bobbi+Starr&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"merzedes","files":-1,"time":1329010439,"description":"Request  \n\n\n From Kink.com     (The Training of O)   wmv+mp4\n\n\n\nClassic Shoot- Where it all Began\nThe Training of Bobbi Starr, Day One\n\n\n\nAVN Female Performer of the Year 2012, Bobbi Starr, was the first to be trained for this site. What better way to celebrate her achievements and progress, than to show where she started her journey. \n\n\nApplicant Profile \n\n\n\n\nAge: 24\nSign: Aries\nHeight: 5'8'' \n\nFears / Current Limits: Applicant is uncomfortable with hoods, small spaces. Harbors some anxiety towards shooting in unknown circumstances but willing to move forward.\n \nStrengths: Enjoys canes. Loves her pussy and ass stretched. Open-minded, turned on by anonymous sex, inter-racial sex. Claims to be a very good cock sucker. She is intelligent, well read, and talented in areas other than sex and BDSM.\n \nWeaknesses: Poor verbal skills, very inexperienced with BDSM, poor understanding of Master / slave power exchange.\n \nExperience: First BDSM scene on Waterbondage, Feb. 2006. One previous boy/girl scene. Very limited BDSM experience.\n \nCurrent Status: Unowned novice.\n \nInitial Observations:Applicant maintains good eye contact and appears attentive and engaging. Good candidate for the test shoot - she is new, relatively inexperienced, and sexually adventurous. Considers herself a feminist, and claims to be 'very controlling' in her personal life. Applicant indicates she is eager to understand how someone allows themselves to be called a 'slave'.\n \nRecommendations: Test her reactions to pain with intense predicament bondage, cane and flogger. Test and begin to improve verbal skills by tying her up, stuffing her mouth with hard cock and electrocuting her pussy, only offering relief when she delivers dirty talk. Cover her with come, then hose her down and scrub her with harsh brushes before plugging her ass and pussy and locking them in with a chastity belt. Send her across town to her quarters for the key. Invade the applicant's quarters unannounced in the middle of the night. Tie her up and fuck her mercilessly while probing for new weaknesses and strengths. Leave her fully used and covered in come and rope marks with a 9 am call time.\n \nExtra Studies: Reading assignment on the principal of obedience. \n\n\nScreens  &lt;a href=&quot; http://www.thetrainingofo.com/site/shoot.jsp?shootId=17985&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.thetrainingofo.com/site/shoot.jsp?shootId=17985&lt;/a&gt;\n\n\nCheers  :-)\n","torrent":{"xt":"urn:btih:f2504a597de54bfbc54651bdede7867ba4316cd2","amp;dn":"The+Training+of+O------ToO-17985+Bobbi+Starr","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2504a597de54bfbc54651bdede7867ba4316cd2","infoHashBuffer":{"type":"Buffer","data":[242,80,74,89,125,229,75,251,197,70,81,189,237,231,134,123,164,49,108,210]},"announce":[],"urlList":[]}}