{"title":"They Call Me Sirr (2001)","uid":4636405,"size":734263296,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f306bea4496e16eac06647087c7d4dfec5ea1a4d&amp;dn=They+Call+Me+Sirr+%282001%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":2,"uploader":"amber11585","files":1,"time":1231566830,"description":"Sirr Parker's (Kente Scott, The Nutty Professor II) life is not easy, but the young man is filled with energy, ambition and a passion for football. When high school coach Griffin (Academy Award nominee Michael Clarke Duncan, The Green Mile) meets Sirr, he is impressed by Sirr's innate football talent and a partnership develops between the ball player and his coach that has surprising results for both of them. Based on the true story of Cincinnati Bengals running back, Sirr Parker, They Call Me Sirr is about the triumph of spirit over adversity that can only happen when an inspiring coach believes in a young boy. \n \n\nEditor's Note\n\nTHEY CALL ME SIRR is the true story of Sirr Parker, a talented young football player who overcame a troubled inner-city life in South Central Los Angeles to become a USA Today All-American and an NFL professional. Sirr (Kente Scott) and his young baby brother, Donyea, live with their grandmother (Jackie Richardson) while their mother struggles with alcoholism. After the death of Sirr's grandmother, he becomes a surrogate father to his little brother and begins attending Monroe High School. The football coach a the new school is legendary for producing outstanding players. Coach Griffin (Michael Clarke Duncan) sees something special in Sirr and encourages him to work and study hard. Sirr manages to maintain a 3.9 grade point average and becomes the L.A. Times Player of the year while secretly raising his brother alone and working part-time. THEY CALL ME SIRR is an inspiring, passionate film.\n\nThe real Sirr Parker went on to attend college at Texas A&amp;M and lead his team to a Big 12 Championship over Kansas State in 1998. In 1999, Sirr made it to the NFL and is currently playing for the Cincinnati Bengals.\n\n\n\nRunning Time:  1:36:46\nVideo:  Xvid avi\nLanguage:  English\nAudio:  AC3\nResolution:  544x416","torrent":{"xt":"urn:btih:f306bea4496e16eac06647087c7d4dfec5ea1a4d","amp;dn":"They+Call+Me+Sirr+%282001%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f306bea4496e16eac06647087c7d4dfec5ea1a4d","infoHashBuffer":{"type":"Buffer","data":[243,6,190,164,73,110,22,234,192,102,71,8,124,125,77,254,197,234,26,77]},"announce":[],"urlList":[]}}