{"title":"Star Hunters","uid":4825082,"size":51377960,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:f362a0568bc8cb70ba6e9feb02cfae83ea78e866&amp;dn=Star+Hunters&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gilgamesh07","files":10,"time":1238916150,"description":"Ladies and gentlemen, by request from the forums, this torrent contains the complete run of DC comics' Star Hunters series.\n\n\nThis short lived series ran from 1977 into 1978. The series started with story by David Michelinie and art by Don Newton and Bob Layton. Newton did pencil art for the first two stories and was gone by issue 2 of the regular series. Rich Buckler joined to do pencil art as of issue 4, Bob layton continued inks through issue 5 and was then replaced by Tom Sutton. \n\nThe story is set in the far future on an Earth ruled by a ruthless corporation that holds a stranglehold on precious and limited resources. Donovan Flint and a group of others who are shanghaid by the corporation, infected by a virulent virus that will kill them if the set foot on Earth, and are sent on a mission to find the origins of human life in the universe. \n\nThere is adventure and intrigue and of course a hidden agenda that is far worse than the story that Flint and his team are told in the first place. \n\nThe series ended without coming to closure with issue 7 as a casualty of sagging economy and poor sales.\n\nIt is unknown if this series and its characters will ever turn up in one of DC's future major comic universe events that serve to maintain copyright over seldom seen charaters, if little else.\n\nAt any rate, it was enjoyable to read back in the day and is worth a look in the here and now.\n\nThanks to the scanners and the original sources.\n\nPlease seed. Please enjoy. ","torrent":{"xt":"urn:btih:f362a0568bc8cb70ba6e9feb02cfae83ea78e866","amp;dn":"Star+Hunters","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f362a0568bc8cb70ba6e9feb02cfae83ea78e866","infoHashBuffer":{"type":"Buffer","data":[243,98,160,86,139,200,203,112,186,110,159,235,2,207,174,131,234,120,232,102]},"announce":[],"urlList":[]}}