{"title":"Franklin.and.Bash.S03E08.HDTV.XviD-AFG","uid":8766455,"size":355718377,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f3af00cb8dbbfc0d5175496cfc27f0c164b91fe3&amp;dn=Franklin.and.Bash.S03E08.HDTV.XviD-AFG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Thhaque","files":2,"time":1375344164,"description":"Franklin &amp; Bash\n\nGenre: Comedy, Drama\nYear: 2012\nCountry: USA\nRuntime: 42 min\nProducer: Jason Ensler\nCast: Mark-Paul Gosselaar, Breckin Meyer, Malcolm McDowell\n\n.: Plot :.\nWhen they're not hanging out at their favorite hot dog stand pontificating on what they'd go through to enjoy a night with their favorite female celebrities, Jared Franklin (Breckin Meyer) and Peter Bash (Mark-Paul Gosselaar) are chasing down their latest clients...sometimes literally. With business cards in hand, they're ready to nab a client within seconds after a car accident, arrest for solicitation or any other incident where their legal services may be needed. Once in the courtroom, they show their flair for the dramatic and the shocking.\n\nPeter has a knack for connecting with jury and judge, while Jared loves sticking it to authority every chance he gets. Despite their bad-boy antics, brash presentation and devil-may-care attitudes, Jared and Peter are good lawyers who are willing to do anything for a client, no matter who the client might be. That quality catches the attention of Stanton Infeld (Malcolm McDowell), a Renaissance man and the patriarch of Infeld Daniels, one of the top law firms in Los Angeles. He sees a lot of himself in the young men and decides to recruit the pair to bring a fresh energy to the firm. Jared and Peter are joined by their two legal aides, the brilliant, brassy Carmen (Dana Davis) and the agoraphobic, verminophobic Pindar (Kumail Nanjiani). \n\nInfeld's decision to take on fresh talent doesn't sit well with his nephew, Damien Karp (Reed Diamond), a lawyer who has his own plans for the firm and a particularly shifty way of doing business. The arrival of Jared and Peter also threatens Karp's romantic - albeit celibate - relationship with Hanna Linden (Garcelle Beauvais), a lawyer who takes an immediate liking to Jared. \n\nIn their new digs at Infeld Daniels, Jared and Peter handle a variety of clients, from a woman fired for being too beautiful to a family feud over a cherished baseball. But their story is really about the incredible friendship they've built and how their relationship is challenged now that they find themselves working in a more corporate atmosphere. Only time will tell if these devoted buddies can survive in this new environment.","torrent":{"xt":"urn:btih:f3af00cb8dbbfc0d5175496cfc27f0c164b91fe3","amp;dn":"Franklin.and.Bash.S03E08.HDTV.XviD-AFG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f3af00cb8dbbfc0d5175496cfc27f0c164b91fe3","infoHashBuffer":{"type":"Buffer","data":[243,175,0,203,141,187,252,13,81,117,73,108,252,39,240,193,100,185,31,227]},"announce":[],"urlList":[]}}