{"title":"Warhammer 40k - Index Chaotica - Terminus Est","uid":9331959,"size":5617860,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f3eaa07cdfc9658eb48b0a4fea47ec79afbfccfb&amp;dn=Warhammer+40k+-+Index+Chaotica+-+Terminus+Est&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ronin0000","files":2,"time":1386784739,"description":"Book: Warhammer 40k - Chaos Space Marine Legions\nThis book consists of articles from Wikia or other free sources online. Pages: 150. Chapters: 63rd Expeditionary Fleet, Adharon's Reavers, Alpha Legion, Angels of Ecstasy, Angels of Flame, Angron, Apocalypse Company, Apostles of Contagion, Apostles of MinthRas, Astral Claws, Beasts of Annihilation, Berserkers of Skallathrax, Betrayers of Pain, Black Brethren of Ayreas, Black Legion, Blood Disciples, Blood Gorgons, Brotherhood of Darkness, Chaos Fleet, Chaos Space Marine, Children of Purgatos, Claws of Lorek, Cleaved, The, Company of Misery, Company of the Shadow, Damned Company of Lord Caustos, Dark Tusks, Death Guard, Death Mongers, Death Shadows, Disciples of Destruction, Dragon Warriors, Dreadclaw, Emperor's Children, Extinction Angels, Faithless, The, Flawless Host, The, Gal Vorbak, Hakanor's Reavers, Horus, Iron Warriors, Knights of Blood, Lords of Decay, Lorgar, Mortarion, Night Lords, Night Stalkers, Nightkillers, Oracles of Change, Perturabo, Pilgrimage of Lorgar, Plague Marines, Punishers, Purge, The, Pyre, The, Reborn, The, Red Corsairs, Renegade Space Marines, Sanctified, The, Scourged, The, Silver Guards, Skulltakers, Skyrar's Dark Wolves, Sons of Malice, Sons of Vengeance, Steel Brethren, Steel Cobras, Swords of Khargoth, Tainted, The, Terminus Est, Thousand Sons, Thunder Barons, Violators, Warp Ghosts, Warriors of Aggannor, Warriors of Mayhem, Word Bearers, World Eaters. Excerpt: The 63rd Expeditionary Fleet was one of the Imperium of Man's interstellar military expeditions sent out as part of the Emperor of Mankind's Great Crusade to reunite all the human-settled worlds of the Milky Way Galaxy under his rule during the 31st Millennium. The 63rd Expedition was commanded by the Primarch and Warmaster Horus of the Luna Wolves (later renamed the Sons of Horus) Space Marine Legion. It formed the core of the Traitor forces that would challenge the Emperor for control of the Imperium during the terrible interstellar civil war known as the Horus Heresy. ...\nISBN13: 9781234650391\nISBN10: 1234650398","torrent":{"xt":"urn:btih:f3eaa07cdfc9658eb48b0a4fea47ec79afbfccfb","amp;dn":"Warhammer+40k+-+Index+Chaotica+-+Terminus+Est","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f3eaa07cdfc9658eb48b0a4fea47ec79afbfccfb","infoHashBuffer":{"type":"Buffer","data":[243,234,160,124,223,201,101,142,180,139,10,79,234,71,236,121,175,191,204,251]},"announce":[],"urlList":[]}}