{"title":"Ivor Horton's Beginning Java,7th Edition{BBS}","uid":6824951,"size":72374602,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f40518b7a12908b6678d84128f21543833455e90&amp;dn=Ivor+Horton%5C%27s+Beginning+Java%2C7th+Edition%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1321490050,"description":"The most thorough and accessible introduction to the Java language\n\nWhether you want to learn Java to write customized applets to embed in your web pages or large-scale applications, this is the book for you. Ivor Horton's comprehensive and easy-to-use tutorial guide provides you with the essential know-how for developing programs using the latest Java Development Kit 7 (JDK 7). It integrates step-by-step examples with clear explanations of key concepts to clearly show you the ins and outs of Java development. As you progress through the chapters, you'll gain invaluable programming experience that will enable you to begin writing fully featured, real-world Java programs.\n\nIvor Horton's Beginning Java:\n\n    *\n\n      Covers the main terms and concepts that are essential to programming in Java\n    *\n\n      Explains what the language elements do and how you can effectively apply them in practice\n    *\n\n      Provides an extensive introduction to the key packages in the Java class library illustrated with full working examples\n    *\n\n      Walks you through building a robust application to give you a better understanding of how to apply Java in practical projects\n    *\n\n      Explores the XML and XSLT capability that comes with the JDK\n\nWrox Beginning guides are crafted to make learning programming languages and technologies easier than you think, providing a structured, tutorial format that will guide you through all the techniques involved.\n\nwrox.com\n\nProgrammer Forums\nJoin our Programmer to Programmer forums to ask and answer programming questions about this book, join discussions on the hottest topics in the industry, and connect with fellow programmers from around the world.\n\nCode Downloads\nTake advantage of free code samples from this book, as well as code samples from hundreds of other books, all ready to use.\n\nRead More\nFind articles, ebooks, sample chapters and tables of contents for hundreds of books, and more reference resources on programming topics that matter to you.\nAbout the Author\nIvor Horton is one of the preeminent authors of tutorials on the Java, C, and C++ programming languages. He is widely known for the tutorial style of his books, which provide step-by-step guidance easily understood even by first-time programmers. Horton is also a systems consultant in private practice.\nProduct Details\n\n    * Paperback: 1152 pages\n    * Publisher: Wrox; Java 7 Edition edition (September 27, 2011)\n    * Language: English\n    * ISBN-10: 0470404140\n    * ISBN-13: 978-0470404140","torrent":{"xt":"urn:btih:f40518b7a12908b6678d84128f21543833455e90","amp;dn":"Ivor+Horton%5C%27s+Beginning+Java%2C7th+Edition%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f40518b7a12908b6678d84128f21543833455e90","infoHashBuffer":{"type":"Buffer","data":[244,5,24,183,161,41,8,182,103,141,132,18,143,33,84,56,51,69,94,144]},"announce":[],"urlList":[]}}