{"title":"[MomsTeachSex] Lizzie Bell, Savannah Fyre (Toy Demonstration)","uid":11764722,"size":261884096,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:f4e100436369ea31a7a11040415b003a21e58f13&amp;dn=%5BMomsTeachSex%5D+Lizzie+Bell%2C+Savannah+Fyre+%28Toy+Demonstration%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Upl0ad3rR","files":1,"time":1426699781,"description":"---:More From My Torrent's Here:---   &lt;a href=&quot;\nhttps://thepiratebay.se/user/Upl0ad3rR&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.se/user/Upl0ad3rR&lt;/a&gt;\n\n---:ScreeNshotS:---  &lt;a href=&quot;\nhttp://image-tpb.com/img-5509a859485a3.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image-tpb.com/img-5509a859485a3.html&lt;/a&gt; \n &lt;a href=&quot;\nhttp://image-tpb.com/img-5509a859c648b.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image-tpb.com/img-5509a859c648b.html&lt;/a&gt; \n &lt;a href=&quot;\nhttp://image-tpb.com/img-5509a85b76e8b.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image-tpb.com/img-5509a85b76e8b.html&lt;/a&gt; \n\nSavannah Fyre is starting a new business where she sells sex toys, and she decides to try out her spiel on her stepson Michael Vegas and his girlfriend Lizzie Bell. She starts out by showing off all of the various sex toys that she has on offer, and she quickly convinces Lizzie that the toys are best explained with a demonstration.\n\nAfter getting Lizzie naked, Savannah offers her the first toy to suck and feel the glassy texture. Then she slides the toy down Lizzie's body until she reaches the blonde's bald pussy and slides it in. Lizzie starts moaning almost instantly as she enjoys the feeling of having her snatch fucked by Savannah's toy.\n\nOf course the girls don't want to exclude Michael, who eagerly joins them when Savannah and Lizzie invite him over. Taking the toy from his stepmom, Michael slowly pumps it in and out of her tight fuck hole with strokes that speed up as Lizzie's gasps of excitement grow louder.\n\nWhile Michael works his magic on Lizzie's snatch, Savannah chooses the next toy that she'd like to demonstrate. Michael decides that perhaps it's his stepmom's turn to have some fun, so after giving her a searing kiss he tugs her clothes off and presses the toy to her landing strip twat.\n\nBoth girls are soon up on the table enjoying their respective toys as Michael does whatever he can to help increase their pleasure. Now that Savannah and Lizzie are all warmed up, the real fun for all three of them can start. Michael spots another toy that he'd like to try, so he arranges the two girls on their hands and knees and then slides a double-headed dildo into each of their fuck holes so that they can explore the sensual pleasure together.\n\nNow Michael finally gets his reward when Lizzie and Savannah press him down onto the table for a double blowjob. These cock hungry chicks can't get enough of licking and sucking on Michael's dick and taking turns Hoovering his heavy ballsack.\n\nThe trio rearranges themselves so that Lizzie is on her feet bent over Savannah's display table with her face buried in Savannah's muff and her pussy getting fucked hard by Michael. Once Lizzie has had her fill, it's Savannah's turn to lay down on the table with her legs spread for a good pussy pounding and her tongue busy fondling Lizzie's clit for one more Big O.\n\nTheir lovemaking nearing completion, Michael goes full-tilt in Savannah's fuck hole until he just can't hold back any longer. Pulling out at the last moment, he jizzes all over his stepmom's soft folds and leaves a delicious mess for Lizzie to lap up with warm wet strokes of her tongue and snowball into Savannah's mouth.\n\nSize: 261884096 bytes (249,75 MiB), duration: 00:30:45, avg.bitrate: 1136 kb/s\nAudio: aac, 44100 Hz, stereo, s16, 77 kb/s (eng)\nVideo: h264, yuv420p, 640x360, 1052 kb/s, 23,98 fps(r) (eng)","torrent":{"xt":"urn:btih:f4e100436369ea31a7a11040415b003a21e58f13","amp;dn":"%5BMomsTeachSex%5D+Lizzie+Bell%2C+Savannah+Fyre+%28Toy+Demonstration%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f4e100436369ea31a7a11040415b003a21e58f13","infoHashBuffer":{"type":"Buffer","data":[244,225,0,67,99,105,234,49,167,161,16,64,65,91,0,58,33,229,143,19]},"announce":[],"urlList":[]}}