{"title":"eComStation 2.0 RC4 (OS2)","uid":3956726,"size":578712133,"categoryP":"applications","categoryS":"other_os","magnet":"?xt=urn:btih:f57a7c16d6545d6b5e09345c53675c25ae148a73&amp;dn=eComStation+2.0+RC4+%28OS2%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"blandreth","files":4,"time":1199206377,"description":"=== eComStation 2.0 RC4 README ===\n\n-=# The Christmas 2007 release #=-\n\n!!! WHEN TESTING BETA SOFTWARE, ALWAYS BE SURE TO HAVE A TRIED AND TESTED\n    BACKUP OF YOUR SYSTEM !!!\n\nThank you for your interest in testing the latest version of eComStation 2.0.\nA great deal of effort has been made to improve the usefulness to the\nproduct. Please see the &amp;#039;WHATSNEW.TXT&amp;#039; document for an overview of all\nchanges.\n\nThis product is available for download to all registered users of Software\nSubscription Services for eComStation.  For more information, please\nvisit: &lt;a href=&quot; http://www.ecomstation.com/subscription/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.ecomstation.com/subscription/&lt;/a&gt;\n\nThis release offers a number of improvements that we would like to have\ntested on a larger number of configurations.  These are:\n\n\n** Netware installation from CD1 **\n\nIt is now possible to add Netware client support to eComStation, straight\nfrom the installation CD. This is especially important for those customers\nthat have a Netware networking environment.\n\n\n** Preboot harddisk integrity check **\n\nThere are several situations which may cause installation problems with LVM\nin the install process. In this release, it is possible to disable the\nintegrity check at page 2 (miscellaneous) of the eComStation installer\npreboot menu.\n\n- PBR problems:  Set when either the &amp;#039;hidden sectors&amp;#039; or the geometry fields\nin a bootsector do not match the position of the partition or the used\ndisk-geometry.\n\n- CHS problems:  Set when the CHS-values in a partition-table for a\n  partition do NOT match the current disk-geometry used by the operating\n  system.  This may lead to error from (mini)LVM about the disk being\n  &amp;#039;corrupt&amp;#039;.  Another possible cause for this error is that if there are\n  any partitions present on a disk that have NO LVM information at all,\n  and are of a type that gets a default driveletter assigned in that case\n  (by OS2LVM.DMD/OS2DASD.CMD)\n\n- Boot problems:  Set when extended-containers are marked ACTIVE, when\n  multiple primaries are marked ACTIVE, or if any non-standard flagbyte\n  values are used in the partitiontable.  These errors MAY lead to the\n  system failing to boot properly!\n\nThese will now be detected before the installer starts and an option to fix\nthem is being presented.  If you choose not to fix them, you are not able\nto proceed the installation.\n\nThis technology uses a custom DFSee &amp;#039;engine&amp;#039; and should be safe, however,\nneither Serenity Systems International nor Fsys can be held liable for any\ndamages that may occur to the data on your harddrive.\n\n\n** Harddisk volume resizing **\n\nThis version has a custom DFSee engine that enables reliable RESIZING of FAT32\nand NTFS filesystems to allow shrinking an existing Windows installation to\nmake room for eComStation on the same system.  While this functionality has\nbeen available in DFSee (and the OEM Engine) for quite a while, it was NOT\nconsidered reliable enough to offer to end users during eComStation install.\nStarting with DFSee release 7.12, and the OEM Engine based on that, the\nreliability of resizing has improved to the point where it can be used\nwithout hesitation for this purpose.  A Windows NTFS filesystem resized by\nDFSee will pass a subsequent Windows CHKDSK with NO ERRORS now. The engine\nincluded in RC4 is at level 9.04.\n\nThe GUI to this tool has been updated and is now using a graphical interface.\nTo invoke it, please select &amp;#039;Paritition Resizing Tool&amp;#039; from the Installation\nVolume Manager which can be called during installation (choose &amp;#039;New Volume&amp;#039;\nto start MiniLVM). It will take a while to complete loading, when done,\nplease select Next to show the list of resizable volumes. If the list is\nempty, this means there is no suitable volume detected that has enough free\nspace for it to be resized.\n\nThe GUI has been updated to be more intuitive to the user and will only show\nresize panes when there is an actual volume available for resizing. If you\nknow you have freespace available on your Windows volume, but they do not \nshow up, you can consider running (multiple times) &quot;defrag&quot; under Windows, \nthis will rearrange the file layout on disk and may yield in more space\nthat can be actually freed up. The diskresizer now will show a progress \nbar during resizing.\n\nIf the entire disk is occupied by a Windows Vista preload installation,\ninstallation of eComStation will not be possible and the installer will \nabort (the preboot integrity check will prevent further booting).\nYou can create freespace on the drive by using the tools supplied by Windows \nVista to manage your disk. In &amp;#039;FAQ.TXT&amp;#039; a small howto is included.\n\n\n** Bootable JFS **\n\nThis release of eComStation contains the option to install the operating\nsystem on a JFS volume. The advantage of doing this is that the amount of\ndiskcache is only limited by system memory (typically 10% of available\nmemory is assigned)\nThis increased cache size gives a huge gain in overall system performance.\nTo install onto a Bootable JFS volume, you will have to select &amp;#039;JFS&amp;#039; as\nfilesystem type in the &amp;#039;Format Volume&amp;#039; page of the installer.\n\nA number of analysis tools are available on the install CD:\n\nin ECSBOOTJFS\n\ncachejfs.exe   - query and set parameters of cache\ncstats.exe     - query usage of cache\n\nin ECSBOOTJFSDEBUG\n\nchklgjfs.exe - show results of last chkdsk\ndumpfs.exe   - dump internal structure of JFS\nlogdump.exe  - dump current state of log to JFSLOG.DMP\nvalidfs.exe  - show current state of JFS\nxchkdmp.exe  - show results from chkdsk.new\nxchklog.exe  - dump results of last chkdsk to chkdsk.new\nxpeek.exe    - utility for interactive work with structure of JFS\n\n\n** Genmac 2.20 RC1 **\n\nThis package provides generic driver support for several network interface\ncards under OS/2 and eComStation.  Moreover, Genmac is enabled to support WPA\nencryption with the Wireless LAN Monitor 3.x or better.\n\nGenmac and the Wireless LAN monitor will be installed when the appropriate\nhardware is detected by the installer.  If it is not detected, you can\nmanually select the driver in the network installation dialog.\n\nNote:  only the selected driver will be copied onto your system, in order to\nprevent problems with the MPTS installer later on.  This may seem confusing,\nwhen you run MPTS in a later stage, it will not show all Genmac supported\nNICs.\n\nVersion 2.20 rc1 of GenMac now supports the NETBEUI protocol.\n\nVersion 2.20 rc1 of GenMac now offers suspend &amp; resume on a limited set of network\nadapters (when used in conjunction with ACPI) - this is an *experimental* \nfeature. More details can be found in ecsdocgenmac\n\nPlease note that UniAud has known problems with suspend &amp; resume, so if you\nwant to use this feature, you should not activate the UniAud driver currently.\n\nA full list of supported NIC chipsets can be found in &amp;#039;WHATSNEW.TXT&amp;#039;.\nSupport has been added to autodetect over 300 NICs that are using one of\nthese chipsets.\n\n\n** ACPI &amp; APM **\n\nSupport for ACPI is available in this release.  The current version is 3.05.\nACPI will be automatically enabled if appropriate hardware is detected.\nYou can manually enable or disable ACPI support at page 4 (USB &amp; ACPI)\nof the eComStation installer preboot menu.  Even if not installed, the\ncorresponding documents are installed on your harddrive. You can find\ndetailed information and testdocuments in ECSDOCACPI and ECSDOCAPM\n\nSeveral tests can be performed, please refer to ECSDOCACPITESTER.DOC\nand ECSDOCAPMTESTER.DOC\n\nWhen ACPI is installed, there is a number of utilities from the ACPI\nToolkit you can use, see the list below:\n\nAcpiTree.exe            - Show ACPI tree\nButtonJin.exe           - Wait press Power Button (as demon), GUI\nWaitButton.exe          - Wait press Power/Sleep button, VIO\nPowerOff.exe            - Power Off (immediate!!)\nSetGetThrtl.exe         - Get/Set throtlling CPU\nUpTime.exe              - Show uptime via PM Timer\nGetValue.exe            - Get current value from PM Timer\nAcpiIRQ.exe             - Show current IRQ routing\nIrqStat.exe             - Show IRQ calling statistics (SMP only)\nSetGetState.exe         - Get/Set frequency/power state\nEmbeddedEvent.exe       - Show events from Embedded controllers\nGetNotify.exe           - Show notify\nThermal.exe             - Show temperature of thermal zone\nScanPCI.exe             - Show PCI devices\nTmrTest.exe             - Test working of timer (testing IRQ0 timer 0)\n\n\n** multicore CPU support **\n\nThis release supports the installation of eComStation on a MultiCore CPU\ncomputer. This includes Intel Core Duo , Core2 Duo and AMD 64 X2.\nTo enable it, you can do so in the ACPI Wizard that is launched from the\nPost Installation tasks at the end of the installation. Alternatively you\ncan start the ACPI Wizard at any time from the install/remove folder in\nthe Local System folder on the desktop.\n\nThe ACPI Wizard will try to determine your system configuration and set\nparameters accordingly. You can manually change them of course.\n\nPlease note: many drivers are not SMP capable, which may cause\ninstability or unexpected behaviour on your system.\n\nFor more information please refer to ECSDOCACPIACPI_SMP.DOC\n\n\n** SMP support **\n\nIt is also possible to install eComStation 2.0 RC4 on a regular SMP\nmachine. You will have to activate it with the ACPI Wizard from the\nPost Installation Tasks wizard that is started at the end of the\ninstallation. This should enable you to properly finish installation,\nbefore activating the SMP feature.\n\n\n** Uninstall SMP support **\n\nIt is possible to undo a SMP installation, for example because your system\nseems unstable or does not properly function with SMP activated. \nFor instructions on how to perform uninstallation, please refer to &amp;#039;FAQ.TXT&amp;#039;\nin the root of the CD.\n\n\n** eComStation Virtual File System (Samba client support) **\n\nSamba is a SMB/CIFS protocols file and print sharing server/client set\noriginally made for UNIX world to cooperate with corresponding Windows and\nOS/2 servers or clients.  eComStation has a native implementation of\nSMB/CIFS server/client set - IBM LAN Manager and IBM Peer.  These products\nhave not been recently updated and may have some compatibility issues with\nmodern Windows SMB/CIFS implementations.\n\nSerenity Systems International has reached an agreement with Blueprint\nSoftware Works for the inclusion of the &amp;#039;eComStation Virtual File System&amp;#039;\ndriver which provides support for Samba Client.  Currently a GUI to\nconfigure it is lacking, but an example of how to mount a Samba resource\ncan be found in ECSDOCEVFSREXX\n\n** EVFS GUI **\n\nThere now is a GUI that will make it easier to configure network access \nusing the Samba protocol. There is one big limitation though, the tool \ncannot determine if a network connection was properly created - so it \nwill not provide sensible feedback on that, instead it will always \ncreate a mountpoint which may be empty if the actual connection fails.\nThe object for this tool is placed in the &quot;Local Network&quot; folder and is \ncalled &quot;Virtual Filesystem for SMB&quot;\n\n\n== REPORTING ==\n\nTo tell us your findings, please create a report at:\n &lt;a href=&quot;\nhttp://www.ecomstation.com/support/rc4report/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.ecomstation.com/support/rc4report/&lt;/a&gt;\n\nYou are also welcome to join the TestTeam if you want to discuss this beta\nand future developments.  See http://ewiki.ecomstation.nl/TestTeam for\nmore details.\n\n\n== DISTRIBUTION / CREATING CDS ==\n\nThis product is provided as a downloadable ISO file, this is a raw CD image\nthat you can burn on CD-R media.  For instructions on burning the CD image\nto CD please consult the PDF document howtoburncds.pdf in the same\ndirectory.\n\nThe file to download is:  ecs20rc4_cd1_en.zip\n\n\n== REGISTRATION KEY REQUIRED FOR INSTALLING ==\n\nFor the time being you can use the eComStation 1.2 (or 1.2R) key to install\nthis release candidate of eComStation 2.0.\n\n\n(c) 2001-2007 Serenity Systems International\n\n[eof]\n","torrent":{"xt":"urn:btih:f57a7c16d6545d6b5e09345c53675c25ae148a73","amp;dn":"eComStation+2.0+RC4+%28OS2%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f57a7c16d6545d6b5e09345c53675c25ae148a73","infoHashBuffer":{"type":"Buffer","data":[245,122,124,22,214,84,93,107,94,9,52,92,83,103,92,37,174,20,138,115]},"announce":[],"urlList":[]}}