{"title":"Timothy Leary Archives vol.1","uid":4188664,"size":39978468,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f5a7f9b410692db530f8626f0a51e047f0f4b1fb&amp;dn=Timothy+Leary+Archives+vol.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"ToddPhilly","files":158,"time":1210814631,"description":"150+ pdf files (digital scans) of material related to Timothy Leary on CDROM containing hand-written and typed letters, love notes, prison messages,  telegrams, mailgrams, etc. Mostly from the 1960&amp;#039;s-70&amp;#039;s and some as late as 1994. Some early drafts of studies, questionares (trip reports), some have Leary&amp;#039;s notations hand written.\n\nIncludes letters to, from (mostly from) or about:\n\nWilliam Burroughs, Ram Dass, Ralph Metzer, Yoko Ono Lennon, PETER ORLOVSKY, BOB GUCCIONE, Kurt Vonnegut, Jr., G. GORDON LIDDY, Allen Ginsberg, Arthur Koestler, Andy Weil, Albert Hoffman, Fitz Hugh Ludlow, Bob Wilson, Larry Flynt, Aldous Huxley, Stanislav Grof, Cheech &amp; Chong, Hugh M. Hefner, Susan Sarandon, Olliver Stone, Wm. Buckley, Carl Sagan, and others.\n\nMaterial from Government officials, publishers, artists, chemical companies, Media reps, Playboy Enterprises, CIA, NIH,\nEdward Levi, Attorney General of the US, The Native American Church of NY, and more.\n\nTopics include LSD, mushroom cults in Mexico, DEA arrests, psychedelic states, weed, UFO&amp;#039;s, psychedelia,  pot, legal problems, theft and ransom of manuscripts for two books, Ayahuasca, DMT, kidnapping in Afghanistan, psycho-chemistry, space-time, poetry, mystic and magick experiences, ketalar, Psilocybin, mescaline, Cannabis Sativa, plans to &quot;turn on&quot; artists, Willem de Kooning &amp; Franz F., Allen G. writes to ask if Leary &quot;turned on&quot; the Kennedy brothers, yet. Warnings about the green LSD; lots more!\n\nExcellent collection of fascinating first-person accounts of the life and times of Dr. Leary. You could copy some of these from the archives at Harvard, Texas courthouses, California prisons, FOIA requests, Leary&amp;#039;s friends... or just grab this collection here while its available. Free Adobe Reader required (link enclosed on CD)","torrent":{"xt":"urn:btih:f5a7f9b410692db530f8626f0a51e047f0f4b1fb","amp;dn":"Timothy+Leary+Archives+vol.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f5a7f9b410692db530f8626f0a51e047f0f4b1fb","infoHashBuffer":{"type":"Buffer","data":[245,167,249,180,16,105,45,181,48,248,98,111,10,81,224,71,240,244,177,251]},"announce":[],"urlList":[]}}