{"title":"Owl City - Vanilla Twilight  (2nafish)","uid":5488884,"size":82401284,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:f5e5a6ff142d80fee38b1a0bd94369dfd67fdfdc&amp;dn=Owl+City+-+Vanilla+Twilight++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"2nafish","files":-1,"time":1270880728,"description":"File Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 8000 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;Vanilla Twilight&quot; is a song by Owl City. The song was released as the second single from his second album Ocean Eyes, although the song has received chart placement prior to the release date, due to the release of the album.\n\nThe music video for &quot;Vanilla Twilight&quot; premiered on March 24, 2010. The video uses the Album Version of the song. It features a cameo by Shaquille O'Neal. The video was directed by Steve Hoover and was filmed on location in Pittsburgh, PA and at the Marblehead Lighthouse in Ohio.\n\nVarious people witness and revere swirling mammatus cloud formation associated with a squall line. It has a well-defined vortex which is lit by a veiled Sun on an overcast day after a snowfall has blanketed the area, hence vanilla twilight. Midway through the video the storm and a lighthouse glimmer with aurora colors.\n\n&quot;Vanilla Twilight&quot; is about Adam Young's high school girlfriend, who moved away, though some believe it to be about an ex-girlfriend who passed away in a car accident. He sings of lost love, and the happy and painful memories that come with it. The song features both piano and synthesizer  instrumentation.\n\nThe radio edit has an instrumental intro that is not found on the album version.\n\nOn the chart of November 7, 2009, the same week &quot;Fireflies&quot; hit #1, &quot;Vanilla Twilight&quot; debuted on #95 in the Billboard Hot 100. It has since re-entered and peaked on the Hot 100 at #72.\n\n&quot;Vanilla Twilight&quot; first entered the Australian Singles Chart at #50 on the week ending January 11, 2010, which happened to coincide with &quot;Fireflies&quot; holding its reign as the #1 single.\n\nFollowing the release of Ocean Eyes, &quot;Vanilla Twilight&quot; entered the UK Singles Chart at a current peak of #94, making it Owl City's second consecutive single to enter the UK Top 100.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:f5e5a6ff142d80fee38b1a0bd94369dfd67fdfdc","amp;dn":"Owl+City+-+Vanilla+Twilight++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f5e5a6ff142d80fee38b1a0bd94369dfd67fdfdc","infoHashBuffer":{"type":"Buffer","data":[245,229,166,255,20,45,128,254,227,139,26,11,217,67,105,223,214,127,223,220]},"announce":[],"urlList":[]}}