{"title":"LLVM Cookbook (2015) (Pdf, Epub &amp; Mobi) Gooner","uid":12564724,"size":10934691,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f5f09ed6ba0aea7290f9e9db9aa253b6468a067e&amp;dn=LLVM+Cookbook+%282015%29+%28Pdf%2C+Epub+%26amp%3B+Mobi%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":3,"time":1444766232,"description":"Publisher: Packt Publishing - ebooks Account (June 30, 2015)\r\nLanguage: English\r\nISBN-10: 178528598X\r\nISBN-13: 978-1785285981\r\n\r\nOver 80 engaging recipes that will help you build a compiler frontend, optimizer, and code generator using LLVM\r\n\r\nAbout This Book\r\n\r\nWrite a frontend for any language to generate LLVM IR\r\nCreate optimization passes to optimize the IR code using LLVM Pass Infrastructure and Pass Manager\r\nDesign and implement structures for highly-optimized compilers using LLVM, through detailed step-by-step recipes\r\n\r\nWho This Book Is For\r\n\r\nThe book is for compiler programmers who are familiar with concepts of compilers and want to indulge in understanding, exploring, and using LLVM infrastructure in a meaningful way in their work.\r\n\r\nThis book is also for programmers who are not directly involved in compiler projects but are often involved in development phases where they write thousands of lines of code. With knowledge of how compilers work, they will be able to code in an optimal way and improve performance with clean code.\r\n\r\nWhat You Will Learn\r\nIntroduction to LLVM modular design and LLVM tools\r\nWrite a frontend for a language\r\nAdd JIT support and use frontends for different languages\r\nLearn about the LLVM Pass infrastructure and the LLVM Pass Manager\r\nCreate analyses and transform optimization passes\r\nBuild a LLVM TOY backend from scratch\r\nOptimize the code at SelectionDAG level and allocate registers to variables\r\n\r\nIn Detail\r\n\r\nLLVM is a compiler framework with libraries that provides a modern source-and target-independent optimizer, along with a code generator.\r\n\r\nThis book not only explains the effective use of the compiler infrastructure that LLVM provides, but also helps you implement it in one of your projects. You start with a simple task to get you up-and-running with LLVM, followed by learning the process of writing a frontend for a language, which includes writing a lexer, a parser, and generating IR code. You will then see how to implement optimizations at different levels, generate target-independent code, and then map this generated code to a backend. Finally, you will look into the functionalities that the LLVM infrastructure provides, such as exception handling, LLVM Utility Passes, using sanitizers, the garbage collector, and how we can use these in our projects","torrent":{"xt":"urn:btih:f5f09ed6ba0aea7290f9e9db9aa253b6468a067e","amp;dn":"LLVM+Cookbook+%282015%29+%28Pdf%2C+Epub+%26amp%3B+Mobi%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f5f09ed6ba0aea7290f9e9db9aa253b6468a067e","infoHashBuffer":{"type":"Buffer","data":[245,240,158,214,186,10,234,114,144,249,233,219,154,162,83,182,70,138,6,126]},"announce":[],"urlList":[]}}