{"title":"Frank Marino &amp; Mahogany Rush - Tales Of The Unexpected FLAC","uid":4761592,"size":318729134,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f6662e625be895d79a42ac764d58ee5742f9f4fc&amp;dn=Frank+Marino+%26+Mahogany+Rush+-+Tales+Of+The+Unexpected+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"sowingmyseed","files":9,"time":1236718392,"description":"1. Sister Change\n2. All Along the Watchtower\n3. Norwegian Wood (This Bird Has Flown)\n4. Tales of the Unexpected\n5. Down, Down, Down\n6. Door of Illusion\n7. Woman\n8. Bottom of the Barrel \n\nBy the late '70s, Mahogany Rush were no longer simply Mahogany Rush; they were billing themselves as Frank Marino &amp; Mahogany Rush, which was appropriate given that frontman Marino had done so much to shape the power trio's sound. Not only was Marino Mahogany Rush's lead singer and guitarist, he was also the person who wrote all of the songs on studio albums like 1972's Maxoom, 1974's Child of the Novelty, and 1975's Strange Universe. So when Tales of the Unexpected came out in 1979, none of Marino's admirers complained about seeing the name Frank Marino &amp; Mahogany Rush on the front cover. This is both a live album and a studio album; in its original vinyl LP configuration, Tales of the Unexpected (which was reissued on CD in early 2008) consisted of four studio recordings on side one and four live performances on side two. Back in 1979, some fans wondered why the band was offering more live recordings after having just provided a live LP for Columbia in 1978; perhaps that was Marino's way of addressing fans who complained that their live album should have been a two-LP set instead of a single LP. At any rate, Tales of the Unexpected has a lot going for it. The studio material, all of it solid, ranges from enjoyably psychedelic covers of the Beatles' &quot;Norwegian Wood&quot; and Bob Dylan's &quot;All Along the Watchtower&quot; to the funky &quot;Sister Change&quot; and the instrumental title track (which finds the hard rock/metal unit venturing into jazz fusion territory and indicates that Marino had been seriously checking out Chick Corea's Return to Forever and John McLaughlin's Mahavishnu Orchestra). The live tracks, meanwhile, include ballsy, inspired performances of &quot;Woman,&quot; &quot;Down, Down, Down,&quot; &quot;Door of Illusion,&quot; and &quot;Bottom of the Barrel.&quot; Although not as essential as Strange Universe, Tales of the Unexpected was a respectable way for Marino and his colleagues to say goodbye to the '70s.","torrent":{"xt":"urn:btih:f6662e625be895d79a42ac764d58ee5742f9f4fc","amp;dn":"Frank+Marino+%26+Mahogany+Rush+-+Tales+Of+The+Unexpected+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f6662e625be895d79a42ac764d58ee5742f9f4fc","infoHashBuffer":{"type":"Buffer","data":[246,102,46,98,91,232,149,215,154,66,172,118,77,88,238,87,66,249,244,252]},"announce":[],"urlList":[]}}