{"title":"[Les_Pardew_Don_Seegmiller]Mastering Digital 2D and 3D Art. The ","uid":11066614,"size":31998774,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f680e976377f1256e7441da978d1e11374b15672&amp;dn=%5BLes_Pardew_Don_Seegmiller%5DMastering+Digital+2D+and+3D+Art.+The+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"zombie_rox","files":2,"time":1411228882,"description":"Today's digital artists know how important it is to learn all aspects of digital art if they hope to succeed in today's marketplace. &quot;Mastering Digital 2D and 3D Art&quot; is the first book of its kind, helping intermediate to advanced readers master the fine points of both 2D and 3D art creation--two areas that are quickly merging. An advanced book on digital art creation, this book focuses specifially on creating great art on a computer and includes numerous examples and hands-on tutorials. It approaches the topic in a step-by-step fashion, comprehensively explaining how to create a broad range of digital art.\n\nPublisher: Course Technology PTR; 1 edition (December 15, 2004)\nLanguage: English\nISBN-10: 1592005616\nISBN-13: 978-1592005611\n\nEditorial Reviews\nAbout the Author\nLes Pardew is a recognized leader in the world of interactive entertainment. He is a video game and entertainment industry veteran with more 20 years of industry experience. His artwork credits encompass film and video production, magazine and book illustration, and more than 100 video game titles, including numerous market-leading choices. Les has also authored or co-authored 13 books on game art and game design for teens, digital art and 2D and 3D animation, drawing, and virtual models. Les started his career in video games doing animation for Magic Johnson Fast Break Basketball for the Commodore 64, He went on to help create several major games, including Robin Hood Prince of Thieves, Star Wars, Wrestle Mania, NCAA Basketball, Stanley Cup Hockey, Jack Nicklaus Golf, Where in the World/USA is Carmen Sandiego?, StarCraft Brood Wars, Rainbow Six, Cyber Tiger Woods Golf, and many others. An accomplished instructor, Les has taught numerous art and business courses, including teaching as an adjunct faculty member at Brigham Young University's Marriott School of Management. As a business leader, Les has founded two separate game development studios. He is also a favorite speaker at video game conferences and events.\n\nDon Seegmiller is a very successful artist, author, and instructor. He has a Bachelor of Fine Arts degree and teaches senior-level illustration, traditional head painting, figure drawing, and digital painting courses at a variety of schools. He worked for six years as art director for Saffire Corporation, is a regular speaker at the game Developers Conference, and was the keynote speaker at the American Association of Medical Illustrators convention in 2003. He is the author of the first edition of this book, the Painter edition, and co-author of Mastering Digital 2D and 3D Art with Les Pardew. His work is also featured in The Painter 6 Wow Book, The Painter 7 Wow Book, Electronic Step-by-Step Design, Spectrum 7, Spectrum 8, and it has also been on display at Wadle Galleries of Santa Fe since 1981. \n\n","torrent":{"xt":"urn:btih:f680e976377f1256e7441da978d1e11374b15672","amp;dn":"%5BLes_Pardew_Don_Seegmiller%5DMastering+Digital+2D+and+3D+Art.+The+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f680e976377f1256e7441da978d1e11374b15672","infoHashBuffer":{"type":"Buffer","data":[246,128,233,118,55,127,18,86,231,68,29,169,120,209,225,19,116,177,86,114]},"announce":[],"urlList":[]}}