{"title":"EXPLOITED COLLEGE GIRLS - Summer - Her First Hard Fuck SD","uid":9161718,"size":561588923,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:f70fb20d0b636a30145013a66960cb7f35e6f2bb&amp;dn=EXPLOITED+COLLEGE+GIRLS+-+Summer+-+Her+First+Hard+Fuck+SD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"beta2008x","files":1,"time":1383880438,"description":" &lt;a href=&quot; http://imgboxxx.com/viewer.php?file=jx2ew_srm.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://imgboxxx.com/viewer.php?file=jx2ew_srm.jpg&lt;/a&gt;\n  &lt;a href=&quot;\nhttp://imgboxxx.com/viewer.php?file=5ynto_ecg_summer_s.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgboxxx.com/viewer.php?file=5ynto_ecg_summer_s.jpg&lt;/a&gt;\n\nThis week brings a real first to ECG: a slim 22 year old blonde who wants to break into the porn industry, she brings her best friend who stays and helps out as assistant lube and camera girl!\n\nI start off a little differently and go straight to the behind the scenes where we meet Summer and her friend Keisha. They've driven all the way to ECG HQ from their trailer park in Kansas to break into the glamourous world of internet porn. Well, Sumer has. Keisha is here for moral support (and later, vibrator support). Summer explains that she's interested in getting into the adult biz and is sure her amazing first ever performance on ECG will vault her to Sasha Grey like stardom. When she brags about how much she likes to suck dick (she's even brought her own accessories) I have her hop down and show me while Keisha watches wide eyed.\n\nAfter some really great, enthusiastic head I call for a cut and have Summer get made up and changed. Keisha never moves to leave so I hand her a camera and have her help out as I try to finger Summer to orgasm. Considering she doesn't even hesitate when I hand her a vibrator and have her hold it on her friend's clit, I think it's obvious that these two are very, very good friends. During our interview Summer indicated that she was up for anything, including anal. You know that there are few things I love as much as the butt, so I try to get her to relax her ass enough to take a small dildo. I end up getting it in there, but she's so tight that full on anal just isn't going to happen.\n\nFortunately, Summer's pussy is almost as tight as her ass and she really gets off on some hard fucking. You can see a ton of great angles of her pussy when Keisha playa amateur gynecologist with camera 2. I start off with her on her back and after she cums, I flip her over into doggy and as I'm drilling her I order Keisha to help by fingering her ass. Then I pin her down while I fuck her hard. She really loves it and the whole time I can see Keisha getting more and more turned on, which gets me going harder and harder.\n\nAfter pounding Summer's little ass into the bed for a while in the trademark ECG pin down position, and giving her another big orgasm it's time for the big finish. I have her get on her knees and get Keisha to grab the second camera to catch every drop. Summer helps with the balls and I take aim and cover her face with Jay jizz. This update turned out to be a lot of fun, I might have to hire Keisha to be my full time second camera...\t\t","torrent":{"xt":"urn:btih:f70fb20d0b636a30145013a66960cb7f35e6f2bb","amp;dn":"EXPLOITED+COLLEGE+GIRLS+-+Summer+-+Her+First+Hard+Fuck+SD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f70fb20d0b636a30145013a66960cb7f35e6f2bb","infoHashBuffer":{"type":"Buffer","data":[247,15,178,13,11,99,106,48,20,80,19,166,105,96,203,127,53,230,242,187]},"announce":[],"urlList":[]}}