{"title":"Not a Genuine Black Man- Or, How I Claimed My Piece of Ground in","uid":11021301,"size":3213232,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f7bddc1d3f2e0db25f4b9ef3d427a948d2208ca4&amp;dn=Not+a+Genuine+Black+Man-+Or%2C+How+I+Claimed+My+Piece+of+Ground+in&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"gratefuldawg77","files":6,"time":1410581831,"description":"Based on the longest-running one-man show in San Francisco history--now coming to Off-Broadway--a hilarious, poignant, and disarming memoir of growing up black in an all-white suburb In 1972, when Brian Copeland was eight, his family moved from Oakland to San Leandro, California, hoping for a better life. At the time, San Leandro was 99.4 percent white, known nationwide as a racist enclave. This reputation was confirmed almost immediately: Brian got his first look at the inside of a cop car, for being a black kid walking to the park with a baseball bat. Brian grew up to be a successful comedian and radio talk show host, but racism reemerged as an issue--only in reverse--when he received an anonymous letter: &quot;As an African American, I am disgusted every time I hear your voice because YOU are not a genuine Black man!&quot; That letter inspired Copeland to revisit his difficult childhood, resulting in a hit one-man show that has been running for nearly two years--which has now inspired a book. In this funny, surprising, and ultimately moving memoir, Copeland shows exactly how our surroundings make us who we are.","torrent":{"xt":"urn:btih:f7bddc1d3f2e0db25f4b9ef3d427a948d2208ca4","amp;dn":"Not+a+Genuine+Black+Man-+Or%2C+How+I+Claimed+My+Piece+of+Ground+in","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f7bddc1d3f2e0db25f4b9ef3d427a948d2208ca4","infoHashBuffer":{"type":"Buffer","data":[247,189,220,29,63,46,13,178,95,75,158,243,212,39,169,72,210,32,140,164]},"announce":[],"urlList":[]}}