{"title":"John Pyka - Tales from the Flip-Side","uid":13670391,"size":132662512,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:f878ddf717eb0982e19e9bb2d63f54028c6cc89c&amp;dn=John+Pyka+-+Tales+from+the+Flip-Side&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Cybotage","files":3,"time":1456312791,"description":"He began life as a gangster. He found a new path as an entertainer. He never knew how far he'd go to end up a hero.\r\n\r\nIn 1946, a chronal event ripped a hole in space-time, transporting ex-gangster turned entertainer &quot;Big Daddy Cool&quot; Johnny Dellarocca into the future. Now, tethered to this new time, Dellarocca can travel into his past to influence events to shape the present and his future.\r\n\r\nTales from the Flip-Side reveals the tale of one of the earliest adventures of Big Daddy Cool and the Bombshell Kittens leading up to that day in 1946. In the final days of WWII, Chicago Holo-Visor reporter Penny Lane has been kidnapped and is being held for ransom by Chicago's most infamous villain, Dr. Diablo. With Chicago's masked heroes on a secret mission in Europe, it's up to &quot;Big Daddy Cool&quot; and his super powered showgirls, The Bombshell Kittens, to stop Dr. Diablo and save Chicago's most beloved reporter from the machinations of the madman. However, behind the scenes, there's another threat - a greater evil lurking, pulling the strings and seeking universal domination.\r\n\r\nMobsters. Vampires. Nazis. Showgirls. Masked Vigilantes. High stakes adventure in an alternate Dieselpunk history! Tales from the Flip-Side by John Pyka is the debut volume in The World of Big Daddy Cool imprint from Pro Se Productions. \r\n\r\nRead by J. Scott Bennett\r\nFormat: MP3\r\nBitrate: 64 Kbps","torrent":{"xt":"urn:btih:f878ddf717eb0982e19e9bb2d63f54028c6cc89c","amp;dn":"John+Pyka+-+Tales+from+the+Flip-Side","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f878ddf717eb0982e19e9bb2d63f54028c6cc89c","infoHashBuffer":{"type":"Buffer","data":[248,120,221,247,23,235,9,130,225,158,155,178,214,63,84,2,140,108,200,156]},"announce":[],"urlList":[]}}