{"title":"Stan Getz &amp; Jimmy Raney - Complete Studio Sessions (2003) D1 (19","uid":4722426,"size":147576268,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f88d2ce3d0c80bfdbfdaf8951835a599dd6bf20b&amp;dn=Stan+Getz+%26+Jimmy+Raney+-+Complete+Studio+Sessions+%282003%29+D1+%2819&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"schon55","files":26,"time":1234582100,"description":"Stan Getz &amp; Jimmy Raney - Complete Studio Sessions D1\nRelease Date: December 2, 2003 \nAudio CD: August 2, 2004\nFormat: Import, Original recording remastered \nLabel: Definitive Spain \nBitrate: 320 kbps\n\nEditorial Reviews\nProduct Description\nThis double-CD shows the magical interplay of the Getz-Raney classic partnership at its finest while outlining the evolution of their playing both as individuals &amp; as a unit over this crucial five year span. They are joined by some truly exceptional sidemen, including Earl Swope, Kai Winding, Zoot Sims, Al Cohn, Horace Silver, Duke Jordan, Red Mitchell, Tommy Potter, &amp; Roy Haynes. 20-bit remastered. Definitive.  2003.\n\nAny tribute to Jimmy Raney not mentioning the amazing work he did with Stan Getz during 1948-1953 would be lacking in perspective. To that end, here are the complete studio recordings made by these two giants for a multitude of labels including Sittin' in With, Roost, Savoy, Sesco, Clef, Prestige et al with musicians of the caliber of Duke Jordan, Curly Russell, Blossom Dearie, Horace Silver, Roy Haynes, Frank Isola, and many others in this lovingly remastered 41-track, 2-disc set.\n\nThis double-disc set features all of the studio performances between saxophonist Stan Getz and guitarist Jimmy Raney recorded between October of 1948 and April of 1953. The sheer number of labels the pair recorded for is staggering, from Sittin' in With to Roost, Savoy, Sesco, Clef, Prestige, and others.  And while Getz, particularly on the early sides, is still deeply entrenched in his worship of Charlie Parker, the cool elegance of Raney's own playing is already asserting itself on the early sides, so that by 1951, Getz has moved toward the center from strictly bebop.  Some of the other players on these sessions include Duke Jordan, Curly Russell, Blossom Dearie, Horace Silver, Roy Haynes, Frank Isola, and many others.  There are 41 performances in all, giving a striking portrait of the era, and of Getz's development as a soloist and bandleader in particular. Raney arrived fully developed and just got better.  The sound quality is solid here and the remastering job on these tracks is warm and full despite their many original sources. ~ Thom Jurek\n\n\nStan Getz &amp; Jimmy Raney - Complete Studio Sessions D1 Tracks:\n01  Pardon My Bop \n02  As I Live and I Bop \n03  Interlude in Bebop \n04  Diaper Pin \n05  Stan Getz Along \n06  Stan's Mood \n07  Slow \n08  Fast \n09  Skull Buster\n10  Ante Room \n11  Poop Deck \n12  Pennies from Heaven \n13  Pinch Bootle \n14  Earless Engineering\n15  Be Still, TV \n16  Short P, Not LP \n17  Melody Express .\n18  Yvette \n19  Potter's Luck \n20  The Song Is You \n21  Wildwood","torrent":{"xt":"urn:btih:f88d2ce3d0c80bfdbfdaf8951835a599dd6bf20b","amp;dn":"Stan+Getz+%26+Jimmy+Raney+-+Complete+Studio+Sessions+%282003%29+D1+%2819","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f88d2ce3d0c80bfdbfdaf8951835a599dd6bf20b","infoHashBuffer":{"type":"Buffer","data":[248,141,44,227,208,200,11,253,191,218,248,149,24,53,165,153,221,107,242,11]},"announce":[],"urlList":[]}}