{"title":"The Encyclopedia of Political Science Set - 1st Ed (2010) Gooner","uid":12243192,"size":50743498,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f8fbd5c765862a3c9b9a158a4b96194eb9ecf201&amp;dn=The+Encyclopedia+of+Political+Science+Set+-+1st+Ed+%282010%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1439831212,"description":"Publisher: CQ Press; 1st edition (October 12, 2010)\nLanguage: English\nISBN-10: 1933116447\nISBN-13: 978-1933116440\n\nA 21st century approach to the study of politics Political science needs a resource that serves as a core reference to the central ideas, concepts, and frameworks underlying the study of politics and that highlights the intersections of politics with other disciplines. &quot;The Encyclopedia of Political Science (TEPS)&quot; is designed to fill that need. It is the encyclopedia for political science in the twenty-first century. Prepared with the assistance of the American Political Science Association (APSA), &quot;TEPS&quot; brings together a distinguished editorial board and over 600 distinguished and rising scholars to chronicle and assess the core issues that have long concerned students of politics. This comprehensive, multi-volume work traces the evolution of political theories, concepts, research frameworks, and political practices from across the world. As it examines the interplay of political ideas and processes, the encyclopedia also conveys the vitality and excitement of politics in practice. Cognizant of the global nature of political ideas and movements, TEPS reflects a wide range of concepts and frameworks, both Western and non-Western, national and international. An authoritative survey of the state of politics and political science, this five- volume work consists of more than 1,500 A to Z signed entries by contributors from over 30 countries, including 300 overview articles or interpretive essays. The encyclopedia supports all of the core undergraduate courses in political science: American government, comparative politics, international relations, public policy, public administration, political behavior, political theory, and political science methods. It will be an essential reference for all academic and public libraries. Quick Facts: thematic Table of Contents that maps major subfields and topics in politics; over 1,500 A to Z entries; contributing essays from scholars across the globe; and, prepared with the assistance of the American Political Science Association","torrent":{"xt":"urn:btih:f8fbd5c765862a3c9b9a158a4b96194eb9ecf201","amp;dn":"The+Encyclopedia+of+Political+Science+Set+-+1st+Ed+%282010%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8fbd5c765862a3c9b9a158a4b96194eb9ecf201","infoHashBuffer":{"type":"Buffer","data":[248,251,213,199,101,134,42,60,155,154,21,138,75,150,25,78,185,236,242,1]},"announce":[],"urlList":[]}}