{"title":"Rubbra - Sym #5 - Hickox, BBC Nat O of Wales (1996) [Philidor]","uid":15382257,"size":117918430,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:fadf5b6c7e980ffe41492f3ac15e8d5d785301fc&amp;dn=Rubbra+-+Sym+%235+-+Hickox%2C+BBC+Nat+O+of+Wales+%281996%29+%5BPhilidor%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Philidor","files":8,"time":1469239226,"description":"&quot;Symphony No. 5 is easily his best known work having been recorded on 78 by Barbirolli with the Hallé back in the 1950s and having been reissued several times since then and still being available on EMI. It is as sombre as anything in its two predecessors though Rubbra maintains (in his programme note) that the gap of six years that separate this from No 4 'was sufficient to obliterate the previous symphonic period'. Grand universal dances wheel and stagger counterpointed by guttural horns and hoarse brass (perhaps influenced by William Alwyn). The second movement is almost neo-classical in its lightly bubbling allegro having something in common with the Sibelius 3rd symphony especially in the woodwind parts. The following grave is ruminative and subdued - a quality that closes the finale which is otherwise as light-footed and uncomplicatedly optimistic as the second movement. Some of the more tangily exuberant moments have a hint of the symphonic Vaughan Williams about them.&quot; - Rob Barnett, Musicweb-International\r\n\r\nAs Barnett states, this became Rubbra's best known and loved symphony. It is typical of his mature work, with an uneasy ostinato moving beneath searching, fantasia-like lines. Transformation rather than development is the game, and Rubbra plays it exceptionally well. Sadly, he fell into neglect during the period when the UK's leading musical lights decided to program in concert and on radio only Britten and British serialists, to &quot;compete&quot; with the Continent. But by the 1990s when reaction set in, Rubbra's reputation began climbing, again.\r\n\r\nTransfers are made at 768 kBits/s, directly from the disc.\r\n\r\nBio enclosed. You can find all my classical uploads by searching on Philidor, or in this thread:\r\n  \nhttps://pirates-forum.org/Thread-Philidor-s-uploads--63895","torrent":{"xt":"urn:btih:fadf5b6c7e980ffe41492f3ac15e8d5d785301fc","amp;dn":"Rubbra+-+Sym+%235+-+Hickox%2C+BBC+Nat+O+of+Wales+%281996%29+%5BPhilidor%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fadf5b6c7e980ffe41492f3ac15e8d5d785301fc","infoHashBuffer":{"type":"Buffer","data":[250,223,91,108,126,152,15,254,65,73,47,58,193,94,141,93,120,83,1,252]},"announce":[],"urlList":[]}}