{"title":"Leaked - GUNS AND WEED: THE ROAD TO FREEDOM","uid":6013426,"size":838007322,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:fb48934fe48542a3413aa00878c956e4d281594d&amp;dn=Leaked+-+GUNS+AND+WEED%3A+THE+ROAD+TO+FREEDOM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"daprincegmgt7","files":-1,"time":1291543566,"description":"GUNS AND WEED: THE ROAD TO FREEDOM\n\n640 x 480 MP4, high quality, tagged chapter files, ReadMe and cover art. Plays on iPod, iPhone, Android phones, Windoz Media Player, iTunes, iPad, etc. \n\n \nA lively documentary film from Michael W. Dean and Neema Vedadi. \nENGLISH. 91 minutes. 16x9.\n\n&quot;Guns and Weed is an intelligent documentary addressing prohibition, regulation, taxes, government schools and property. It wisely advocates that \nif you want to be free, you must stand up for the liberty of other peaceful humans, even those who would do or possess things with which you \ndisagree.&quot;\n--Ian Freeman, Free Talk Live radio \n\nSTREET DATE: March 22, 2011.\n\nA stunning and entertaining examination of Constitutional issues in America. Covers abuse of authority by police, the War on Drugs, self-defense, States' Rights, Natural Rights, Austrian Economics, the problems of a two-party system and taxation.\nCategory: POLITICAL FILMS - CONSTITUTIONAL ISSUES AND FREEDOM\n\nTAG LINE: Because there's no such thing as &quot;half-free.&quot;\n\nWebsite: &lt;a href=&quot;\nhttp://www.GunsAndWeed.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.GunsAndWeed.com&lt;/a&gt;\n\nFEATURING: Sheriff Richard Mack, MamaLiberty, Shane Scheid, Neema Vedadi, J-Tizzle, Shepard Humphries and many more. \n\nGuns and Weed: The Road to Freedom shows, in no uncertain terms, why of Freedom Ingestion and the Right to Keep and Bear Arms are equally \nindisputable civil rights, and why the War on Drugs and the War on Guns are both entirely immoral. \nPart hip hop, part punk rock. Part entertainment, part civics lesson. Filmed in the Wild West of Wyoming and Colorado. Features mountains \nof marijuana, great interviews, comedy, fake news, animation, rock video and stunning outdoor footage of cute girls and guys shooting guns \nthat are not legal in California. \n\nDVD CHAPTER TITLES:\n\n1 - FREEDOM'S ONE PIECE\n2 - THE PRICE OF PRISON\n3 - FREEDOM OF INGESTION\n4 - HOW POT WAS OUTLAWED\n5- WHO LIKES THE WAR ON DRUGS?\n6 -TYRANNY TODAY\n7 - GOOD COPS / BAD COPS\n8 - BAN BANNING \n9 - SIMPLY HAD GOOD TASTE\n10 - NOT LEGAL IN CALIFORNIA\n11 - IN THE ABSENCE OF GOVERNMENT REGULATORY BODIES\n12 - I WAS JUST SITTIN' IN MY HOUSE, CHILLIN'\n13 - MY STATE'S BETTER THAN YOUR STATE\n14 - REDEMPTION \n15 - WHO DID WHAT\n16 - DON'T DRONE ME, BRO!\n\nWriter / Director Michael Dean directed the documentary films D.I.Y. Or Die: How To Survive as an Independent Artist and \nHubert Selby Jr: Itll Be Better Tomorrow and is the author of the book $30 Film School. He sang and played bass \nin the band Bomb (Warner Brothers).\n\nWriter / star Neema Vedadi is a libertarian hip-hop artist by night and a mild-mannered TV reporter by day. He won the 2010 Wyoming \nAssociation of Broadcasters award for Best News Piece. \n\n\n","torrent":{"xt":"urn:btih:fb48934fe48542a3413aa00878c956e4d281594d","amp;dn":"Leaked+-+GUNS+AND+WEED%3A+THE+ROAD+TO+FREEDOM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb48934fe48542a3413aa00878c956e4d281594d","infoHashBuffer":{"type":"Buffer","data":[251,72,147,79,228,133,66,163,65,58,160,8,120,201,86,228,210,129,89,77]},"announce":[],"urlList":[]}}