{"title":"Friday.Night.Lights.2x02.DVB.Xvid.Mp3.[Spanish]","uid":4407538,"size":364416103,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:fb854c685622e2bcfed6c3e412c329f4e24dab23&amp;dn=Friday.Night.Lights.2x02.DVB.Xvid.Mp3.%5BSpanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"Bajandoestrenos","files":1,"time":1222038826,"description":"es una reconocida serie de televisiÃƒÂ³n estadounidense ganadora de numerosos premios, adaptada por Peter Berg, Brian Grazer y David Nevins a partir de un el libro Friday Night Lights: A Town, a Team and a Dream, escrito por H. G. Bissinge y Friday Night Lights, pelÃƒÂ­cula homÃƒÂ³nima protagonizada por Billy Bob Thornton. Producida por la NBC Universal y emitida por la NBC debutando el 6 de octubre de 2006 con un nÃƒÂºmero inicial de 22 episodios. La NBC consiguiÃƒÂ³ la renovaciÃƒÂ³n de la serie para una segunda temporada que debutÃƒÂ³ el 5 de octubre de 2007. Temporada que se viÃƒÂ³ obligada a finalizar en el episodio 15 debido a la Huelga de guionistas en Hollywood de 2007-2008 dando lugar a la especulaciÃƒÂ³n de la posible cancelaciÃƒÂ³n de la serie. Sin embargo la serie ha sido renovada para una tercera temporada que constarÃƒÂ¡ de 13 episodios. Para conseguir esta renovaciÃƒÂ³n se llegÃƒÂ³ a un acuerdo con direcTV que comenzarÃƒÂ¡ con la emisiÃƒÂ³n de la tercera temporada el 1 de octubre de 2008 dejando la reposiciÃƒÂ³n de la temporada en manos de la NBC para el invierno de 2008 y 2009","torrent":{"xt":"urn:btih:fb854c685622e2bcfed6c3e412c329f4e24dab23","amp;dn":"Friday.Night.Lights.2x02.DVB.Xvid.Mp3.%5BSpanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb854c685622e2bcfed6c3e412c329f4e24dab23","infoHashBuffer":{"type":"Buffer","data":[251,133,76,104,86,34,226,188,254,214,195,228,18,195,41,244,226,77,171,35]},"announce":[],"urlList":[]}}