{"title":"The Chemistry of Explosives 3rd ed - Jacqueline Akhavan","uid":14728434,"size":4057164,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fc37d221d9b4b2f986da4e7362fc9baee55a0025&amp;dn=The+Chemistry+of+Explosives+3rd+ed+-+Jacqueline+Akhavan&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"clouderone","files":1,"time":1464571109,"description":"The Chemistry of Explosives 3rd ed - Jacqueline Akhavan (RSC, 2011).pdf\r\n\r\nISBN 978-1-84973-330-4\r\n\r\nThe third edition of this popular book has been fully revised and updated and outlines the basic principles needed to understand the mechanism of explosions by chemical explosives. The history, theory and chemical types of explosives are introduced, providing the reader with information on the physical parameters of primary and secondary explosives. Thermodynamics, enthalpy, free energy and gas equations are covered together with examples of calculations, leading to the power and temperature of explosions. The new generation of explosive compositions called Insensitive High Explosives (IHE) have been introduced in this third edition with details of their properties. The effect explosives have on the environment has also been introduced together with relevant legislations. The new edition contains information on polyphosphazenes, high nitrogen molecules and details on new explosives such as LLM-105, CL-20, FOX-7, FOX-12, and DADNE. More detailed information is also provided on safety and the EMTAP tests. The book will aid the understanding of the theory of hot spots and its relationship to detonation and provides details on the manufacturing process for explosive molecules containing nitro, nitrate esters and nitramines. This concise, readable book is ideal for 'A' level students and new graduates with no previous knowledge of explosive compositions. With detailed information on a vast range of explosives in tabular form and an extensive bibliography, this book will also be useful to anyone needing succinct information on the subject, such as the more experienced chemist in the explosives industry","torrent":{"xt":"urn:btih:fc37d221d9b4b2f986da4e7362fc9baee55a0025","amp;dn":"The+Chemistry+of+Explosives+3rd+ed+-+Jacqueline+Akhavan","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc37d221d9b4b2f986da4e7362fc9baee55a0025","infoHashBuffer":{"type":"Buffer","data":[252,55,210,33,217,180,178,249,134,218,78,115,98,252,155,174,229,90,0,37]},"announce":[],"urlList":[]}}