{"title":"Herbal Bonsai Practicing the Art With Fast-Growing Herbs","uid":4758257,"size":2627188,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fc3ea26c4ae68d55b4f96bb0c7777a1a161dfd2f&amp;dn=Herbal+Bonsai+Practicing+the+Art+With+Fast-Growing+Herbs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"philmccrevice","files":1,"time":1236568367,"description":"Bonsai, the art of training a tree to grow on a small scale in a container (yet to resemble a full-size tree), has a tradition thousands of years old, first in China and then in Japan. Traditional bonsai uses such trees as pine, juniper, maple, elm, and holly, which can survive for hundreds of years and take generations to develop. Bender's method is to use relatively fast-growing woody herbs such as rosemary, scented geraniums, and sweet bay laurel to grow mature specimens in only a year. He describes about 30 herbs that he recommends, dividing them into seven groups based on their growth characteristics and environmental needs. There are chapters on training an herbal bonsai, developing it in one growing season, potting and shaping a field-grown bonsai, training a container-grown bonsai, and caring for and displaying them. Bender also suggests ways to enhance the appearance of a bonsai using rocks, sand, gravel, ground cover, figurines, and the right kind of pot. George Cohen \n\nProduct Description\nThe art of bonsai, as traditionally practised, calls for training shrubs and trees to mimic -- in miniature -- the gnarled ancients of forest and crag. Those traditional specimens may need more than fifty years to mature, but by using woody herbs, you can get comparable effects in less than one year. Rosemary, scented geraniums, the thymes, and many other easily grown herbs are ideal for bonsai. In this book, horticulturist Richard W Bender shares his innovative technique, providing you with advice on choosing the appropriate herbs for the kinds of bonsai you wish to create. Practical instructions guide you through every step of the process. \n\n","torrent":{"xt":"urn:btih:fc3ea26c4ae68d55b4f96bb0c7777a1a161dfd2f","amp;dn":"Herbal+Bonsai+Practicing+the+Art+With+Fast-Growing+Herbs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc3ea26c4ae68d55b4f96bb0c7777a1a161dfd2f","infoHashBuffer":{"type":"Buffer","data":[252,62,162,108,74,230,141,85,180,249,107,176,199,119,122,26,22,29,253,47]},"announce":[],"urlList":[]}}