{"title":"The Angels of Light - How I Loved You [2001][FLAC]","uid":10587121,"size":451750591,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:fce7abb782a0e09c5b791c2f0787b2bb953d71a8&amp;dn=The+Angels+of+Light+-+How+I+Loved+You+%5B2001%5D%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"dickspic","files":-1,"time":1405757671,"description":"FLAC / Lossless / Log (100%) / Cue\nLabel/Cat#: Young God #YG 16CD\nCountry: USA\nYear: March 20, 2001\nGenre: rock,americana\nFormat: CD\n\n\n\n[b]\n\n\n01. &quot;Evangeline&quot; - 8:45\n02. &quot;Untitled Love Song&quot; - 4:49\n03. &quot;My True Body&quot; - 6:03\n04. &quot;Jennifer's Sorry&quot; - 3:38\n05. &quot;Song for Nico&quot; - 4:08\n06. &quot;New City in the Future&quot; - 11:48\n07. &quot;My Suicide&quot; - 5:35\n08. &quot;New York Girls&quot; - 8:11\n09. &quot;Public Embarrassment Blues&quot; - 4:47\n10. &quot;Two Women&quot; - 11:50\n\n\n\n\n\nMichael Gira, songwriter, vocalist, and producer, has been a constant on the independent music scene for over 20 years. His music has evolved restlessly and relentlessly over the course of many projects from Swans to Skin to the Body Lovers/Body Haters to spoken word recordings and now to the Angels of Light. Through it all, his vision has been one of extremes, from violence to tenderness, often in the same breath. He has taken the broken, the sick, and the unmentionable and, through a singular vision of the universe as a collection of inseparable entities, often transformed these horrific shadows into works of great beauty and force -- even if that beauty is covered under an excess and aggression so pure they are sometimes frightening. Angels of Light's How I Loved You moves far from that terrain and into a zone of languid reverie, bittersweet longing, and crystalline excess. The mood resembles previous Angels of Light recordings only in that the tone of the songs is largely acoustic with a palette of oblique electronic washes and blurred sonic architectures applied for cavernous, orchestral atmosphere. Its elegance is seductive, and that seduction is necessary because the resplendent beauty Gira creates is adorned with confusion, and a melancholy celebration of all that is ambivalent in the human heart while in the grips of the purest desire: the one that wishes to possess the object of one's affection at any cost. The band is comprised of Gira on vocals, guitars, and effects; Christoph Hahn on lap and electric guitars; Lawrence Mullins on percussion; Dana Shecter on bass and piano; Birgit-Cassis Staudt on accordion, piano, and Casio; and Thor Harris on dulcimer and piano. They are joined by Bliss Blood on vocals and Kid Congo Powers on electric guitar. Gira's collaborators are so in the truest sense of the word, helping to shape a sound with no center other than the vision of the love song itself. The disc opens with &quot;Evangeline,&quot; a song that echoes the traditional folk song in title only. This paean -- painted with a sparse piano, strummed acoustic guitar, and unidentifiable sounds -- is a requiem. As the protagonist offers his vision of the woman's beauty so still and peaceful in its &quot;sleeping&quot; state, aware of her unselfishness and her beauty in still life under city skies, her tenderness and innocence become the reflection of all that is present in the still-life shell that represents itself nakedly in front of the singer. He holds this picture in the grain of his voice, tracing the lips of memory in its fullness, no longer present, but gone beyond &quot;steel door dreams.&quot; In &quot;Untitled Love Song,&quot; a stringed instrument reminiscent of a mandolin or even a ukulele enters into an echo-filled hallway, where organ, piano, and guitar slip themselves into a mix so gauzy and slow it's almost invisible. When Gira's protagonist appears, he sings, &quot;Free from your past, free from your future too/There's nothing left to rise above but you/Show me ocean red, kiss the tears that stain my neck/Drug me with visions untrue/But I own a photograph, you lay there naked upon your back/Safe in a stone house by the sea....&quot; It's a country song and the emotion -- powerful, elegiac, disturbing -- is tender and almost transparent in its wishes. The backing vocals waft and wend their way through Gira's vocal, and every word -- no matter how far off the beaten path it seems -- rings true. Each song moves into progressively more stirring, beautiful, and terrible territory, where no boundaries exist, the line between love and violence never was, and the only thing that matters is exposing how deep the wound goes. Love reveals itself in all its forms, with shadow the trace element for achieving any real understanding of love's complexities. On &quot;Song for Nico,&quot; Gira reveals that, on its face, eros is shallow, but beneath its mask is a labyrinthine corridor of fathomless depth and obsession. As music and mystery become one in the world of ambiguity and emotion of the Angels of Light, Gira makes them visible to the naked heart without artifice or pretension. In &quot;Two Women,&quot; amid a slow, droning electric guitar, drowsy with its own warmth and its twin acoustic, Gira sings, &quot;I, I wrote a poem on your porcelain white back/And you, you cut the cord in me/And you, you wore the mask/Painted red, with golden cross/And in your hands a glitter blue/You hold the knife that cuts the sun/The polished knife, it cuts me too/And I'm nailed to your shadow and I thank you for my birth....&quot; How I Loved You reveals, once more, that for Michael Gira and his Angels of Light, there are no contradictions, no gods, and no monsters in the caverns of love's secret domain.\n","torrent":{"xt":"urn:btih:fce7abb782a0e09c5b791c2f0787b2bb953d71a8","amp;dn":"The+Angels+of+Light+-+How+I+Loved+You+%5B2001%5D%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fce7abb782a0e09c5b791c2f0787b2bb953d71a8","infoHashBuffer":{"type":"Buffer","data":[252,231,171,183,130,160,224,156,91,121,28,47,7,135,178,187,149,61,113,168]},"announce":[],"urlList":[]}}