{"title":"Diff'rent Strokes Seasons 1-8 Complete","uid":9388531,"size":63217038725,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:fd3c1a8147259ff9241a0ec2d655d26532dd97ab&amp;dn=Diff%27rent+Strokes+Seasons+1-8+Complete&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":4,"uploader":"fluffykins13","files":193,"time":1387842181,"description":"My significant other requested me to snatch some torrents.  It took me almost 2 weeks to get all 8 seasons of diff'rent strokes from multiple sources of 24/7 connection.  Most sources had 1-3 seeders with very poor speeds.\n\nI never watch TV and I didn't really know anything about this show ever so I was surprised that a show with a celebrity that I had heard of was difficult to get from public trackers.  A relative told me that there was a lot of controversy surrounding the actors/actresses and there were controversial episodes.  I don't really care - I just wanted to help people share.  Gary is funny in this show at the times I've caught glimpses of it.\n\nI noticed that at least 1 episode from season 2 is missing but I haven't checked the rest.  Season 1-2 look like DVD rips but I don't know the technical information to put, sorry I rarely do torrents or know much about this stuff but I will seed for a long time.  Seasons 3-8 sadly look like someones VHS collection.  Each file is about +30 minutes a piece with commercials - they are a good quality recording of a BET channel showing of the show.  It was like someone taped every episode with the best quality blank tape they could find.  If you don't mind the commercials or lack of HD, come enjoy some Gary Coleman and occasionally very awkward and uncomfortable lessons.","torrent":{"xt":"urn:btih:fd3c1a8147259ff9241a0ec2d655d26532dd97ab","amp;dn":"Diff%27rent+Strokes+Seasons+1-8+Complete","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd3c1a8147259ff9241a0ec2d655d26532dd97ab","infoHashBuffer":{"type":"Buffer","data":[253,60,26,129,71,37,159,249,36,26,14,194,214,85,210,101,50,221,151,171]},"announce":[],"urlList":[]}}