{"title":"Anal Buffet 6 (2011)","uid":6472953,"size":2924201984,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:fe4963ac46e360a17217cc241aa06df85791d3c6&amp;dn=Anal+Buffet+6+%282011%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":3,"uploader":"webchella","files":4,"time":1308217406,"description":"Anal Buffet 6 (2011)\n &lt;a href=&quot;\nhttp://www.excaliburfilms.com/AdultDVD/3000371D6_Anal_Buffet_6_dvd.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.excaliburfilms.com/AdultDVD/3000371D6_Anal_Buffet_6_dvd.htm&lt;/a&gt;\n\nStudio  Evil Angel Ea-Productions \nRelease Date  Jun 14, 2011 \nCategory  All Sex, Anal \nDirector  Jay Sin \nStarring  Phoenix Marie, Jynx Maze, Tara Lynn Foxx, Diamond Kitty, Tori Lux, Anita Hengher, Lara Page, Eloa, Lana Blond \n\nLil' Diamond Kitty Gets A Big Dose Of Cock And Asshole From Ms. Marie!\n\nLactating Whore Lara Gives Her Milk And Ass To Fat Cock!\n\nBig Ass Lil' Jynx Takes A Huge Cock Up Her Slut Holes And Loves Every Inch Deep!\n\nHuge Ass ...    Full DescriptionAnd Tits Hottie Eloa Takes On 2 Big, Black Cocks And Drains The Cum Out Of Them!\n\nSlut Anita Takes On A Gang Of Cocks All Stuffed Into Her Gaping, Wet Holes!\n\nA Buffet Of Tits, Ass, And Gapes With These Three Beauties!\n\nAss fiend Jay Sin has revolutionized anal porn with his over-the-top shooting style and single-minded rectal fetishism. The two-disc Anal Buffet 6 is filled with sick colonic perversions as fully packed as the asses of Jay's gorgeous female performers. These girls have been specially selected for their huge anal gaping abilities, as well as their eagerness to suck cock ass-to-mouth or deep-tongue another girl's wide-open bunghole. Even the DVD bonus scene, with luscious anal stuntladies Isabella Clark and Alysa, begins with a warning... 'Extreme Rectal Prolapsing: Viewer Discretion is Advised'! (This unbelievable footage alone, which features enormous toys, outrageous rimming and disturbing monster gapes, is worth the price of the disc.)\n\nHowever, there's an assload more stuff, including 78 minutes of behind-the-scenes footage and outtakes, to add to the six nasty scenes of girl-on-girl rimming, sphincter winking, ATM ass fucking, double penetration and giant anal toys... with the likes of voluptuous Eloa (part of a three girl/one guy orgy as well as a double-dicking by two black studs), womanly whore Anita Hengher (who tackles four cocks), Lara Page (who sprays breast milk all over Lana Blond's gaping ass) and super-cute butthole slave Jynx Maze (inserting massive plastic balls into her elastic rear end). Do you dare watch? Butt of course!\n\n\n","torrent":{"xt":"urn:btih:fe4963ac46e360a17217cc241aa06df85791d3c6","amp;dn":"Anal+Buffet+6+%282011%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe4963ac46e360a17217cc241aa06df85791d3c6","infoHashBuffer":{"type":"Buffer","data":[254,73,99,172,70,227,96,161,114,23,204,36,26,160,109,248,87,145,211,198]},"announce":[],"urlList":[]}}