{"title":"Ian McNabb - Head Like A Rock (320kbps)","uid":5609210,"size":161102995,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:fe64bef61e8dffa901c8de724ccc999b4974237e&amp;dn=Ian+McNabb+-+Head+Like+A+Rock+%28320kbps%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"mjabba","files":11,"time":1275759966,"description":"CD rip at 320kbps\n\nIan McNabb (born Robert Ian McNabb, 3 November 1960, Liverpool, England) is known both for his work as leader and songwriter-in-chief of The Icicle Works in the 1980s, and his critically-acclaimed solo career throughout from the early 1990s to date.\n\n'Head Like a Rock' and Crazy Horse (1994)\n\nPost-Truth and Beauty, McNabb was allegedly inspired to a rockier sound by the engineer who mastered that record, telling him &quot;Aye, Ian, your rocking days are behind you.&quot; Legend has it that McNabb went back to his home in Liverpool, and recorded a demo of what would become the coruscating opener of Head Like a Rock, &quot;Fire Inside My Soul&quot;.\n\nLabel boss Andrew Lauder then suggested that McNabb go to record in America, which McNabb was skeptical about. He facetiously suggested to Lauder that his new material sounded like Neil Young and Crazy Horse, and if Lauder could get Crazy Horse to play on the record, he would go to America. A few phone calls later, McNabb found himself in a Los Angeles studio with Crazy Horse drummer Ralph Molina and bassist Billy Talbot. This cast-iron rhythm section appeared on four of the ten tracks on Head Like a Rock, including the #54 UK hit &quot;You Must Be Prepared To Dream&quot;. The album's other single, &quot;Go Into The Light&quot;, did not feature Crazy Horse and peaked at UK #66.\n\nHead Like a Rock was subsequently nominated for the 1994 Mercury Music Prize, and although M People would end up taking the award home, the attendant publicity surrounding the award-nominated album propelled Head Like A Rock into the UK album charts, where it peaked at #29.","torrent":{"xt":"urn:btih:fe64bef61e8dffa901c8de724ccc999b4974237e","amp;dn":"Ian+McNabb+-+Head+Like+A+Rock+%28320kbps%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe64bef61e8dffa901c8de724ccc999b4974237e","infoHashBuffer":{"type":"Buffer","data":[254,100,190,246,30,141,255,169,1,200,222,114,76,204,153,155,73,116,35,126]},"announce":[],"urlList":[]}}