{"title":"Blood Hunt The II AM Trilogy","uid":6963188,"size":658764,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ffa9e3e25e0830a6670536f06b93ea9a8e5208dd&amp;dn=Blood+Hunt+The+II+AM+Trilogy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":null,"files":1,"time":1326831245,"description":"Product Description\nHe killed her lover, and for that crime and many others, Two Majors cut off the vampire Abraham\\'s head, reduced his remains to ashes, and scattered them to the winds. Now each night she wanders New York, freed from the chains of heroin addiction but longing still for Theroen\\'s kiss, the taste of blood on his lips, the echo of his thoughts in her ears. There are other vampires out there; she knows it, and so she hunts.\n\nTori Perrault spent a dozen years living in the woods, stalking her prey in the dark and killing without mercy. Now, she too has returned to humanity, and struggles to come to terms with all that has happened. Her parents\\' love smothers her and life seems empty. She spends her nights in the bottle, and in the company of strange men. She doesn\\'t know that she is watched, until the fragile life she has rebuilt is torn from her and she is dropped suddenly into a world she never knew existed.\n\nRhes Thompson and Sarah Taylor have never met a vampire, and never want to. All they want is to help their friend Two, who falls further away from them with each passing day. They have all but given up when they are thrust into a world of madness, death, and vampire politics beyond their understanding. They must abandon their concern for Two, and worry instead about saving their own lives.\n\nBlood Hunt is the ambitious sequel to the popular Urban Fantasy novel The Blood That Bonds. Nearly twice as long as the first novel, Blood Hunt weaves together the stories of Two, Tori, Rhes and Sarah, along with a large cast of characters both old and new, as they attempt to navigate their way through the difficulties they face.","torrent":{"xt":"urn:btih:ffa9e3e25e0830a6670536f06b93ea9a8e5208dd","amp;dn":"Blood+Hunt+The+II+AM+Trilogy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ffa9e3e25e0830a6670536f06b93ea9a8e5208dd","infoHashBuffer":{"type":"Buffer","data":[255,169,227,226,94,8,48,166,103,5,54,240,107,147,234,154,142,82,8,221]},"announce":[],"urlList":[]}}