{"title":"Babel (NL.Subs)(2Lions-Team)","uid":5262323,"size":4685371992,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:ffac5416505f23f52f7f521be3fbe0eda22293ff&amp;dn=Babel+%28NL.Subs%29%282Lions-Team%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":1,"leechers":0,"uploader":"JUULTJE","files":-1,"time":1262778650,"description":"Verenigde Staten / Mexico / Frankrijk\n\n7 OSCAR NOMINATIES Beste film en regie. \nWINNAAR GOLDEN GLOBE  Beste Film 2007.\n\nDrama\n142 minuten\n\nRegie                 Alejandro GonzÃƒÂ¡lez IÃƒÂ±ÃƒÂ¡rritu\t  \t\nGenre                drama\nTijdsduur \t         142 minuten\nJaar \t         2006\nReleasedatum  2 november 2006\nActeurs \t         Cate Blanchett, Brad Pitt, Gael GarcÃƒÂ­a Bernal, Jamie McBride, KÃƒÂ´ji Yakusho, Lynsey Beauchamp, Paul Terrell Clayton, Fernandez Mattos Dulce, Nathan Gamble, Adriana Barraza, Mohammed Bennani, Clifton Collins Jr., Elle Fanning, Kana Harada, Rinko Kikuchi, Masami Kosaka, Sumire Matsumura, Charlie Matsuo, James Melody, Barbarella Pardo, Ivor Shier, Aaron D. Spears\nKijkwijzer \t     Let op met kinderen tot 16 jaar Seks\tGrof taalgebruik\t\n\t\n\nTwee jongens in Marokko, gewapend met geweren, gaan er op uit om hun kudde geiten te begeleiden. Onderweg besluiten ze hun geweren te testen en dit heeft desastreuze gevolgen. Het leven van vier groepen mensen staan in direct verband met het voorval. We zien het verhaal van een Amerikaans toeristenechtpaar, een Mexicaanse oppas die twee kinderen de Amerikaanse grens over smokkelt en een Japanse dove tiener en haar vader. Hun gebrekkige communicatievaardigheden ten overstaan van de mensen om hen heen zorgen ervoor dat zij, ondanks een incident wat hen allen verbindt, volkomen geÃƒÂ¯soleerd blijven.\n\n Engels\n\n4 interlocking stories all connected by a single gun all converge at the end and reveal a complex and tragic story of the lives of humanity around the world and how we truly aren't all that different. In Morocco, a troubled married couple are on vacation trying to work out their differences. Meanwhile, a Moroccan herder buys a rifle for his sons so they can keep the jackals away from his herd. A girl in Japan dealing with rejection, the death of her mother, the emotional distance of her father, her own self-consciousness, and a disability among many other issues, deals with modern life in the enormous metropolis of Tokyo, Japan. Then, on the opposite side of the world the married couple's Mexican nanny takes the couple's 2 children with her to her son's wedding in Mexico, only to come into trouble on the return trip. Combined, it provides a powerful story and an equally powerful looking glass into the lives of seemingly random people around the world and it shows just how connected we really are.\n\nNote Kijkwijzer with children under 16 years Sex  Coarse language  \n\nWeblink http://www.imdb.com/title/tt0449467/\nWeblink http://www.moviemeter.nl/film/36742\n\nVideo\nID                : 0xE0\nFormaat           : MPEG Video\nFormaatversie     : Version 2\nBitrate-modus     : Variabel\nBreedte           : 720 pixels\nHoogte            : 576 pixels\nBeeldverhouding   : 4:3\nFramerate         : 25,000 fps\nStandaard         : PAL\nAudio             : Engels\nSubs              : Dutch\nCover             : Yes\n\n***************************************** \n\nBrought to you by Juultje\n\n\n2Lions Team \n\n          &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl&lt;/a&gt; \n\n\n2Lions-Team for all your Dutch MOVIES and more \n\n***************************************** \n\nDON T HIT AND RUN Niet gelijk afhaken als de film binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\nto the fakers , get a life !!!\n \n \n \n\n \n \n \n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:ffac5416505f23f52f7f521be3fbe0eda22293ff","amp;dn":"Babel+%28NL.Subs%29%282Lions-Team%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ffac5416505f23f52f7f521be3fbe0eda22293ff","infoHashBuffer":{"type":"Buffer","data":[255,172,84,22,80,95,35,245,47,127,82,27,227,251,224,237,162,34,147,255]},"announce":[],"urlList":[]}}